// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Normal::Realtime::Native
namespace Normal::Realtime::Native {
  // Forward declaring type: AudioOutputStream
  class AudioOutputStream;
  // Forward declaring type: NetworkInfo
  struct NetworkInfo;
  // Forward declaring type: AudioInputStream
  class AudioInputStream;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Normal.Realtime.Native
namespace Normal::Realtime::Native {
  // Forward declaring type: Client
  class Client;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Normal::Realtime::Native::Client);
DEFINE_IL2CPP_ARG_TYPE(::Normal::Realtime::Native::Client*, "Normal.Realtime.Native", "Client");
// Type namespace: Normal.Realtime.Native
namespace Normal::Realtime::Native {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: Normal.Realtime.Native.Client
  // [TokenAttribute] Offset: FFFFFFFF
  class Client : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::Normal::Realtime::Native::Client::ClientState
    struct ClientState;
    // Nested type: ::Normal::Realtime::Native::Client::PersistenceMessageReceived
    class PersistenceMessageReceived;
    // Nested type: ::Normal::Realtime::Native::Client::RPCMessageReceived
    class RPCMessageReceived;
    // Nested type: ::Normal::Realtime::Native::Client::AudioOutputStreamCreated
    class AudioOutputStreamCreated;
    // Nested type: ::Normal::Realtime::Native::Client::AudioOutputStreamClosed
    class AudioOutputStreamClosed;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private Normal.Realtime.Native.Client/Normal.Realtime.Native.PersistenceMessageReceived persistenceMessageReceived
    // Size: 0x8
    // Offset: 0x10
    ::Normal::Realtime::Native::Client::PersistenceMessageReceived* persistenceMessageReceived;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Native::Client::PersistenceMessageReceived*) == 0x8);
    // private Normal.Realtime.Native.Client/Normal.Realtime.Native.RPCMessageReceived rpcMessageReceived
    // Size: 0x8
    // Offset: 0x18
    ::Normal::Realtime::Native::Client::RPCMessageReceived* rpcMessageReceived;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Native::Client::RPCMessageReceived*) == 0x8);
    // private Normal.Realtime.Native.Client/Normal.Realtime.Native.AudioOutputStreamCreated audioOutputStreamCreated
    // Size: 0x8
    // Offset: 0x20
    ::Normal::Realtime::Native::Client::AudioOutputStreamCreated* audioOutputStreamCreated;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Native::Client::AudioOutputStreamCreated*) == 0x8);
    // private Normal.Realtime.Native.Client/Normal.Realtime.Native.AudioOutputStreamClosed audioOutputStreamClosed
    // Size: 0x8
    // Offset: 0x28
    ::Normal::Realtime::Native::Client::AudioOutputStreamClosed* audioOutputStreamClosed;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Native::Client::AudioOutputStreamClosed*) == 0x8);
    // private System.IntPtr _nativeClient
    // Size: 0x8
    // Offset: 0x30
    ::System::IntPtr nativeClient;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private System.Collections.Generic.List`1<Normal.Realtime.Native.AudioOutputStream> _audioOutputStreams
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::Normal::Realtime::Native::AudioOutputStream*>* audioOutputStreams;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Normal::Realtime::Native::AudioOutputStream*>*) == 0x8);
    // private System.Byte[] _persistenceMessageBuffer
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<uint8_t> persistenceMessageBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Byte[] _rpcMessageBuffer
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<uint8_t> rpcMessageBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get static field: static private System.Int32 __numberOfClients
    static int _get___numberOfClients();
    // Set static field: static private System.Int32 __numberOfClients
    static void _set___numberOfClients(int value);
    // Get static field: static private readonly System.Object __numberOfClientsLock
    static ::Il2CppObject* _get___numberOfClientsLock();
    // Set static field: static private readonly System.Object __numberOfClientsLock
    static void _set___numberOfClientsLock(::Il2CppObject* value);
