// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.BaseRaycaster
#include "UnityEngine/EventSystems/BaseRaycaster.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.RaycastHit2D
#include "UnityEngine/RaycastHit2D.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: TrackedDeviceEventData
  class TrackedDeviceEventData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Ray
  struct Ray;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Graphic
  class Graphic;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: TrackedDeviceGraphicRaycaster
  class TrackedDeviceGraphicRaycaster;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster*, "UnityEngine.XR.Interaction.Toolkit.UI", "TrackedDeviceGraphicRaycaster");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster
  // [TokenAttribute] Offset: FFFFFFFF
  class TrackedDeviceGraphicRaycaster : public ::UnityEngine::EventSystems::BaseRaycaster {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitData
    struct RaycastHitData;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitComparer
    class RaycastHitComparer;
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster/UnityEngine.XR.Interaction.Toolkit.UI.RaycastHitData
    // [TokenAttribute] Offset: FFFFFFFF
    struct RaycastHitData/*, public ::System::ValueType*/ {
      public:
      public:
      // private UnityEngine.UI.Graphic <graphic>k__BackingField
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UI::Graphic* graphic;
      // Field size check
      static_assert(sizeof(::UnityEngine::UI::Graphic*) == 0x8);
      // private UnityEngine.Vector3 <worldHitPosition>k__BackingField
      // Size: 0xC
      // Offset: 0x8
      ::UnityEngine::Vector3 worldHitPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Vector2 <screenPosition>k__BackingField
      // Size: 0x8
      // Offset: 0x14
      ::UnityEngine::Vector2 screenPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // private System.Single <distance>k__BackingField
      // Size: 0x4
      // Offset: 0x1C
      float distance;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: RaycastHitData
      constexpr RaycastHitData(::UnityEngine::UI::Graphic* graphic_ = {}, ::UnityEngine::Vector3 worldHitPosition_ = {}, ::UnityEngine::Vector2 screenPosition_ = {}, float distance_ = {}) noexcept : graphic{graphic_}, worldHitPosition{worldHitPosition_}, screenPosition{screenPosition_}, distance{distance_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private UnityEngine.UI.Graphic <graphic>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Graphic*& dyn_$graphic$k__BackingField();
      // Get instance field reference: private UnityEngine.Vector3 <worldHitPosition>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_$worldHitPosition$k__BackingField();
      // Get instance field reference: private UnityEngine.Vector2 <screenPosition>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_$screenPosition$k__BackingField();
      // Get instance field reference: private System.Single <distance>k__BackingField
      [[deprecated("Use field access instead!")]] float& dyn_$distance$k__BackingField();
      // public UnityEngine.UI.Graphic get_graphic()
      // Offset: 0x2BAE20
      ::UnityEngine::UI::Graphic* get_graphic();
      // public System.Void set_graphic(UnityEngine.UI.Graphic value)
      // Offset: 0x2F6BE0
      void set_graphic(::UnityEngine::UI::Graphic* value);
      // public UnityEngine.Vector3 get_worldHitPosition()
      // Offset: 0x2F8650
      ::UnityEngine::Vector3 get_worldHitPosition();
      // public System.Void set_worldHitPosition(UnityEngine.Vector3 value)
      // Offset: 0x2F8690
      void set_worldHitPosition(::UnityEngine::Vector3 value);
      // public UnityEngine.Vector2 get_screenPosition()
      // Offset: 0x2F8630
      ::UnityEngine::Vector2 get_screenPosition();
      // public System.Void set_screenPosition(UnityEngine.Vector2 value)
      // Offset: 0x2F8680
      void set_screenPosition(::UnityEngine::Vector2 value);
      // public System.Single get_distance()
      // Offset: 0x2F8620
      float get_distance();
      // public System.Void set_distance(System.Single value)
      // Offset: 0x2F8670
      void set_distance(float value);
      // public System.Void .ctor(UnityEngine.UI.Graphic graphic, UnityEngine.Vector3 worldHitPosition, UnityEngine.Vector2 screenPosition, System.Single distance)
      // Offset: 0x2F85C0
      // ABORTED: conflicts with another method.  RaycastHitData(::UnityEngine::UI::Graphic* graphic, ::UnityEngine::Vector3 worldHitPosition, ::UnityEngine::Vector2 screenPosition, float distance);
    }; // UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster/UnityEngine.XR.Interaction.Toolkit.UI.RaycastHitData
    #pragma pack(pop)
    static check_size<sizeof(TrackedDeviceGraphicRaycaster::RaycastHitData), 28 + sizeof(float)> __UnityEngine_XR_Interaction_Toolkit_UI_TrackedDeviceGraphicRaycaster_RaycastHitDataSizeCheck;
    static_assert(sizeof(TrackedDeviceGraphicRaycaster::RaycastHitData) == 0x20);
    public:
    // private System.Boolean m_IgnoreReversedGraphics
    // Size: 0x1
    // Offset: 0x20
    bool m_IgnoreReversedGraphics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CheckFor2DOcclusion
    // Size: 0x1
    // Offset: 0x21
    bool m_CheckFor2DOcclusion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CheckFor3DOcclusion
    // Size: 0x1
    // Offset: 0x22
    bool m_CheckFor3DOcclusion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CheckFor3DOcclusion and: m_BlockingMask
    char __padding2[0x1] = {};
    // private UnityEngine.LayerMask m_BlockingMask
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::LayerMask m_BlockingMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.Canvas m_Canvas
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Canvas* m_Canvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private UnityEngine.RaycastHit[] occlusionHits3D
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::RaycastHit> occlusionHits3D;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.RaycastHit2D[] occlusionHits2D
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::RaycastHit2D> occlusionHits2D;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit2D>) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster/UnityEngine.XR.Interaction.Toolkit.UI.RaycastHitComparer m_raycastHitComparer
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitComparer* m_raycastHitComparer;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitComparer*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster/UnityEngine.XR.Interaction.Toolkit.UI.RaycastHitData> m_RaycastResultsCache
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitData>* m_RaycastResultsCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitData>*) == 0x8);
    // private UnityEngine.RaycastHit[] physicsHits
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::RaycastHit> physicsHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.RaycastHit2D[] graphicHits
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::RaycastHit2D> graphicHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit2D>) == 0x8);
    public:
    // Get static field: static private readonly System.Int32 k_MaxRaycastHits
    static int _get_k_MaxRaycastHits();
    // Set static field: static private readonly System.Int32 k_MaxRaycastHits
    static void _set_k_MaxRaycastHits(int value);
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster/UnityEngine.XR.Interaction.Toolkit.UI.RaycastHitData> s_SortedGraphics
    static ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitData>* _get_s_SortedGraphics();
