// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.UIInputModule
#include "UnityEngine/XR/Interaction/Toolkit/UI/UIInputModule.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.MouseModel
#include "UnityEngine/XR/Interaction/Toolkit/UI/MouseModel.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel
#include "UnityEngine/XR/Interaction/Toolkit/UI/TrackedDeviceModel.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.TouchModel
#include "UnityEngine/XR/Interaction/Toolkit/UI/TouchModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: IUIInteractable
  class IUIInteractable;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Touch
  struct Touch;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: UIBehaviour because it is already included!
  // Skipping declaration: BaseInputModule because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: XRUIInputModule
  class XRUIInputModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*, "UnityEngine.XR.Interaction.Toolkit.UI", "XRUIInputModule");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x240
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule
  // [TokenAttribute] Offset: FFFFFFFF
  class XRUIInputModule : public ::UnityEngine::XR::Interaction::Toolkit::UI::UIInputModule {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractable
    struct RegisteredInteractable;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredTouch
    struct RegisteredTouch;
    // Size: 0x118
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/UnityEngine.XR.Interaction.Toolkit.UI.RegisteredInteractable
    // [TokenAttribute] Offset: FFFFFFFF
    struct RegisteredInteractable/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractable interactable
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable* interactable;
      // Field size check
      static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable*) == 0x8);
      // public UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel model
      // Size: 0x110
      // Offset: 0x8
      ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel model;
      // Field size check
      static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel) == 0x110);
      public:
      // Creating value type constructor for type: RegisteredInteractable
      constexpr RegisteredInteractable(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable* interactable_ = {}, ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel model_ = {}) noexcept : interactable{interactable_}, model{model_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractable interactable
      [[deprecated]] ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable*& dyn_interactable();
      // Get instance field reference: public UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel model
      [[deprecated]] ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel& dyn_model();
      // public System.Void .ctor(UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractable interactable, System.Int32 deviceIndex)
      // Offset: 0x2F86A0
      RegisteredInteractable(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable* interactable, int deviceIndex);
    }; // UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/UnityEngine.XR.Interaction.Toolkit.UI.RegisteredInteractable
    #pragma pack(pop)
    static check_size<sizeof(XRUIInputModule::RegisteredInteractable), 8 + sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel)> __UnityEngine_XR_Interaction_Toolkit_UI_XRUIInputModule_RegisteredInteractableSizeCheck;
    static_assert(sizeof(XRUIInputModule::RegisteredInteractable) == 0x118);
    // Size: 0xA8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/UnityEngine.XR.Interaction.Toolkit.UI.RegisteredTouch
    // [TokenAttribute] Offset: FFFFFFFF
    struct RegisteredTouch/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean isValid
      // Size: 0x1
      // Offset: 0x0
      bool isValid;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isValid and: touchId
      char __padding0[0x3] = {};
      // public System.Int32 touchId
      // Size: 0x4
      // Offset: 0x4
      int touchId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public UnityEngine.XR.Interaction.Toolkit.UI.TouchModel model
      // Size: 0xA0
      // Offset: 0x8
      ::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel model;
      // Field size check
      static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel) == 0xA0);
      public:
      // Creating value type constructor for type: RegisteredTouch
      constexpr RegisteredTouch(bool isValid_ = {}, int touchId_ = {}, ::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel model_ = {}) noexcept : isValid{isValid_}, touchId{touchId_}, model{model_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean isValid
      [[deprecated]] bool& dyn_isValid();
      // Get instance field reference: public System.Int32 touchId
      [[deprecated]] int& dyn_touchId();
      // Get instance field reference: public UnityEngine.XR.Interaction.Toolkit.UI.TouchModel model
      [[deprecated]] ::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel& dyn_model();
      // public System.Void .ctor(UnityEngine.Touch touch, System.Int32 deviceIndex)
      // Offset: 0x2F8770
      RegisteredTouch(::UnityEngine::Touch touch, int deviceIndex);
    }; // UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/UnityEngine.XR.Interaction.Toolkit.UI.RegisteredTouch
    #pragma pack(pop)
    static check_size<sizeof(XRUIInputModule::RegisteredTouch), 8 + sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel)> __UnityEngine_XR_Interaction_Toolkit_UI_XRUIInputModule_RegisteredTouchSizeCheck;
    static_assert(sizeof(XRUIInputModule::RegisteredTouch) == 0xA8);
    public:
    // [TooltipAttribute] Offset: 0xE1300
    // private System.Single m_MaxTrackedDeviceRaycastDistance
    // Size: 0x4
    // Offset: 0x80
    float m_MaxTrackedDeviceRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xE1370
    // private System.Boolean m_EnableXRInput
    // Size: 0x1
    // Offset: 0x84
    bool m_EnableXRInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xE1400
    // private System.Boolean m_EnableMouseInput
    // Size: 0x1
    // Offset: 0x85
    bool m_EnableMouseInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xE14C0
    // private System.Boolean m_EnableTouchInput
    // Size: 0x1
    // Offset: 0x86
    bool m_EnableTouchInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_EnableTouchInput and: m_Mouse
    char __padding3[0x1] = {};
    // private UnityEngine.XR.Interaction.Toolkit.UI.MouseModel m_Mouse
    // Size: 0x1A0
    // Offset: 0x88
    ::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel m_Mouse;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel) == 0x1A0);
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/UnityEngine.XR.Interaction.Toolkit.UI.RegisteredTouch> m_RegisteredTouches
    // Size: 0x8
    // Offset: 0x228
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredTouch>* m_RegisteredTouches;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredTouch>*) == 0x8);
    // private System.Int32 m_RollingInteractableIndex
    // Size: 0x4
    // Offset: 0x230
    int m_RollingInteractableIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_RollingInteractableIndex and: m_RegisteredInteractables
    char __padding6[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/UnityEngine.XR.Interaction.Toolkit.UI.RegisteredInteractable> m_RegisteredInteractables
    // Size: 0x8
    // Offset: 0x238
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractable>* m_RegisteredInteractables;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractable>*) == 0x8);
    public:
    // static field const value: static private System.Single k_DefaultMaxTrackedDeviceRaycastDistance
    static constexpr const float k_DefaultMaxTrackedDeviceRaycastDistance = 1000;
    // Get static field: static private System.Single k_DefaultMaxTrackedDeviceRaycastDistance
    static float _get_k_DefaultMaxTrackedDeviceRaycastDistance();
    // Set static field: static private System.Single k_DefaultMaxTrackedDeviceRaycastDistance
    static void _set_k_DefaultMaxTrackedDeviceRaycastDistance(float value);
    // Get instance field reference: private System.Single m_MaxTrackedDeviceRaycastDistance
    [[deprecated]] float& dyn_m_MaxTrackedDeviceRaycastDistance();
    // Get instance field reference: private System.Boolean m_EnableXRInput
    [[deprecated]] bool& dyn_m_EnableXRInput();
    // Get instance field reference: private System.Boolean m_EnableMouseInput
    [[deprecated]] bool& dyn_m_EnableMouseInput();
    // Get instance field reference: private System.Boolean m_EnableTouchInput
    [[deprecated]] bool& dyn_m_EnableTouchInput();
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.UI.MouseModel m_Mouse
    [[deprecated]] ::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel& dyn_m_Mouse();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/UnityEngine.XR.Interaction.Toolkit.UI.RegisteredTouch> m_RegisteredTouches
    [[deprecated]] ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredTouch>*& dyn_m_RegisteredTouches();
    // Get instance field reference: private System.Int32 m_RollingInteractableIndex
    [[deprecated]] int& dyn_m_RollingInteractableIndex();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/UnityEngine.XR.Interaction.Toolkit.UI.RegisteredInteractable> m_RegisteredInteractables
    [[deprecated]] ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractable>*& dyn_m_RegisteredInteractables();
    // public System.Single get_maxRaycastDistance()
    // Offset: 0x309680
    float get_maxRaycastDistance();
    // public System.Void set_maxRaycastDistance(System.Single value)
    // Offset: 0x309690
    void set_maxRaycastDistance(float value);
    // private System.Void EnsureInitialized()
    // Offset: 0x307FC0
    void EnsureInitialized();
    // public System.Void RegisterInteractable(UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractable interactable)
    // Offset: 0x309160
    void RegisterInteractable(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable* interactable);
    // public System.Void UnregisterInteractable(UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractable interactable)
    // Offset: 0x309390
    void UnregisterInteractable(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable* interactable);
    // public System.Boolean GetTrackedDeviceModel(UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractable interactable, out UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel model)
    // Offset: 0x308080
    bool GetTrackedDeviceModel(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable* interactable, ByRef<::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel> model);
    // private System.Void ProcessMouse()
    // Offset: 0x308470
    void ProcessMouse();
    // private System.Void ProcessTouches()
    // Offset: 0x308620
    void ProcessTouches();
    // public System.Void .ctor()
    // Offset: 0x309630
    // Implemented from: UnityEngine.XR.Interaction.Toolkit.UI.UIInputModule
    // Base method: System.Void UIInputModule::.ctor()
    // Base method: System.Void BaseInputModule::.ctor()
    // Base method: System.Void UIBehaviour::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static XRUIInputModule* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<XRUIInputModule*, creationType>()));
    }
    // protected override System.Void Awake()
    // Offset: 0x307CF0
    // Implemented from: UnityEngine.EventSystems.UIBehaviour
    // Base method: System.Void UIBehaviour::Awake()
    void Awake();
    // protected override System.Void OnEnable()
    // Offset: 0x308390
    // Implemented from: UnityEngine.EventSystems.BaseInputModule
    // Base method: System.Void BaseInputModule::OnEnable()
    void OnEnable();
    // protected override System.Void DoProcess()
    // Offset: 0x307D10
    // Implemented from: UnityEngine.XR.Interaction.Toolkit.UI.UIInputModule
    // Base method: System.Void UIInputModule::DoProcess()
    void DoProcess();
  }; // UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule
  #pragma pack(pop)
  static check_size<sizeof(XRUIInputModule), 568 + sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractable>*)> __UnityEngine_XR_Interaction_Toolkit_UI_XRUIInputModuleSizeCheck;
  static_assert(sizeof(XRUIInputModule) == 0x240);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredTouch, "UnityEngine.XR.Interaction.Toolkit.UI", "XRUIInputModule/RegisteredTouch");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractable, "UnityEngine.XR.Interaction.Toolkit.UI", "XRUIInputModule/RegisteredInteractable");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::get_maxRaycastDistance
// Il2CppName: get_maxRaycastDistance
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)()>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::get_maxRaycastDistance)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "get_maxRaycastDistance", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::set_maxRaycastDistance
// Il2CppName: set_maxRaycastDistance
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)(float)>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::set_maxRaycastDistance)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "set_maxRaycastDistance", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::EnsureInitialized
// Il2CppName: EnsureInitialized
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)()>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::EnsureInitialized)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "EnsureInitialized", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisterInteractable
// Il2CppName: RegisterInteractable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable*)>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisterInteractable)> {
  static const MethodInfo* get() {
    static auto* interactable = &::il2cpp_utils::GetClassFromName("UnityEngine.XR.Interaction.Toolkit.UI", "IUIInteractable")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "RegisterInteractable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{interactable});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::UnregisterInteractable
// Il2CppName: UnregisterInteractable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable*)>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::UnregisterInteractable)> {
  static const MethodInfo* get() {
    static auto* interactable = &::il2cpp_utils::GetClassFromName("UnityEngine.XR.Interaction.Toolkit.UI", "IUIInteractable")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "UnregisterInteractable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{interactable});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::GetTrackedDeviceModel
// Il2CppName: GetTrackedDeviceModel
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractable*, ByRef<::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel>)>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::GetTrackedDeviceModel)> {
  static const MethodInfo* get() {
    static auto* interactable = &::il2cpp_utils::GetClassFromName("UnityEngine.XR.Interaction.Toolkit.UI", "IUIInteractable")->byval_arg;
    static auto* model = &::il2cpp_utils::GetClassFromName("UnityEngine.XR.Interaction.Toolkit.UI", "TrackedDeviceModel")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "GetTrackedDeviceModel", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{interactable, model});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ProcessMouse
// Il2CppName: ProcessMouse
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)()>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ProcessMouse)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "ProcessMouse", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ProcessTouches
// Il2CppName: ProcessTouches
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)()>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ProcessTouches)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "ProcessTouches", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)()>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)()>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::DoProcess
// Il2CppName: DoProcess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::*)()>(&UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::DoProcess)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*), "DoProcess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
