// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Forward declaring type: ColorPicker
  class ColorPicker;
  // Forward declaring type: ColorPreset
  class ColorPreset;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Forward declaring type: ColorSwatch
  class ColorSwatch;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::AdvancedColorPicker::ColorSwatch);
DEFINE_IL2CPP_ARG_TYPE(::AdvancedColorPicker::ColorSwatch*, "AdvancedColorPicker", "ColorSwatch");
// Type namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: AdvancedColorPicker.ColorSwatch
  // [TokenAttribute] Offset: FFFFFFFF
  class ColorSwatch : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::AdvancedColorPicker::ColorSwatch::PresetChangedEvent
    class PresetChangedEvent;
    // Nested type: ::AdvancedColorPicker::ColorSwatch::$$c__DisplayClass37_0
    class $$c__DisplayClass37_0;
    // Nested type: ::AdvancedColorPicker::ColorSwatch::$$c
    class $$c;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private AdvancedColorPicker.ColorPicker _picker
    // Size: 0x8
    // Offset: 0x18
    ::AdvancedColorPicker::ColorPicker* picker;
    // Field size check
    static_assert(sizeof(::AdvancedColorPicker::ColorPicker*) == 0x8);
    // private AdvancedColorPicker.ColorPreset _presetPrefab
    // Size: 0x8
    // Offset: 0x20
    ::AdvancedColorPicker::ColorPreset* presetPrefab;
    // Field size check
    static_assert(sizeof(::AdvancedColorPicker::ColorPreset*) == 0x8);
    // private UnityEngine.RectTransform _viewport
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::RectTransform* viewport;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // [TooltipAttribute] Offset: 0x71D964
    // private System.String _swatchName
    // Size: 0x8
    // Offset: 0x30
    ::StringW swatchName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _autoSave
    // Size: 0x1
    // Offset: 0x38
    bool autoSave;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoSave and: presetAdded
    char __padding4[0x7] = {};
    // private AdvancedColorPicker.ColorSwatch/AdvancedColorPicker.PresetChangedEvent _presetAdded
    // Size: 0x8
    // Offset: 0x40
    ::AdvancedColorPicker::ColorSwatch::PresetChangedEvent* presetAdded;
    // Field size check
    static_assert(sizeof(::AdvancedColorPicker::ColorSwatch::PresetChangedEvent*) == 0x8);
    // private AdvancedColorPicker.ColorSwatch/AdvancedColorPicker.PresetChangedEvent _presetRemoved
    // Size: 0x8
    // Offset: 0x48
    ::AdvancedColorPicker::ColorSwatch::PresetChangedEvent* presetRemoved;
    // Field size check
    static_assert(sizeof(::AdvancedColorPicker::ColorSwatch::PresetChangedEvent*) == 0x8);
    // private AdvancedColorPicker.ColorSwatch/AdvancedColorPicker.PresetChangedEvent _presetEdited
    // Size: 0x8
    // Offset: 0x50
    ::AdvancedColorPicker::ColorSwatch::PresetChangedEvent* presetEdited;
    // Field size check
    static_assert(sizeof(::AdvancedColorPicker::ColorSwatch::PresetChangedEvent*) == 0x8);
    // private System.Collections.Generic.List`1<AdvancedColorPicker.ColorPreset> _colorSwatches
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::AdvancedColorPicker::ColorPreset*>* colorSwatches;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::AdvancedColorPicker::ColorPreset*>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private AdvancedColorPicker.ColorPicker _picker
    ::AdvancedColorPicker::ColorPicker*& dyn__picker();
    // Get instance field reference: private AdvancedColorPicker.ColorPreset _presetPrefab
    ::AdvancedColorPicker::ColorPreset*& dyn__presetPrefab();
    // Get instance field reference: private UnityEngine.RectTransform _viewport
    ::UnityEngine::RectTransform*& dyn__viewport();
    // Get instance field reference: private System.String _swatchName
    ::StringW& dyn__swatchName();
    // Get instance field reference: private System.Boolean _autoSave
