// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UI.MaskableGraphic
#include "UnityEngine/UI/MaskableGraphic.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Coroutine
  class Coroutine;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Rect
  struct Rect;
}
// Forward declaring namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Skipping declaration: EyedropperPreviewType because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: VertexHelper
  class VertexHelper;
}
// Completed forward declares
// Type namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Forward declaring type: ColorEyedropperPreview
  class ColorEyedropperPreview;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::AdvancedColorPicker::ColorEyedropperPreview);
DEFINE_IL2CPP_ARG_TYPE(::AdvancedColorPicker::ColorEyedropperPreview*, "AdvancedColorPicker", "ColorEyedropperPreview");
// Type namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: AdvancedColorPicker.ColorEyedropperPreview
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 71D1EC
  class ColorEyedropperPreview : public ::UnityEngine::UI::MaskableGraphic {
    public:
    // Nested type: ::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType
    struct EyedropperPreviewType;
    // Nested type: ::AdvancedColorPicker::ColorEyedropperPreview::$ReadScreenColor$d__40
    class $ReadScreenColor$d__40;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType
    // [TokenAttribute] Offset: FFFFFFFF
    struct EyedropperPreviewType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: EyedropperPreviewType
      constexpr EyedropperPreviewType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelSize
      static constexpr const int PixelSize = 0;
      // Get static field: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelSize
      static ::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType _get_PixelSize();
      // Set static field: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelSize
      static void _set_PixelSize(::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType value);
      // static field const value: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelAmountHorizontal
      static constexpr const int PixelAmountHorizontal = 1;
      // Get static field: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelAmountHorizontal
      static ::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType _get_PixelAmountHorizontal();
      // Set static field: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelAmountHorizontal
      static void _set_PixelAmountHorizontal(::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType value);
      // static field const value: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelAmountVertical
      static constexpr const int PixelAmountVertical = 2;
      // Get static field: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelAmountVertical
      static ::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType _get_PixelAmountVertical();
      // Set static field: static public AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType PixelAmountVertical
      static void _set_PixelAmountVertical(::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType
    #pragma pack(pop)
    static check_size<sizeof(ColorEyedropperPreview::EyedropperPreviewType), 0 + sizeof(int)> __AdvancedColorPicker_ColorEyedropperPreview_EyedropperPreviewTypeSizeCheck;
    static_assert(sizeof(ColorEyedropperPreview::EyedropperPreviewType) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType type
    // Size: 0x4
    // Offset: 0xC0
    ::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType type;
    // Field size check
    static_assert(sizeof(::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType) == 0x4);
    // private System.Single pixelSize
    // Size: 0x4
    // Offset: 0xC4
    float pixelSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single borderSize
    // Size: 0x4
    // Offset: 0xC8
    float borderSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single horizontalPixels
    // Size: 0x4
    // Offset: 0xCC
    float horizontalPixels;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single verticalPixels
    // Size: 0x4
    // Offset: 0xD0
    float verticalPixels;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color32 selectionBoxColor
    // Size: 0x4
    // Offset: 0xD4
    ::UnityEngine::Color32 selectionBoxColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private System.Boolean activated
    // Size: 0x1
    // Offset: 0xD8
    bool activated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: activated and: coroutine
    char __padding6[0x7] = {};
    // private UnityEngine.Coroutine coroutine
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Coroutine* coroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Color32[] pixelsToDisplay
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<::UnityEngine::Color32> pixelsToDisplay;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color32>) == 0x8);
    public:
    // Get instance field reference: private AdvancedColorPicker.ColorEyedropperPreview/AdvancedColorPicker.EyedropperPreviewType type
    ::AdvancedColorPicker::ColorEyedropperPreview::EyedropperPreviewType& dyn_type();
    // Get instance field reference: private System.Single pixelSize
    float& dyn_pixelSize();
    // Get instance field reference: private System.Single borderSize
    float& dyn_borderSize();
    // Get instance field reference: private System.Single horizontalPixels
    float& dyn_horizontalPixels();
    // Get instance field reference: private System.Single verticalPixels
    float& dyn_verticalPixels();
    // Get instance field reference: private UnityEngine.Color32 selectionBoxColor
    ::UnityEngine::Color32& dyn_selectionBoxColor();
