// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: AdvancedColorPicker.GraphicalColorComponent
#include "AdvancedColorPicker/GraphicalColorComponent.hpp"
// Including type: UnityEngine.UI.Slider/UnityEngine.UI.Direction
#include "UnityEngine/UI/Slider.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Skipping declaration: GradientCenterType because it is already included!
  // Forward declaring type: ColorType
  struct ColorType;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: VertexHelper
  class VertexHelper;
}
// Completed forward declares
// Type namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Forward declaring type: GradientBackground
  class GradientBackground;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::AdvancedColorPicker::GradientBackground);
DEFINE_IL2CPP_ARG_TYPE(::AdvancedColorPicker::GradientBackground*, "AdvancedColorPicker", "GradientBackground");
// Type namespace: AdvancedColorPicker
namespace AdvancedColorPicker {
  // Size: 0xF8
  #pragma pack(push, 1)
  // Autogenerated type: AdvancedColorPicker.GradientBackground
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: E9650
  // [RequireComponent] Offset: E9650
  class GradientBackground : public ::AdvancedColorPicker::GraphicalColorComponent {
    public:
    // Nested type: ::AdvancedColorPicker::GradientBackground::GradientPartType
    struct GradientPartType;
    // Nested type: ::AdvancedColorPicker::GradientBackground::GradientCenterType
    struct GradientCenterType;
    // Nested type: ::AdvancedColorPicker::GradientBackground::GradientPart
    class GradientPart;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType
    // [TokenAttribute] Offset: FFFFFFFF
    struct GradientCenterType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GradientCenterType
      constexpr GradientCenterType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType Custom
      static constexpr const int Custom = 0;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType Custom
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_Custom();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType Custom
      static void _set_Custom(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType Alpha
      static constexpr const int Alpha = 1;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType Alpha
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_Alpha();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType Alpha
      static void _set_Alpha(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_R
      static constexpr const int RGB_R = 2;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_R
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_RGB_R();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_R
      static void _set_RGB_R(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_G
      static constexpr const int RGB_G = 3;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_G
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_RGB_G();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_G
      static void _set_RGB_G(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_B
      static constexpr const int RGB_B = 4;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_B
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_RGB_B();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType RGB_B
      static void _set_RGB_B(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_H
      static constexpr const int HSV_H = 5;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_H
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_HSV_H();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_H
      static void _set_HSV_H(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_S
      static constexpr const int HSV_S = 6;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_S
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_HSV_S();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_S
      static void _set_HSV_S(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_V
      static constexpr const int HSV_V = 7;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_V
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_HSV_V();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSV_V
      static void _set_HSV_V(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_H
      static constexpr const int HSL_H = 8;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_H
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_HSL_H();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_H
      static void _set_HSL_H(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_S
      static constexpr const int HSL_S = 9;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_S
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_HSL_S();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_S
      static void _set_HSL_S(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // static field const value: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_L
      static constexpr const int HSL_L = 10;
      // Get static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_L
      static ::AdvancedColorPicker::GradientBackground::GradientCenterType _get_HSL_L();
      // Set static field: static public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType HSL_L
      static void _set_HSL_L(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType
    #pragma pack(pop)
    static check_size<sizeof(GradientBackground::GradientCenterType), 0 + sizeof(int)> __AdvancedColorPicker_GradientBackground_GradientCenterTypeSizeCheck;
    static_assert(sizeof(GradientBackground::GradientCenterType) == 0x4);
    public:
    // private System.Boolean acceptEvents
    // Size: 0x1
    // Offset: 0xD0
    bool acceptEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: acceptEvents and: colors
    char __padding0[0x7] = {};
    // private AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientPart[] colors
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::AdvancedColorPicker::GradientBackground::GradientPart*> colors;
    // Field size check
    static_assert(sizeof(::ArrayW<::AdvancedColorPicker::GradientBackground::GradientPart*>) == 0x8);
    // private System.Boolean displayCheckboard
    // Size: 0x1
    // Offset: 0xE0
    bool displayCheckboard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean gradient
    // Size: 0x1
    // Offset: 0xE1
    bool gradient;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: gradient and: direction
    char __padding3[0x2] = {};
    // private UnityEngine.UI.Slider/UnityEngine.UI.Direction direction
    // Size: 0x4
    // Offset: 0xE4
    ::UnityEngine::UI::Slider::Direction direction;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider::Direction) == 0x4);
    // [RangeAttribute] Offset: 0xBDE10
    // private System.Single centerPos
    // Size: 0x4
    // Offset: 0xE8
    float centerPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType centerType
    // Size: 0x4
    // Offset: 0xEC
    ::AdvancedColorPicker::GradientBackground::GradientCenterType centerType;
    // Field size check
    static_assert(sizeof(::AdvancedColorPicker::GradientBackground::GradientCenterType) == 0x4);
    // private System.Single checkBoardSize
    // Size: 0x4
    // Offset: 0xF0
    float checkBoardSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single borderSize
    // Size: 0x4
    // Offset: 0xF4
    float borderSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private System.Boolean acceptEvents
    [[deprecated("Use field access instead!")]] bool& dyn_acceptEvents();
    // Get instance field reference: private AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientPart[] colors
    [[deprecated("Use field access instead!")]] ::ArrayW<::AdvancedColorPicker::GradientBackground::GradientPart*>& dyn_colors();
    // Get instance field reference: private System.Boolean displayCheckboard
    [[deprecated("Use field access instead!")]] bool& dyn_displayCheckboard();
    // Get instance field reference: private System.Boolean gradient
    [[deprecated("Use field access instead!")]] bool& dyn_gradient();
    // Get instance field reference: private UnityEngine.UI.Slider/UnityEngine.UI.Direction direction
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Slider::Direction& dyn_direction();
    // Get instance field reference: private System.Single centerPos
    [[deprecated("Use field access instead!")]] float& dyn_centerPos();
    // Get instance field reference: private AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType centerType
    [[deprecated("Use field access instead!")]] ::AdvancedColorPicker::GradientBackground::GradientCenterType& dyn_centerType();
    // Get instance field reference: private System.Single checkBoardSize
    [[deprecated("Use field access instead!")]] float& dyn_checkBoardSize();
    // Get instance field reference: private System.Single borderSize
    [[deprecated("Use field access instead!")]] float& dyn_borderSize();
    // public System.Boolean get_DisplayCheckboard()
    // Offset: 0x202F70
    bool get_DisplayCheckboard();
    // public System.Void set_DisplayCheckboard(System.Boolean value)
    // Offset: 0x5B47F0
    void set_DisplayCheckboard(bool value);
    // public System.Single get_CheckboardSize()
    // Offset: 0x4BFA20
    float get_CheckboardSize();
    // public System.Void set_CheckboardSize(System.Single value)
    // Offset: 0x5B4560
    void set_CheckboardSize(float value);
    // public System.Boolean get_Gradient()
    // Offset: 0x3C8070
    bool get_Gradient();
    // public System.Void set_Gradient(System.Boolean value)
    // Offset: 0x5B4810
    void set_Gradient(bool value);
    // public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType get_CenterType()
    // Offset: 0x4BFB80
    ::AdvancedColorPicker::GradientBackground::GradientCenterType get_CenterType();
    // public System.Void set_CenterType(AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientCenterType value)
    // Offset: 0x5B4540
    void set_CenterType(::AdvancedColorPicker::GradientBackground::GradientCenterType value);
    // public System.Single get_CenterPosition()
    // Offset: 0x5B42A0
    float get_CenterPosition();
    // public System.Void set_CenterPosition(System.Single value)
    // Offset: 0x5B44A0
    void set_CenterPosition(float value);
    // public System.Single get_BorderSize()
    // Offset: 0x5B4290
    float get_BorderSize();
    // public System.Void set_BorderSize(System.Single value)
    // Offset: 0x5B4410
    void set_BorderSize(float value);
    // public UnityEngine.UI.Slider/UnityEngine.UI.Direction get_Direction()
    // Offset: 0x31C790
    ::UnityEngine::UI::Slider::Direction get_Direction();
    // public System.Void set_Direction(UnityEngine.UI.Slider/UnityEngine.UI.Direction value)
    // Offset: 0x5B47D0
    void set_Direction(::UnityEngine::UI::Slider::Direction value);
    // public System.Int32 get_Count()
    // Offset: 0x5B42B0
    int get_Count();
    // public System.Void set_Count(System.Int32 value)
    // Offset: 0x5B4590
    void set_Count(int value);
    // public AdvancedColorPicker.GradientBackground/AdvancedColorPicker.GradientPart get_Item(System.Int32 index)
    // Offset: 0x5B42D0
    ::AdvancedColorPicker::GradientBackground::GradientPart* get_Item(int index);
    // public System.Void SetToDefaultType(AdvancedColorPicker.ColorType type)
    // Offset: 0x5B31A0
    void SetToDefaultType(::AdvancedColorPicker::ColorType type);
    // public override UnityEngine.Texture get_mainTexture()
    // Offset: 0x5B43C0
    // Implemented from: UnityEngine.UI.Graphic
    // Base method: UnityEngine.Texture Graphic::get_mainTexture()
    ::UnityEngine::Texture* get_mainTexture();
    // public System.Void .ctor()
    // Offset: 0x5B40F0
    // Implemented from: AdvancedColorPicker.GraphicalColorComponent
    // Base method: System.Void GraphicalColorComponent::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GradientBackground* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::AdvancedColorPicker::GradientBackground::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GradientBackground*, creationType>()));
    }
    // protected override System.Void DisplayNewColor()
    // Offset: 0x5B0010
    // Implemented from: AdvancedColorPicker.GraphicalColorComponent
    // Base method: System.Void GraphicalColorComponent::DisplayNewColor()
    void DisplayNewColor();
    // public override System.Void SetNativeSize()
    // Offset: 0x5B2F50
    // Implemented from: UnityEngine.UI.Graphic
    // Base method: System.Void Graphic::SetNativeSize()
    void SetNativeSize();
    // protected override System.Void OnPopulateMesh(UnityEngine.UI.VertexHelper vh)
    // Offset: 0x5B1840
    // Implemented from: UnityEngine.UI.Graphic
    // Base method: System.Void Graphic::OnPopulateMesh(UnityEngine.UI.VertexHelper vh)
    void OnPopulateMesh(::UnityEngine::UI::VertexHelper* vh);
  }; // AdvancedColorPicker.GradientBackground
  #pragma pack(pop)
  static check_size<sizeof(GradientBackground), 244 + sizeof(float)> __AdvancedColorPicker_GradientBackgroundSizeCheck;
  static_assert(sizeof(GradientBackground) == 0xF8);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::AdvancedColorPicker::GradientBackground::GradientCenterType, "AdvancedColorPicker", "GradientBackground/GradientCenterType");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: AdvancedColorPicker::GradientBackground::get_DisplayCheckboard
// Il2CppName: get_DisplayCheckboard
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (AdvancedColorPicker::GradientBackground::*)()>(&AdvancedColorPicker::GradientBackground::get_DisplayCheckboard)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(AdvancedColorPicker::GradientBackground*), "get_DisplayCheckboard", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: AdvancedColorPicker::GradientBackground::set_DisplayCheckboard
