// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Normal.Realtime.RealtimeComponent`1
#include "Normal/Realtime/RealtimeComponent_1.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AvatarNicknameModel
  class AvatarNicknameModel;
  // Forward declaring type: SetColorOnPrefabBrick
  class SetColorOnPrefabBrick;
  // Forward declaring type: SetHandColors
  class SetHandColors;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Sprite
  class Sprite;
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeAvatarVoice
  class RealtimeAvatarVoice;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AvatarNicknameSync
  class AvatarNicknameSync;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AvatarNicknameSync);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AvatarNicknameSync*, "", "AvatarNicknameSync");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: AvatarNicknameSync
  // [TokenAttribute] Offset: FFFFFFFF
  class AvatarNicknameSync : public ::Normal::Realtime::RealtimeComponent_1<::GlobalNamespace::AvatarNicknameModel*> {
    public:
    public:
    // public TMPro.TextMeshProUGUI nameText
    // Size: 0x8
    // Offset: 0x28
    ::TMPro::TextMeshProUGUI* nameText;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public UnityEngine.Transform nameTransform
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* nameTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform headTransform
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* headTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xF09C0
    // public Normal.Realtime.RealtimeAvatarVoice realtimeAvatarVoice
    // Size: 0x8
    // Offset: 0x40
    ::Normal::Realtime::RealtimeAvatarVoice* realtimeAvatarVoice;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeAvatarVoice*) == 0x8);
    // public UnityEngine.Transform avatarTransform
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* avatarTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _currentCameraTransform
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* currentCameraTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject face
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* face;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public SetColorOnPrefabBrick[] primaryHeadBricks
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::GlobalNamespace::SetColorOnPrefabBrick*> primaryHeadBricks;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::SetColorOnPrefabBrick*>) == 0x8);
    // public SetColorOnPrefabBrick[] secondaryHeadBricks
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::GlobalNamespace::SetColorOnPrefabBrick*> secondaryHeadBricks;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::SetColorOnPrefabBrick*>) == 0x8);
    // public SetHandColors[] setHandColors
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::GlobalNamespace::SetHandColors*> setHandColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::SetHandColors*>) == 0x8);
    // public UnityEngine.UI.Image eyesImage
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::UI::Image* eyesImage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image mouthImage
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UI::Image* mouthImage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single[] _lastVolumes
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<float> lastVolumes;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Int32 _nextVolumeIndex
    // Size: 0x4
    // Offset: 0x90
    int nextVolumeIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _isSelf
    // Size: 0x1
    // Offset: 0x94
    bool isSelf;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.Sprite[] volumeSprites
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::UnityEngine::Sprite*> volumeSprites;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Sprite*>) == 0x8);
    // public UnityEngine.UI.Image volumeUIImage
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UI::Image* volumeUIImage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    public:
    // static field const value: static private System.Int32 NumberOfVolumeMeasurementsToSmooth
    static constexpr const int NumberOfVolumeMeasurementsToSmooth = 25;
    // Get static field: static private System.Int32 NumberOfVolumeMeasurementsToSmooth
    static int _get_NumberOfVolumeMeasurementsToSmooth();
    // Set static field: static private System.Int32 NumberOfVolumeMeasurementsToSmooth
    static void _set_NumberOfVolumeMeasurementsToSmooth(int value);
    // Get static field: static private readonly UnityEngine.Vector3 NameTextOffset
    static ::UnityEngine::Vector3 _get_NameTextOffset();
    // Set static field: static private readonly UnityEngine.Vector3 NameTextOffset
    static void _set_NameTextOffset(::UnityEngine::Vector3 value);
    // Get instance field reference: public TMPro.TextMeshProUGUI nameText
