// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Normal.Realtime.RealtimeModel
#include "Normal/Realtime/RealtimeModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: ReliableProperty`1<T>
  template<typename T>
  class ReliableProperty_1;
}
// Forward declaring namespace: Normal::Realtime::Serialization
namespace Normal::Realtime::Serialization {
  // Skipping declaration: StreamContext because it is already included!
  // Forward declaring type: WriteStream
  class WriteStream;
  // Forward declaring type: ReadStream
  class ReadStream;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AvatarNicknameModel
  class AvatarNicknameModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AvatarNicknameModel);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AvatarNicknameModel*, "", "AvatarNicknameModel");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x110
  #pragma pack(push, 1)
  // Autogenerated type: AvatarNicknameModel
  // [TokenAttribute] Offset: FFFFFFFF
  // [RealtimeModelAttribute] Offset: D4660
  class AvatarNicknameModel : public ::Normal::Realtime::RealtimeModel {
    public:
    // Writing base type padding for base size: 0x8C to desired offset: 0x90
    char ___base_padding[0x4] = {};
    // Nested type: ::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<T>
    template<typename T>
    class PropertyChangedHandler_1;
    // Nested type: ::GlobalNamespace::AvatarNicknameModel::PropertyID
    struct PropertyID;
    public:
    // [RealtimePropertyAttribute] Offset: 0xF03F0
    // private System.String _nickname
    // Size: 0x8
    // Offset: 0x90
    ::StringW nickname;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [RealtimePropertyAttribute] Offset: 0xF0420
    // private System.String _shortId
    // Size: 0x8
    // Offset: 0x98
    ::StringW shortId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [RealtimePropertyAttribute] Offset: 0xF0480
    // private System.Int32 _primaryAvatarColor
    // Size: 0x4
    // Offset: 0xA0
    int primaryAvatarColor;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0xF04B0
    // private System.Int32 _secondaryAvatarColor
    // Size: 0x4
    // Offset: 0xA4
    int secondaryAvatarColor;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0xF04E0
    // private System.Int32 _avatarEyes
    // Size: 0x4
    // Offset: 0xA8
    int avatarEyes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0xF0510
    // private System.Int32 _avatarMouth
    // Size: 0x4
    // Offset: 0xAC
    int avatarMouth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private AvatarNicknameModel/PropertyChangedHandler`1<System.String> nicknameDidChange
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<::StringW>* nicknameDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<::StringW>*) == 0x8);
    // private AvatarNicknameModel/PropertyChangedHandler`1<System.String> shortIdDidChange
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<::StringW>* shortIdDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<::StringW>*) == 0x8);
    // private AvatarNicknameModel/PropertyChangedHandler`1<System.Int32> primaryAvatarColorDidChange
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<int>* primaryAvatarColorDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<int>*) == 0x8);
    // private AvatarNicknameModel/PropertyChangedHandler`1<System.Int32> secondaryAvatarColorDidChange
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<int>* secondaryAvatarColorDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<int>*) == 0x8);
    // private AvatarNicknameModel/PropertyChangedHandler`1<System.Int32> avatarEyesDidChange
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<int>* avatarEyesDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<int>*) == 0x8);
    // private AvatarNicknameModel/PropertyChangedHandler`1<System.Int32> avatarMouthDidChange
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<int>* avatarMouthDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarNicknameModel::PropertyChangedHandler_1<int>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.String> _nicknameProperty
    // Size: 0x8
    // Offset: 0xE0
    ::Normal::Realtime::ReliableProperty_1<::StringW>* nicknameProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<::StringW>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.String> _shortIdProperty
    // Size: 0x8
    // Offset: 0xE8
    ::Normal::Realtime::ReliableProperty_1<::StringW>* shortIdProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<::StringW>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Int32> _primaryAvatarColorProperty
    // Size: 0x8
    // Offset: 0xF0
    ::Normal::Realtime::ReliableProperty_1<int>* primaryAvatarColorProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<int>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Int32> _secondaryAvatarColorProperty
    // Size: 0x8
    // Offset: 0xF8
    ::Normal::Realtime::ReliableProperty_1<int>* secondaryAvatarColorProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<int>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Int32> _avatarEyesProperty
    // Size: 0x8
    // Offset: 0x100
    ::Normal::Realtime::ReliableProperty_1<int>* avatarEyesProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<int>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Int32> _avatarMouthProperty
    // Size: 0x8
    // Offset: 0x108
    ::Normal::Realtime::ReliableProperty_1<int>* avatarMouthProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<int>*) == 0x8);
    public:
    // Get instance field reference: private System.String _nickname
    [[deprecated]] ::StringW& dyn__nickname();
    // Get instance field reference: private System.String _shortId
    [[deprecated]] ::StringW& dyn__shortId();
    // Get instance field reference: private System.Int32 _primaryAvatarColor
    [[deprecated]] int& dyn__primaryAvatarColor();
    // Get instance field reference: private System.Int32 _secondaryAvatarColor
    [[deprecated]] int& dyn__secondaryAvatarColor();
    // Get instance field reference: private System.Int32 _avatarEyes
    [[deprecated]] int& dyn__avatarEyes();
    // Get instance field reference: private System.Int32 _avatarMouth
    [[deprecated]] int& dyn__avatarMouth();
