// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.ValueTuple`4
#include "System/ValueTuple_4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: RoomOwnershipSync
  class RoomOwnershipSync;
  // Forward declaring type: HapticsManager
  class HapticsManager;
  // Forward declaring type: OwnedPhysicsBricksStore
  class OwnedPhysicsBricksStore;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: BoxCollider
  class BoxCollider;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRGrabInteractable
  class XRGrabInteractable;
  // Forward declaring type: XRBaseInteractor
  class XRBaseInteractor;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BrickAttachDetector
  class BrickAttachDetector;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BrickAttachDetector);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BrickAttachDetector*, "", "BrickAttachDetector");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: BrickAttachDetector
  // [TokenAttribute] Offset: FFFFFFFF
  class BrickAttachDetector : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::BrickAttachDetector::$$c__DisplayClass26_0
    class $$c__DisplayClass26_0;
    // Nested type: ::GlobalNamespace::BrickAttachDetector::$$c
    class $$c;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [FormerlySerializedAsAttribute] Offset: 0x729DB8
    // public System.Boolean isBeingHeld
    // Size: 0x1
    // Offset: 0x18
    bool isBeingHeld;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [FormerlySerializedAsAttribute] Offset: 0x729DF0
    // public System.Boolean isAttached
    // Size: 0x1
    // Offset: 0x19
    bool isAttached;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.GameObject maleConnectorParent
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* maleConnectorParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject femaleConnectorParent
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* femaleConnectorParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private RoomOwnershipSync _roomOwnershipSync
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::RoomOwnershipSync* roomOwnershipSync;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RoomOwnershipSync*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> _maleConnectors
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* maleConnectors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> _femaleConnectors
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* femaleConnectors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public UnityEngine.GameObject model
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* model;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 _collisionExtents
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 collisionExtents;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _colliderOffset
    // Size: 0xC
    // Offset: 0x5C
    ::UnityEngine::Vector3 colliderOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Transform _transform
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* transform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private HapticsManager _hapticsManager
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::HapticsManager* hapticsManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HapticsManager*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable _xrGrabInteractable
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable* xrGrabInteractable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable*) == 0x8);
    // private OwnedPhysicsBricksStore _ownedPhysicsBricksStore
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::OwnedPhysicsBricksStore* ownedPhysicsBricksStore;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OwnedPhysicsBricksStore*) == 0x8);
    // public System.Boolean skipGrabCallbacks
    // Size: 0x1
    // Offset: 0x88
    bool skipGrabCallbacks;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean tile
    // Size: 0x1
    // Offset: 0x89
    bool tile;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean window
    // Size: 0x1
    // Offset: 0x8A
    bool window;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.BoxCollider[] colliders
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::UnityEngine::BoxCollider*> colliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::BoxCollider*>) == 0x8);
    // private System.Boolean _usingBuiltInColliders
    // Size: 0x1
    // Offset: 0x98
    bool usingBuiltInColliders;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Single heightOverride
    // Size: 0x4
    // Offset: 0x9C
    float heightOverride;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.ValueTuple`4<System.Boolean,UnityEngine.Vector3,UnityEngine.Quaternion,UnityEngine.Vector3> _nullResponse
    // Size: 0xFFFFFFFF
    // Offset: 0xA0
    ::System::ValueTuple_4<bool, ::UnityEngine::Vector3, ::UnityEngine::Quaternion, ::UnityEngine::Vector3> nullResponse;
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> testObjects
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* testObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Boolean isBeingHeld
    bool& dyn_isBeingHeld();
    // Get instance field reference: public System.Boolean isAttached
    bool& dyn_isAttached();
    // Get instance field reference: public UnityEngine.GameObject maleConnectorParent
    ::UnityEngine::GameObject*& dyn_maleConnectorParent();
    // Get instance field reference: public UnityEngine.GameObject femaleConnectorParent
    ::UnityEngine::GameObject*& dyn_femaleConnectorParent();
    // Get instance field reference: private RoomOwnershipSync _roomOwnershipSync
