// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: NormalSessionManager
  class NormalSessionManager;
  // Forward declaring type: ChangeCategoryColors
  class ChangeCategoryColors;
  // Forward declaring type: ColorPickerSaveSpot
  class ColorPickerSaveSpot;
  // Forward declaring type: BrickPickerBrick
  class BrickPickerBrick;
  // Forward declaring type: FadeBrickMenu
  class FadeBrickMenu;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
  // Forward declaring type: Slider
  class Slider;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRGrabInteractable
  class XRGrabInteractable;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BrickPickerManager
  class BrickPickerManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BrickPickerManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BrickPickerManager*, "", "BrickPickerManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: BrickPickerManager
  // [TokenAttribute] Offset: FFFFFFFF
  class BrickPickerManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::BrickPickerManager::MenuTab
    struct MenuTab;
    // Nested type: ::GlobalNamespace::BrickPickerManager::$WarmMenu$d__51
    class $WarmMenu$d__51;
    // Size: 0x11
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: BrickPickerManager/MenuTab
    // [TokenAttribute] Offset: FFFFFFFF
    struct MenuTab/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly UnityEngine.UI.Button TabButton
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UI::Button* TabButton;
      // Field size check
      static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
      // public readonly UnityEngine.GameObject Gameobject
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::GameObject* Gameobject;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // public System.Boolean Initialized
      // Size: 0x1
      // Offset: 0x10
      bool Initialized;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: MenuTab
      constexpr MenuTab(::UnityEngine::UI::Button* TabButton_ = {}, ::UnityEngine::GameObject* Gameobject_ = {}, bool Initialized_ = {}) noexcept : TabButton{TabButton_}, Gameobject{Gameobject_}, Initialized{Initialized_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly UnityEngine.UI.Button TabButton
      [[deprecated]] ::UnityEngine::UI::Button*& dyn_TabButton();
      // Get instance field reference: public readonly UnityEngine.GameObject Gameobject
      [[deprecated]] ::UnityEngine::GameObject*& dyn_Gameobject();
      // Get instance field reference: public System.Boolean Initialized
      [[deprecated]] bool& dyn_Initialized();
      // public System.Void .ctor(UnityEngine.UI.Button tabButton, UnityEngine.GameObject gameObject)
      // Offset: 0x6F5670
      MenuTab(::UnityEngine::UI::Button* tabButton, ::UnityEngine::GameObject* gameObject);
    }; // BrickPickerManager/MenuTab
    #pragma pack(pop)
    static check_size<sizeof(BrickPickerManager::MenuTab), 16 + sizeof(bool)> __GlobalNamespace_BrickPickerManager_MenuTabSizeCheck;
    static_assert(sizeof(BrickPickerManager::MenuTab) == 0x11);
    public:
    // public UnityEngine.UI.Button bricksTabButton
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UI::Button* bricksTabButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.UI.Button tilesTabButton
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UI::Button* tilesTabButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.UI.Button platesTabButton
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UI::Button* platesTabButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.UI.Button slopesTabButton
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UI::Button* slopesTabButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.UI.Button sideStudsTabButton
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::UI::Button* sideStudsTabButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.UI.Button miscTabButton
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::UI::Button* miscTabButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.GameObject bricksTabObject
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* bricksTabObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject tilesTabObject
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* tilesTabObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject platesTabObject
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* platesTabObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject slopesTabObject
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* slopesTabObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject sideStudsTabObject
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* sideStudsTabObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject miscTabObject
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* miscTabObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject menuContentsObject
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* menuContentsObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject tilePrefab
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* tilePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public NormalSessionManager normalSessionManager
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::NormalSessionManager* normalSessionManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NormalSessionManager*) == 0x8);
    // public UnityEngine.GameObject leftHand
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* leftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject rightHand
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* rightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.UI.Slider hueSlider
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UI::Slider* hueSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public UnityEngine.UI.Slider saturationSlider
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UI::Slider* saturationSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public UnityEngine.UI.Slider valueSlider
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::UI::Slider* valueSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public ChangeCategoryColors changeCategoryColors
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::ChangeCategoryColors* changeCategoryColors;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ChangeCategoryColors*) == 0x8);
    // public ColorPickerSaveSpot[] colorPickerSaveSpots
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::GlobalNamespace::ColorPickerSaveSpot*> colorPickerSaveSpots;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::ColorPickerSaveSpot*>) == 0x8);
    // private ColorPickerSaveSpot _activeColorPickerSaveSpot
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::ColorPickerSaveSpot* activeColorPickerSaveSpot;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ColorPickerSaveSpot*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,BrickPickerManager/MenuTab> _tabs
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::Dictionary_2<::StringW, ::GlobalNamespace::BrickPickerManager::MenuTab>* tabs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::GlobalNamespace::BrickPickerManager::MenuTab>*) == 0x8);
    // private System.Collections.Generic.List`1<BrickPickerBrick> _brickPickerBricks
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::List_1<::GlobalNamespace::BrickPickerBrick*>* brickPickerBricks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BrickPickerBrick*>*) == 0x8);
    // private System.String _currentTab
    // Size: 0x8
    // Offset: 0xE0
    ::StringW currentTab;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _holdingMenu
    // Size: 0x1
    // Offset: 0xE8
    bool holdingMenu;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _holdingMenuWithLeftHand
    // Size: 0x1
    // Offset: 0xE9
    bool holdingMenuWithLeftHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: holdingMenuWithLeftHand and: menuRotVel
    char __padding27[0x2] = {};
    // private System.Single _menuRotVel
    // Size: 0x4
    // Offset: 0xEC
    float menuRotVel;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _waitingToReleaseLeftButton
    // Size: 0x1
    // Offset: 0xF0
    bool waitingToReleaseLeftButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _waitingToReleaseRightButton
    // Size: 0x1
    // Offset: 0xF1
    bool waitingToReleaseRightButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _menuClosing
    // Size: 0x1
    // Offset: 0xF2
    bool menuClosing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: menuClosing and: openMenuIndex
    char __padding31[0x1] = {};
    // public System.Int32 openMenuIndex
    // Size: 0x4
    // Offset: 0xF4
    int openMenuIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _firstOpen
    // Size: 0x1
    // Offset: 0xF8
    bool firstOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: firstOpen and: sliderInteractbles
    char __padding33[0x7] = {};
    // public UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable[] sliderInteractbles
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable*> sliderInteractbles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable*>) == 0x8);
    // public UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable categoryInteractable
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable* categoryInteractable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable*) == 0x8);
    // private FadeBrickMenu fade
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::FadeBrickMenu* fade;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FadeBrickMenu*) == 0x8);
    // [TupleElementNamesAttribute] Offset: 0xF3F50
    // private System.Collections.Generic.List`1<System.ValueTuple`2<BrickPickerBrick,System.Single>> hoveredBricksThisFrame
    // Size: 0x8
    // Offset: 0x118
    ::System::Collections::Generic::List_1<::System::ValueTuple_2<::GlobalNamespace::BrickPickerBrick*, float>>* hoveredBricksThisFrame;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::ValueTuple_2<::GlobalNamespace::BrickPickerBrick*, float>>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.UI.Button bricksTabButton
    [[deprecated]] ::UnityEngine::UI::Button*& dyn_bricksTabButton();
    // Get instance field reference: public UnityEngine.UI.Button tilesTabButton
    [[deprecated]] ::UnityEngine::UI::Button*& dyn_tilesTabButton();
    // Get instance field reference: public UnityEngine.UI.Button platesTabButton
    [[deprecated]] ::UnityEngine::UI::Button*& dyn_platesTabButton();
