// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BrickUuid
  class BrickUuid;
  // Forward declaring type: BulkGrabFollow
  class BulkGrabFollow;
  // Forward declaring type: LegoConnectorScript
  class LegoConnectorScript;
  // Forward declaring type: BuildingBrickSync
  class BuildingBrickSync;
  // Forward declaring type: UserSettings
  class UserSettings;
  // Forward declaring type: PlacedBrickRenderer
  class PlacedBrickRenderer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Collider
  class Collider;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeAvatarManager
  class RealtimeAvatarManager;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BrickAttach
  class BrickAttach;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BrickAttach);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BrickAttach*, "", "BrickAttach");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x118
  #pragma pack(push, 1)
  // Autogenerated type: BrickAttach
  // [TokenAttribute] Offset: FFFFFFFF
  class BrickAttach : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::BrickAttach::$$c
    class $$c;
    public:
    // private UnityEngine.Color32 _color
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::Color32 color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private System.Boolean _hoveredLeft
    // Size: 0x1
    // Offset: 0x1C
    bool hoveredLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _hoveredRight
    // Size: 0x1
    // Offset: 0x1D
    bool hoveredRight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <Held>k__BackingField
    // Size: 0x1
    // Offset: 0x1E
    bool Held;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Held and: renderQueue
    char __padding3[0x1] = {};
    // public System.Int32 renderQueue
    // Size: 0x4
    // Offset: 0x20
    int renderQueue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: renderQueue and: maleConnectorParent
    char __padding4[0x4] = {};
    // public UnityEngine.GameObject maleConnectorParent
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* maleConnectorParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject femaleConnectorParent
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* femaleConnectorParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject model
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* model;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject combinedModel
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* combinedModel;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private BrickUuid _brickUuid
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::BrickUuid* brickUuid;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BrickUuid*) == 0x8);
    // private UnityEngine.GameObject _modularModel
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* modularModel;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private BulkGrabFollow[] _attachedBulkGrabFollows
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::GlobalNamespace::BulkGrabFollow*> attachedBulkGrabFollows;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::BulkGrabFollow*>) == 0x8);
    // public System.String swapPrefab
    // Size: 0x8
    // Offset: 0x60
    ::StringW swapPrefab;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String normalPrefabName
    // Size: 0x8
    // Offset: 0x68
    ::StringW normalPrefabName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> maleConnectors
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* maleConnectors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> femaleConnectors
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* femaleConnectors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Collections.Generic.List`1<LegoConnectorScript> maleConnectorScripts
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::GlobalNamespace::LegoConnectorScript*>* maleConnectorScripts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::LegoConnectorScript*>*) == 0x8);
    // public System.Collections.Generic.List`1<LegoConnectorScript> femaleConnectorScripts
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::GlobalNamespace::LegoConnectorScript*>* femaleConnectorScripts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::LegoConnectorScript*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.String,LegoConnectorScript> maleConnectorScriptsByName
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::Dictionary_2<::StringW, ::GlobalNamespace::LegoConnectorScript*>* maleConnectorScriptsByName;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::GlobalNamespace::LegoConnectorScript*>*) == 0x8);
    // public UnityEngine.Mesh originalMesh
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Mesh* originalMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // public UnityEngine.Material originalMaterial
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Material* originalMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private BuildingBrickSync _brickSync
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::BuildingBrickSync* brickSync;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuildingBrickSync*) == 0x8);
    // private UserSettings _userSettings
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::UserSettings* userSettings;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings*) == 0x8);
    // private UnityEngine.MaterialPropertyBlock _props
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::MaterialPropertyBlock* props;
    // Field size check
    static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
    // public UnityEngine.Mesh solidMesh
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Mesh* solidMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // public UnityEngine.Mesh hollowMesh
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Mesh* hollowMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // public UnityEngine.Mesh studMesh
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Mesh* studMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // public PlacedBrickRenderer placedBrickRenderer
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::PlacedBrickRenderer* placedBrickRenderer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlacedBrickRenderer*) == 0x8);
    // public UnityEngine.MeshFilter meshFilter
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::MeshFilter* meshFilter;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // public UnityEngine.MeshRenderer meshRenderer
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::MeshRenderer* meshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public System.Boolean renderHollowMesh
    // Size: 0x1
    // Offset: 0xF0
    bool renderHollowMesh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isPlayerHead
    // Size: 0x1
    // Offset: 0xF1
    bool isPlayerHead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPlayerHead and: headClientId
    char __padding31[0x2] = {};
    // public System.Int32 headClientId
    // Size: 0x4
    // Offset: 0xF4
    int headClientId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Normal.Realtime.RealtimeAvatarManager _realtimeAvatarManager
    // Size: 0x8
    // Offset: 0xF8
    ::Normal::Realtime::RealtimeAvatarManager* realtimeAvatarManager;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeAvatarManager*) == 0x8);
    // public System.Single texOffset
    // Size: 0x4
    // Offset: 0x100
    float texOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: texOffset and: colliderBuffer
    char __padding34[0x4] = {};
    // private readonly UnityEngine.Collider[] _colliderBuffer
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::UnityEngine::Collider*> colliderBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<BrickAttach,System.Boolean> _attachBuffer
    // Size: 0x8
    // Offset: 0x110
    ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::BrickAttach*, bool>* attachBuffer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::GlobalNamespace::BrickAttach*, bool>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private readonly System.Int32 ShaderColorProperty
    static int _get_ShaderColorProperty();
    // Set static field: static private readonly System.Int32 ShaderColorProperty
    static void _set_ShaderColorProperty(int value);
    // Get static field: static private readonly System.Int32 ShaderTexOffsetProperty
    static int _get_ShaderTexOffsetProperty();
    // Set static field: static private readonly System.Int32 ShaderTexOffsetProperty
    static void _set_ShaderTexOffsetProperty(int value);
