// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Normal.Realtime.RealtimeModel
#include "Normal/Realtime/RealtimeModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: ReliableProperty`1<T>
  template<typename T>
  class ReliableProperty_1;
}
// Forward declaring namespace: Normal::Realtime::Serialization
namespace Normal::Realtime::Serialization {
  // Skipping declaration: StreamContext because it is already included!
  // Forward declaring type: WriteStream
  class WriteStream;
  // Forward declaring type: ReadStream
  class ReadStream;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BuildingBrickModel
  class BuildingBrickModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BuildingBrickModel);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BuildingBrickModel*, "", "BuildingBrickModel");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x128
  #pragma pack(push, 1)
  // Autogenerated type: BuildingBrickModel
  // [TokenAttribute] Offset: FFFFFFFF
  // [RealtimeModelAttribute] Offset: 728508
  class BuildingBrickModel : public ::Normal::Realtime::RealtimeModel {
    public:
    // Nested type: ::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<T>
    template<typename T>
    class PropertyChangedHandler_1;
    // Nested type: ::GlobalNamespace::BuildingBrickModel::PropertyID
    struct PropertyID;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [RealtimePropertyAttribute] Offset: 0x729F58
    // private System.Boolean _attached
    // Size: 0x1
    // Offset: 0x8C
    bool attached;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: attached and: uuid
    char __padding0[0x3] = {};
    // [RealtimePropertyAttribute] Offset: 0x729F74
    // private System.String _uuid
    // Size: 0x8
    // Offset: 0x90
    ::StringW uuid;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [RealtimePropertyAttribute] Offset: 0x729F90
    // private System.String _bricksAbove
    // Size: 0x8
    // Offset: 0x98
    ::StringW bricksAbove;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [RealtimePropertyAttribute] Offset: 0x729FAC
    // private System.String _bricksBelow
    // Size: 0x8
    // Offset: 0xA0
    ::StringW bricksBelow;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [RealtimePropertyAttribute] Offset: 0x729FC8
    // private System.Int32 _matId
    // Size: 0x4
    // Offset: 0xA8
    int matId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0x729FE4
    // private System.Int32 _color
    // Size: 0x4
    // Offset: 0xAC
    int color;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0x72A000
    // private System.Boolean _usingNewColors
    // Size: 0x1
    // Offset: 0xB0
    bool usingNewColors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: usingNewColors and: attachedDidChange
    char __padding6[0x7] = {};
    // private BuildingBrickModel/PropertyChangedHandler`1<System.Boolean> attachedDidChange
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<bool>* attachedDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<bool>*) == 0x8);
    // private BuildingBrickModel/PropertyChangedHandler`1<System.String> uuidDidChange
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<::StringW>* uuidDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<::StringW>*) == 0x8);
    // private BuildingBrickModel/PropertyChangedHandler`1<System.String> bricksAboveDidChange
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<::StringW>* bricksAboveDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<::StringW>*) == 0x8);
    // private BuildingBrickModel/PropertyChangedHandler`1<System.String> bricksBelowDidChange
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<::StringW>* bricksBelowDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<::StringW>*) == 0x8);
    // private BuildingBrickModel/PropertyChangedHandler`1<System.Int32> matIdDidChange
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<int>* matIdDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<int>*) == 0x8);
    // private BuildingBrickModel/PropertyChangedHandler`1<System.Int32> colorDidChange
    // Size: 0x8
    // Offset: 0xE0
    ::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<int>* colorDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<int>*) == 0x8);
    // private BuildingBrickModel/PropertyChangedHandler`1<System.Boolean> usingNewColorsDidChange
    // Size: 0x8
    // Offset: 0xE8
    ::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<bool>* usingNewColorsDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuildingBrickModel::PropertyChangedHandler_1<bool>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Boolean> _attachedProperty
    // Size: 0x8
    // Offset: 0xF0
    ::Normal::Realtime::ReliableProperty_1<bool>* attachedProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<bool>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.String> _uuidProperty
    // Size: 0x8
    // Offset: 0xF8
    ::Normal::Realtime::ReliableProperty_1<::StringW>* uuidProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<::StringW>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.String> _bricksAboveProperty
    // Size: 0x8
    // Offset: 0x100
    ::Normal::Realtime::ReliableProperty_1<::StringW>* bricksAboveProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<::StringW>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.String> _bricksBelowProperty
    // Size: 0x8
    // Offset: 0x108
    ::Normal::Realtime::ReliableProperty_1<::StringW>* bricksBelowProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<::StringW>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Int32> _matIdProperty
    // Size: 0x8
    // Offset: 0x110
    ::Normal::Realtime::ReliableProperty_1<int>* matIdProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<int>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Int32> _colorProperty
    // Size: 0x8
    // Offset: 0x118
    ::Normal::Realtime::ReliableProperty_1<int>* colorProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<int>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Boolean> _usingNewColorsProperty
    // Size: 0x8
    // Offset: 0x120
    ::Normal::Realtime::ReliableProperty_1<bool>* usingNewColorsProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<bool>*) == 0x8);
    public:
    // Get instance field reference: private System.Boolean _attached
    bool& dyn__attached();
    // Get instance field reference: private System.String _uuid
    ::StringW& dyn__uuid();
    // Get instance field reference: private System.String _bricksAbove
    ::StringW& dyn__bricksAbove();
    // Get instance field reference: private System.String _bricksBelow
    ::StringW& dyn__bricksBelow();
    // Get instance field reference: private System.Int32 _matId
    int& dyn__matId();
    // Get instance field reference: private System.Int32 _color
    int& dyn__color();
    // Get instance field reference: private System.Boolean _usingNewColors
    bool& dyn__usingNewColors();
