// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LoadingScreen
  class LoadingScreen;
}
// Forward declaring namespace: ProfanityFilter
namespace ProfanityFilter {
  // Forward declaring type: ProfanityFilter
  class ProfanityFilter;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: CreateKeyboardManager
  class CreateKeyboardManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::CreateKeyboardManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::CreateKeyboardManager*, "", "CreateKeyboardManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: CreateKeyboardManager
  // [TokenAttribute] Offset: FFFFFFFF
  class CreateKeyboardManager : public ::UnityEngine::MonoBehaviour {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public TMPro.TextMeshProUGUI nameText
    // Size: 0x8
    // Offset: 0x18
    ::TMPro::TextMeshProUGUI* nameText;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public UnityEngine.GameObject createMenu
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* createMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject loadingMenu
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* loadingMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public LoadingScreen loadingScreen
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::LoadingScreen* loadingScreen;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LoadingScreen*) == 0x8);
    // private System.String _enteredName
    // Size: 0x8
    // Offset: 0x38
    ::StringW enteredName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _defaultNameLabel
    // Size: 0x8
    // Offset: 0x40
    ::StringW defaultNameLabel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private ProfanityFilter.ProfanityFilter _profanityFilter
    // Size: 0x8
    // Offset: 0x48
    ::ProfanityFilter::ProfanityFilter* profanityFilter;
    // Field size check
    static_assert(sizeof(::ProfanityFilter::ProfanityFilter*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Int32 MaxNameLength
    static constexpr const int MaxNameLength = 15;
    // Get static field: static private System.Int32 MaxNameLength
    static int _get_MaxNameLength();
    // Set static field: static private System.Int32 MaxNameLength
    static void _set_MaxNameLength(int value);
    // static field const value: static private System.String DefaultName
    static constexpr const char* DefaultName = "My World";
    // Get static field: static private System.String DefaultName
    static ::StringW _get_DefaultName();
    // Set static field: static private System.String DefaultName
    static void _set_DefaultName(::StringW value);
    // Get instance field reference: public TMPro.TextMeshProUGUI nameText
    ::TMPro::TextMeshProUGUI*& dyn_nameText();
    // Get instance field reference: public UnityEngine.GameObject createMenu
    ::UnityEngine::GameObject*& dyn_createMenu();
    // Get instance field reference: public UnityEngine.GameObject loadingMenu
    ::UnityEngine::GameObject*& dyn_loadingMenu();
    // Get instance field reference: public LoadingScreen loadingScreen
    ::GlobalNamespace::LoadingScreen*& dyn_loadingScreen();
    // Get instance field reference: private System.String _enteredName
    ::StringW& dyn__enteredName();
    // Get instance field reference: private System.String _defaultNameLabel
    ::StringW& dyn__defaultNameLabel();
    // Get instance field reference: private ProfanityFilter.ProfanityFilter _profanityFilter
    ::ProfanityFilter::ProfanityFilter*& dyn__profanityFilter();
    // private System.Void Awake()
    // Offset: 0x10A2AB4
    void Awake();
    // private System.Void OnEnable()
    // Offset: 0x10A2B34
    void OnEnable();
    // public System.Void KeyPress(System.String key)
    // Offset: 0x10A2B78
    void KeyPress(::StringW key);
    // public System.Void BackspacePress()
    // Offset: 0x10A2C24
    void BackspacePress();
    // public System.Void SubmitAndCreateRoom()
    // Offset: 0x10A2C78
    void SubmitAndCreateRoom();
    // public System.Void ClearName()
    // Offset: 0x10A2D98
    void ClearName();
    // private System.Void UpdateNameOnUI()
    // Offset: 0x10A2B38
    void UpdateNameOnUI();
    // public System.Void .ctor()
    // Offset: 0x10A2DEC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CreateKeyboardManager* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::CreateKeyboardManager::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CreateKeyboardManager*, creationType>()));
    }
  }; // CreateKeyboardManager
  #pragma pack(pop)
  static check_size<sizeof(CreateKeyboardManager), 72 + sizeof(::ProfanityFilter::ProfanityFilter*)> __GlobalNamespace_CreateKeyboardManagerSizeCheck;
  static_assert(sizeof(CreateKeyboardManager) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::CreateKeyboardManager::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::CreateKeyboardManager::*)()>(&GlobalNamespace::CreateKeyboardManager::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::CreateKeyboardManager*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::CreateKeyboardManager::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::CreateKeyboardManager::*)()>(&GlobalNamespace::CreateKeyboardManager::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::CreateKeyboardManager*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::CreateKeyboardManager::KeyPress
// Il2CppName: KeyPress
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::CreateKeyboardManager::*)(::StringW)>(&GlobalNamespace::CreateKeyboardManager::KeyPress)> {
  static const MethodInfo* get() {
    static auto* key = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::CreateKeyboardManager*), "KeyPress", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{key});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::CreateKeyboardManager::BackspacePress
// Il2CppName: BackspacePress
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::CreateKeyboardManager::*)()>(&GlobalNamespace::CreateKeyboardManager::BackspacePress)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::CreateKeyboardManager*), "BackspacePress", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::CreateKeyboardManager::SubmitAndCreateRoom
// Il2CppName: SubmitAndCreateRoom
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::CreateKeyboardManager::*)()>(&GlobalNamespace::CreateKeyboardManager::SubmitAndCreateRoom)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::CreateKeyboardManager*), "SubmitAndCreateRoom", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::CreateKeyboardManager::ClearName
// Il2CppName: ClearName
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::CreateKeyboardManager::*)()>(&GlobalNamespace::CreateKeyboardManager::ClearName)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::CreateKeyboardManager*), "ClearName", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::CreateKeyboardManager::UpdateNameOnUI
// Il2CppName: UpdateNameOnUI
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::CreateKeyboardManager::*)()>(&GlobalNamespace::CreateKeyboardManager::UpdateNameOnUI)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::CreateKeyboardManager*), "UpdateNameOnUI", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::CreateKeyboardManager::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
