// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Normal.Realtime.RealtimeModel
#include "Normal/Realtime/RealtimeModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: UnreliableProperty`1<T>
  template<typename T>
  class UnreliableProperty_1;
}
// Forward declaring namespace: Normal::Realtime::Serialization
namespace Normal::Realtime::Serialization {
  // Skipping declaration: StreamContext because it is already included!
  // Forward declaring type: WriteStream
  class WriteStream;
  // Forward declaring type: ReadStream
  class ReadStream;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: HandGestureModel
  class HandGestureModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::HandGestureModel);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::HandGestureModel*, "", "HandGestureModel");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xF8
  #pragma pack(push, 1)
  // Autogenerated type: HandGestureModel
  // [TokenAttribute] Offset: FFFFFFFF
  // [RealtimeModelAttribute] Offset: D4660
  class HandGestureModel : public ::Normal::Realtime::RealtimeModel {
    public:
    // Writing base type padding for base size: 0x8C to desired offset: 0x90
    char ___base_padding[0x4] = {};
    // Nested type: ::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<T>
    template<typename T>
    class PropertyChangedHandler_1;
    // Nested type: ::GlobalNamespace::HandGestureModel::PropertyID
    struct PropertyID;
    public:
    // [RealtimePropertyAttribute] Offset: 0xFB280
    // private System.Int32 _handPoseId
    // Size: 0x4
    // Offset: 0x90
    int handPoseId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0xFB2B0
    // private System.Single _flex
    // Size: 0x4
    // Offset: 0x94
    float flex;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0xFB340
    // private System.Single _point
    // Size: 0x4
    // Offset: 0x98
    float point;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0xFB3A0
    // private System.Single _thumbsUp
    // Size: 0x4
    // Offset: 0x9C
    float thumbsUp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0xFB410
    // private System.Single _pinch
    // Size: 0x4
    // Offset: 0xA0
    float pinch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: pinch and: handPoseIdDidChange
    char __padding4[0x4] = {};
    // private HandGestureModel/PropertyChangedHandler`1<System.Int32> handPoseIdDidChange
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<int>* handPoseIdDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<int>*) == 0x8);
    // private HandGestureModel/PropertyChangedHandler`1<System.Single> flexDidChange
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<float>* flexDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<float>*) == 0x8);
    // private HandGestureModel/PropertyChangedHandler`1<System.Single> pointDidChange
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<float>* pointDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<float>*) == 0x8);
    // private HandGestureModel/PropertyChangedHandler`1<System.Single> thumbsUpDidChange
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<float>* thumbsUpDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<float>*) == 0x8);
    // private HandGestureModel/PropertyChangedHandler`1<System.Single> pinchDidChange
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<float>* pinchDidChange;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<float>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<System.Int32> _handPoseIdProperty
    // Size: 0x8
    // Offset: 0xD0
    ::Normal::Realtime::UnreliableProperty_1<int>* handPoseIdProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<int>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<System.Single> _flexProperty
    // Size: 0x8
    // Offset: 0xD8
    ::Normal::Realtime::UnreliableProperty_1<float>* flexProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<float>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<System.Single> _pointProperty
    // Size: 0x8
    // Offset: 0xE0
    ::Normal::Realtime::UnreliableProperty_1<float>* pointProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<float>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<System.Single> _thumbsUpProperty
    // Size: 0x8
    // Offset: 0xE8
    ::Normal::Realtime::UnreliableProperty_1<float>* thumbsUpProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<float>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<System.Single> _pinchProperty
    // Size: 0x8
    // Offset: 0xF0
    ::Normal::Realtime::UnreliableProperty_1<float>* pinchProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<float>*) == 0x8);
    public:
    // Get instance field reference: private System.Int32 _handPoseId
    [[deprecated]] int& dyn__handPoseId();
    // Get instance field reference: private System.Single _flex
    [[deprecated]] float& dyn__flex();
    // Get instance field reference: private System.Single _point
    [[deprecated]] float& dyn__point();
    // Get instance field reference: private System.Single _thumbsUp
    [[deprecated]] float& dyn__thumbsUp();
    // Get instance field reference: private System.Single _pinch
    [[deprecated]] float& dyn__pinch();
    // Get instance field reference: private HandGestureModel/PropertyChangedHandler`1<System.Int32> handPoseIdDidChange
    [[deprecated]] ::GlobalNamespace::HandGestureModel::PropertyChangedHandler_1<int>*& dyn_handPoseIdDidChange();
