// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: JoystickLocomotion
  class JoystickLocomotion;
  // Forward declaring type: BrickStore
  class BrickStore;
  // Forward declaring type: UserSettings
  class UserSettings;
  // Forward declaring type: ControllerButtonInput
  class ControllerButtonInput;
  // Forward declaring type: DownloadBricksOnLoad
  class DownloadBricksOnLoad;
  // Forward declaring type: BrickPickerManager
  class BrickPickerManager;
  // Forward declaring type: TutorialManager
  class TutorialManager;
  // Forward declaring type: MusicPlayer
  class MusicPlayer;
  // Forward declaring type: MovementVignette
  class MovementVignette;
  // Forward declaring type: AdjustPlayerScale
  class AdjustPlayerScale;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeAvatarManager
  class RealtimeAvatarManager;
  // Forward declaring type: Realtime
  class Realtime;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRInteractionManager
  class XRInteractionManager;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Toggle
  class Toggle;
  // Forward declaring type: Slider
  class Slider;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: NormalSessionManager
  class NormalSessionManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::NormalSessionManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::NormalSessionManager*, "", "NormalSessionManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x278
  #pragma pack(push, 1)
  // Autogenerated type: NormalSessionManager
  // [TokenAttribute] Offset: FFFFFFFF
  class NormalSessionManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::NormalSessionManager::$Start$d__82
    class $Start$d__82;
    // Nested type: ::GlobalNamespace::NormalSessionManager::$JoinRoom$d__92
    class $JoinRoom$d__92;
    // Nested type: ::GlobalNamespace::NormalSessionManager::$BackToMenu$d__95
    class $BackToMenu$d__95;
    // Nested type: ::GlobalNamespace::NormalSessionManager::$DownloadBricksFromDatastore$d__103
    class $DownloadBricksFromDatastore$d__103;
    // Nested type: ::GlobalNamespace::NormalSessionManager::$$c__DisplayClass105_0
    class $$c__DisplayClass105_0;
    // Nested type: ::GlobalNamespace::NormalSessionManager::$PlayTutorialIEnum$d__113
    class $PlayTutorialIEnum$d__113;
    public:
    // public UnityEngine.GameObject realtimeGameobject
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* realtimeGameobject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private Normal.Realtime.RealtimeAvatarManager _avatarManager
    // Size: 0x8
    // Offset: 0x20
    ::Normal::Realtime::RealtimeAvatarManager* avatarManager;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeAvatarManager*) == 0x8);
    // public UnityEngine.GameObject playerControllers
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* playerControllers;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject menuPlayerSpawnPoint
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* menuPlayerSpawnPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Transform gameSpawnPoint
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* gameSpawnPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject menuLeftHand
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* menuLeftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject menuRightHand
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* menuRightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject teleporterLeftHand
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* teleporterLeftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject teleporterRightHand
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* teleporterRightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject inGameLeftHand
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* inGameLeftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject inGameRightHand
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* inGameRightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject head
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* head;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xFEFE0
    // public TMPro.TextMeshProUGUI menuRoomCodeDisplay
    // Size: 0x8
    // Offset: 0x78
    ::TMPro::TextMeshProUGUI* menuRoomCodeDisplay;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public UnityEngine.GameObject menuEnvironment
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* menuEnvironment;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject mainEnvironment
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* mainEnvironment;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private Normal.Realtime.Realtime _realtime
    // Size: 0x8
    // Offset: 0x90
    ::Normal::Realtime::Realtime* realtime;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Realtime*) == 0x8);
    // public UnityEngine.MeshRenderer loadingObjectRenderer
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::MeshRenderer* loadingObjectRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.Material _loadingObjectMat
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Material* loadingObjectMat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.AudioSource ambientMusic
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::AudioSource* ambientMusic;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public JoystickLocomotion joystickLocomotion
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::JoystickLocomotion* joystickLocomotion;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::JoystickLocomotion*) == 0x8);
    // public UnityEngine.XR.Interaction.Toolkit.XRInteractionManager xrInteractionManager
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager* xrInteractionManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager*) == 0x8);
    // private BrickStore _brickStore
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::BrickStore* brickStore;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BrickStore*) == 0x8);
    // public TMPro.TextMeshProUGUI menuRoomCode
    // Size: 0x8
    // Offset: 0xC8
    ::TMPro::TextMeshProUGUI* menuRoomCode;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public UserSettings userSettings
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::UserSettings* userSettings;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings*) == 0x8);
    // public UnityEngine.GameObject vrRig
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* vrRig;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public ControllerButtonInput buttonInput
    // Size: 0x8
    // Offset: 0xE0
    ::GlobalNamespace::ControllerButtonInput* buttonInput;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ControllerButtonInput*) == 0x8);
    // public UnityEngine.GameObject menuBoard
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::GameObject* menuBoard;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public DownloadBricksOnLoad downloadBricksOnLoad
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::DownloadBricksOnLoad* downloadBricksOnLoad;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::DownloadBricksOnLoad*) == 0x8);
    // private System.Boolean _didConnectToRoom
    // Size: 0x1
    // Offset: 0xF8
    bool didConnectToRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _didDisconnectFromRoom
    // Size: 0x1
    // Offset: 0xF9
    bool didDisconnectFromRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: didDisconnectFromRoom and: joiningCoroutine
    char __padding29[0x6] = {};
    // private UnityEngine.Coroutine _joiningCoroutine
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::Coroutine* joiningCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // public UnityEngine.GameObject mainPage
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::GameObject* mainPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xFF050
    // public UnityEngine.GameObject joinByCodePage
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::GameObject* joinByCodePage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject settingsPage
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::GameObject* settingsPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject inGameMain
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::GameObject* inGameMain;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject audioSettingsPage
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::GameObject* audioSettingsPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject controlsSettingsPage
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::GameObject* controlsSettingsPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject miscSettingsPage
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::GameObject* miscSettingsPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject loadingPage
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::GameObject* loadingPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject roomMenuPage
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::GameObject* roomMenuPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject enterNamePage
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::GameObject* enterNamePage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject joinMenuPage
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::GameObject* joinMenuPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject joinRecentPage
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::GameObject* joinRecentPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject playersMenu
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::GameObject* playersMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject versionTooOldMenu
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::GameObject* versionTooOldMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject errorMenu
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::GameObject* errorMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject findFriendsMenu
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::GameObject* findFriendsMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject avatarEditorMenu
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::GameObject* avatarEditorMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject exportRoomMenu
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::GameObject* exportRoomMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.UI.Toggle teleportToggle
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::UI::Toggle* teleportToggle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Toggle*) == 0x8);
    // public UnityEngine.UI.Toggle micEnabledToggle
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::UI::Toggle* micEnabledToggle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Toggle*) == 0x8);
    // public UnityEngine.UI.Toggle otherMicsEnabledToogle
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::UI::Toggle* otherMicsEnabledToogle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Toggle*) == 0x8);
    // public UnityEngine.UI.Toggle performanceMode
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::UI::Toggle* performanceMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Toggle*) == 0x8);
    // public UnityEngine.UI.Toggle musicPlayingToggle
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::UI::Toggle* musicPlayingToggle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Toggle*) == 0x8);
    // public UnityEngine.UI.Toggle smoothTurnToggle
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::UI::Toggle* smoothTurnToggle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Toggle*) == 0x8);
    // public UnityEngine.UI.Toggle pushToTalkEnabledToggle
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::UI::Toggle* pushToTalkEnabledToggle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Toggle*) == 0x8);
    // public UnityEngine.UI.Toggle brickClickSoundsToggle
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::UI::Toggle* brickClickSoundsToggle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Toggle*) == 0x8);
    // public UnityEngine.UI.Slider musicVolumeSlider
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::UI::Slider* musicVolumeSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public UnityEngine.UI.Slider movementSpeedSlider
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::UI::Slider* movementSpeedSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public UnityEngine.UI.Slider rotationSpeedSlider
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::UI::Slider* rotationSpeedSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public UnityEngine.UI.Slider vignetteSlider
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::UI::Slider* vignetteSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xFF0C0
    // public UnityEngine.UI.Slider renderDistanceSlider
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::UI::Slider* renderDistanceSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public UnityEngine.UI.Slider playerScaleSlider
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::UI::Slider* playerScaleSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public UnityEngine.UI.Slider brickShininessSlider
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::UI::Slider* brickShininessSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public BrickPickerManager brickPickerMenu
    // Size: 0x8
    // Offset: 0x210
    ::GlobalNamespace::BrickPickerManager* brickPickerMenu;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BrickPickerManager*) == 0x8);
    // public TMPro.TextMeshProUGUI joiningStatusText
    // Size: 0x8
    // Offset: 0x218
    ::TMPro::TextMeshProUGUI* joiningStatusText;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public UnityEngine.GameObject joiningBackButton
    // Size: 0x8
    // Offset: 0x220
    ::UnityEngine::GameObject* joiningBackButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public TutorialManager tutorialManager
    // Size: 0x8
    // Offset: 0x228
    ::GlobalNamespace::TutorialManager* tutorialManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TutorialManager*) == 0x8);
    // public MusicPlayer musicPlayer
    // Size: 0x8
    // Offset: 0x230
    ::GlobalNamespace::MusicPlayer* musicPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MusicPlayer*) == 0x8);
    // private readonly System.String _roomPrefix
    // Size: 0x8
    // Offset: 0x238
    ::StringW roomPrefix;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _roomName
    // Size: 0x8
    // Offset: 0x240
    ::StringW roomName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single _ambientMusicMaxVolume
    // Size: 0x4
    // Offset: 0x248
    float ambientMusicMaxVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _loading
    // Size: 0x1
    // Offset: 0x24C
    bool loading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _inGameMenuUp
    // Size: 0x1
    // Offset: 0x24D
    bool inGameMenuUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean debugMode
    // Size: 0x1
    // Offset: 0x24E
    bool debugMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean oldMenuEnabled
    // Size: 0x1
    // Offset: 0x24F
    bool oldMenuEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.GameObject tutorialEnvironment
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::GameObject* tutorialEnvironment;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public TMPro.TextMeshProUGUI roomNameLabel
    // Size: 0x8
    // Offset: 0x258
    ::TMPro::TextMeshProUGUI* roomNameLabel;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public MovementVignette movementVignette
    // Size: 0x8
    // Offset: 0x260
    ::GlobalNamespace::MovementVignette* movementVignette;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MovementVignette*) == 0x8);
    // public AdjustPlayerScale adjustPlayerScale
    // Size: 0x8
    // Offset: 0x268
    ::GlobalNamespace::AdjustPlayerScale* adjustPlayerScale;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AdjustPlayerScale*) == 0x8);
    // private UnityEngine.Coroutine _tutorialCoroutine
    // Size: 0x8
    // Offset: 0x270
    ::UnityEngine::Coroutine* tutorialCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.String UpstreamErrorText
    static constexpr const char* UpstreamErrorText = "Error: Received an error status from the BricksVR datastore.\u000a\u000aPlease join the Discord at https://bricksvr.com/discord or wait a few minutes.";
    // Get static field: static public System.String UpstreamErrorText
    static ::StringW _get_UpstreamErrorText();
    // Set static field: static public System.String UpstreamErrorText
    static void _set_UpstreamErrorText(::StringW value);
    // static field const value: static public System.String NetworkErrorText
