// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRPlugin/ColorSpace
#include "GlobalNamespace/OVRPlugin_ColorSpace.hpp"
// Including type: OVRManager/CompositionMethod
#include "GlobalNamespace/OVRManager_CompositionMethod.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: OVRManager/CameraDevice
#include "GlobalNamespace/OVRManager_CameraDevice.hpp"
// Including type: OVRManager/DepthQuality
#include "GlobalNamespace/OVRManager_DepthQuality.hpp"
// Including type: OVRManager/VirtualGreenScreenType
#include "GlobalNamespace/OVRManager_VirtualGreenScreenType.hpp"
// Including type: OVRManager/MrcActivationMode
#include "GlobalNamespace/OVRManager_MrcActivationMode.hpp"
// Including type: OVRManager/TrackingOrigin
#include "GlobalNamespace/OVRManager_TrackingOrigin.hpp"
// Including type: OVRManager/XRDevice
#include "GlobalNamespace/OVRManager_XRDevice.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Vector4
  struct Vector4;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRDisplay
  class OVRDisplay;
  // Forward declaring type: OVRTracker
  class OVRTracker;
  // Forward declaring type: OVRBoundary
  class OVRBoundary;
  // Forward declaring type: OVRProfile
  class OVRProfile;
  // Forward declaring type: OVRMixedRealityCaptureSettings
  class OVRMixedRealityCaptureSettings;
  // Forward declaring type: EyeTextureFormat
  struct OVRManager_EyeTextureFormat;
  // Forward declaring type: FixedFoveatedRenderingLevel
  struct OVRManager_FixedFoveatedRenderingLevel;
  // Forward declaring type: TiledMultiResLevel
  struct OVRManager_TiledMultiResLevel;
  // Forward declaring type: OVRPose
  struct OVRPose;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRDisplaySubsystem
  class XRDisplaySubsystem;
  // Forward declaring type: XRDisplaySubsystemDescriptor
  class XRDisplaySubsystemDescriptor;
  // Forward declaring type: XRInputSubsystem
  class XRInputSubsystem;
  // Forward declaring type: XRNode
  struct XRNode;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRManager
  class OVRManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRManager*, "", "OVRManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: OVRManager
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRManager : public ::UnityEngine::MonoBehaviour {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Collections.Generic.IEnumerable`1<UnityEngine.Camera> disabledCameras
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::IEnumerable_1<::UnityEngine::Camera*>* disabledCameras;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IEnumerable_1<::UnityEngine::Camera*>*) == 0x8);
    // private System.Single prevTimeScale
    // Size: 0x4
    // Offset: 0x20
    float prevTimeScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0x71A1F0
    // [TooltipAttribute] Offset: 0x71A1F0
    // public System.Boolean useRecommendedMSAALevel
    // Size: 0x1
    // Offset: 0x24
    bool useRecommendedMSAALevel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x71A250
    // private System.Boolean _monoscopic
    // Size: 0x1
    // Offset: 0x25
    bool monoscopic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x71A29C
    // public System.Boolean enableAdaptiveResolution
    // Size: 0x1
    // Offset: 0x26
    bool enableAdaptiveResolution;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean enableColorGamut
    // Size: 0x1
    // Offset: 0x27
    bool enableColorGamut;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public OVRPlugin/ColorSpace colorGamut
    // Size: 0x4
    // Offset: 0x28
    ::GlobalNamespace::OVRPlugin::ColorSpace colorGamut;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::ColorSpace) == 0x4);
    // [RangeAttribute] Offset: 0x71A2F4
    // [TooltipAttribute] Offset: 0x71A2F4
    // public System.Single minRenderScale
    // Size: 0x4
    // Offset: 0x2C
    float minRenderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x71A348
    // [TooltipAttribute] Offset: 0x71A348
    // public System.Single maxRenderScale
    // Size: 0x4
    // Offset: 0x30
    float maxRenderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71A39C
    // private UnityEngine.Vector3 _headPoseRelativeOffsetRotation
    // Size: 0xC
    // Offset: 0x34
    ::UnityEngine::Vector3 headPoseRelativeOffsetRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0x71A3E8
    // private UnityEngine.Vector3 _headPoseRelativeOffsetTranslation
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 headPoseRelativeOffsetTranslation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Int32 profilerTcpPort
    // Size: 0x4
    // Offset: 0x4C
    int profilerTcpPort;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean expandMixedRealityCapturePropertySheet
    // Size: 0x1
    // Offset: 0x50
    bool expandMixedRealityCapturePropertySheet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x71A444
    // public System.Boolean enableMixedReality
    // Size: 0x1
    // Offset: 0x51
    bool enableMixedReality;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableMixedReality and: compositionMethod
    char __padding13[0x2] = {};
    // public OVRManager/CompositionMethod compositionMethod
    // Size: 0x4
    // Offset: 0x54
    ::GlobalNamespace::OVRManager_CompositionMethod compositionMethod;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_CompositionMethod) == 0x4);
    // [TooltipAttribute] Offset: 0x71A4A0
    // public UnityEngine.LayerMask extraHiddenLayers
    // Size: 0x4
    // Offset: 0x58
    ::UnityEngine::LayerMask extraHiddenLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // [TooltipAttribute] Offset: 0x71A4EC
    // public UnityEngine.Color externalCompositionBackdropColorRift
    // Size: 0x10
    // Offset: 0x5C
    ::UnityEngine::Color externalCompositionBackdropColorRift;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [TooltipAttribute] Offset: 0x71A538
    // public UnityEngine.Color externalCompositionBackdropColorQuest
    // Size: 0x10
    // Offset: 0x6C
    ::UnityEngine::Color externalCompositionBackdropColorQuest;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [TooltipAttribute] Offset: 0x71A584
    // public OVRManager/CameraDevice capturingCameraDevice
    // Size: 0x4
    // Offset: 0x7C
    ::GlobalNamespace::OVRManager_CameraDevice capturingCameraDevice;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_CameraDevice) == 0x4);
    // [TooltipAttribute] Offset: 0x71A5D0
    // public System.Boolean flipCameraFrameHorizontally
    // Size: 0x1
    // Offset: 0x80
    bool flipCameraFrameHorizontally;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x71A61C
    // public System.Boolean flipCameraFrameVertically
    // Size: 0x1
    // Offset: 0x81
    bool flipCameraFrameVertically;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: flipCameraFrameVertically and: handPoseStateLatency
    char __padding20[0x2] = {};
    // [TooltipAttribute] Offset: 0x71A668
    // public System.Single handPoseStateLatency
    // Size: 0x4
    // Offset: 0x84
    float handPoseStateLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71A6B4
    // public System.Single sandwichCompositionRenderLatency
    // Size: 0x4
    // Offset: 0x88
    float sandwichCompositionRenderLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71A700
    // public System.Int32 sandwichCompositionBufferedFrames
    // Size: 0x4
    // Offset: 0x8C
    int sandwichCompositionBufferedFrames;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0x71A74C
    // public UnityEngine.Color chromaKeyColor
    // Size: 0x10
    // Offset: 0x90
    ::UnityEngine::Color chromaKeyColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [TooltipAttribute] Offset: 0x71A798
    // public System.Single chromaKeySimilarity
    // Size: 0x4
    // Offset: 0xA0
    float chromaKeySimilarity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71A7E4
    // public System.Single chromaKeySmoothRange
    // Size: 0x4
    // Offset: 0xA4
    float chromaKeySmoothRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71A830
    // public System.Single chromaKeySpillRange
    // Size: 0x4
    // Offset: 0xA8
    float chromaKeySpillRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71A87C
    // public System.Boolean useDynamicLighting
    // Size: 0x1
    // Offset: 0xAC
    bool useDynamicLighting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useDynamicLighting and: depthQuality
    char __padding28[0x3] = {};
    // [TooltipAttribute] Offset: 0x71A8C8
    // public OVRManager/DepthQuality depthQuality
    // Size: 0x4
    // Offset: 0xB0
    ::GlobalNamespace::OVRManager_DepthQuality depthQuality;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_DepthQuality) == 0x4);
    // [TooltipAttribute] Offset: 0x71A914
    // public System.Single dynamicLightingSmoothFactor
    // Size: 0x4
    // Offset: 0xB4
    float dynamicLightingSmoothFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71A960
    // public System.Single dynamicLightingDepthVariationClampingValue
    // Size: 0x4
    // Offset: 0xB8
    float dynamicLightingDepthVariationClampingValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71A9AC
    // public OVRManager/VirtualGreenScreenType virtualGreenScreenType
    // Size: 0x4
    // Offset: 0xBC
    ::GlobalNamespace::OVRManager_VirtualGreenScreenType virtualGreenScreenType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_VirtualGreenScreenType) == 0x4);
    // [TooltipAttribute] Offset: 0x71A9F8
    // public System.Single virtualGreenScreenTopY
    // Size: 0x4
    // Offset: 0xC0
    float virtualGreenScreenTopY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71AA44
    // public System.Single virtualGreenScreenBottomY
    // Size: 0x4
    // Offset: 0xC4
    float virtualGreenScreenBottomY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71AA90
    // public System.Boolean virtualGreenScreenApplyDepthCulling
    // Size: 0x1
    // Offset: 0xC8
    bool virtualGreenScreenApplyDepthCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: virtualGreenScreenApplyDepthCulling and: virtualGreenScreenDepthTolerance
    char __padding35[0x3] = {};
    // [TooltipAttribute] Offset: 0x71AADC
    // public System.Single virtualGreenScreenDepthTolerance
    // Size: 0x4
    // Offset: 0xCC
    float virtualGreenScreenDepthTolerance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x71AB28
    // public OVRManager/MrcActivationMode mrcActivationMode
    // Size: 0x4
    // Offset: 0xD0
    ::GlobalNamespace::OVRManager_MrcActivationMode mrcActivationMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_MrcActivationMode) == 0x4);
    // [HeaderAttribute] Offset: 0x71AB74
    // [TooltipAttribute] Offset: 0x71AB74
    // private OVRManager/TrackingOrigin _trackingOriginType
    // Size: 0x4
    // Offset: 0xD4
    ::GlobalNamespace::OVRManager_TrackingOrigin trackingOriginType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_TrackingOrigin) == 0x4);
    // [TooltipAttribute] Offset: 0x71ABE4
    // public System.Boolean usePositionTracking
    // Size: 0x1
    // Offset: 0xD8
    bool usePositionTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean useRotationTracking
    // Size: 0x1
    // Offset: 0xD9
    bool useRotationTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x71AC2C
    // public System.Boolean useIPDInPositionTracking
    // Size: 0x1
    // Offset: 0xDA
    bool useIPDInPositionTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x71AC64
    // public System.Boolean resetTrackerOnLoad
    // Size: 0x1
    // Offset: 0xDB
    bool resetTrackerOnLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x71AC9C
    // public System.Boolean AllowRecenter
    // Size: 0x1
    // Offset: 0xDC
    bool AllowRecenter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x71ACD4
    // public System.Boolean LateControllerUpdate
    // Size: 0x1
    // Offset: 0xDD
    bool LateControllerUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isSupportedPlatform>k__BackingField
    // Size: 0x1
    // Offset: 0xDE
    bool isSupportedPlatform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean suppressDisableMixedRealityBecauseOfNoMainCameraWarning
    // Size: 0x1
    // Offset: 0xDF
    bool suppressDisableMixedRealityBecauseOfNoMainCameraWarning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean multipleMainCameraWarningPresented
    // Size: 0x1
    // Offset: 0xE0
    bool multipleMainCameraWarningPresented;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: multipleMainCameraWarningPresented and: lastFoundMainCamera
    char __padding47[0x7] = {};
    // private UnityEngine.Camera lastFoundMainCamera
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Camera* lastFoundMainCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private OVRManager <instance>k__BackingField
    static ::GlobalNamespace::OVRManager* _get_$instance$k__BackingField();
    // Set static field: static private OVRManager <instance>k__BackingField
    static void _set_$instance$k__BackingField(::GlobalNamespace::OVRManager* value);
    // Get static field: static private OVRDisplay <display>k__BackingField
    static ::GlobalNamespace::OVRDisplay* _get_$display$k__BackingField();
    // Set static field: static private OVRDisplay <display>k__BackingField
    static void _set_$display$k__BackingField(::GlobalNamespace::OVRDisplay* value);
    // Get static field: static private OVRTracker <tracker>k__BackingField
