// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SmoothTurn
  class SmoothTurn;
  // Forward declaring type: BrickPickerManager
  class BrickPickerManager;
  // Forward declaring type: JoystickLocomotion
  class JoystickLocomotion;
  // Forward declaring type: HandBrickSpawner
  class HandBrickSpawner;
  // Forward declaring type: ControllerButtonInput
  class ControllerButtonInput;
  // Forward declaring type: PalletteBrickCollider
  class PalletteBrickCollider;
  // Forward declaring type: MovementVignette
  class MovementVignette;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: Realtime
  class Realtime;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: SnapTurnProvider
  class SnapTurnProvider;
  // Forward declaring type: XRRig
  class XRRig;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: TutorialManager
  class TutorialManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::TutorialManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::TutorialManager*, "", "TutorialManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x188
  #pragma pack(push, 1)
  // Autogenerated type: TutorialManager
  // [TokenAttribute] Offset: FFFFFFFF
  class TutorialManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::TutorialManager::$StartTutorialIEnum$d__59
    class $StartTutorialIEnum$d__59;
    // Nested type: ::GlobalNamespace::TutorialManager::$ConnectToNormcore$d__61
    class $ConnectToNormcore$d__61;
    // Nested type: ::GlobalNamespace::TutorialManager::$AnimateBetweenTextObjectsWithCross$d__67
    class $AnimateBetweenTextObjectsWithCross$d__67;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveToSecondStep$d__69
    class $MoveToSecondStep$d__69;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveToThirdStep$d__71
    class $MoveToThirdStep$d__71;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveToFourthStep$d__73
    class $MoveToFourthStep$d__73;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveToFifthStep$d__75
    class $MoveToFifthStep$d__75;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveToSixthStep$d__77
    class $MoveToSixthStep$d__77;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveToSeventhStep$d__79
    class $MoveToSeventhStep$d__79;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveFromSeventhToSeventhAndAHalfthStep$d__81
    class $MoveFromSeventhToSeventhAndAHalfthStep$d__81;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveFromSeventhAndAHalfthToEighthStep$d__83
    class $MoveFromSeventhAndAHalfthToEighthStep$d__83;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveFromEighthToNinthStep$d__85
    class $MoveFromEighthToNinthStep$d__85;
    // Nested type: ::GlobalNamespace::TutorialManager::$MoveToLastStep$d__87
    class $MoveToLastStep$d__87;
    public:
    // public UnityEngine.GameObject playerControllers
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* playerControllers;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject infoBoard
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* infoBoard;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject tutorialEnvContents
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* tutorialEnvContents;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public Normal.Realtime.Realtime realtime
    // Size: 0x8
    // Offset: 0x30
    ::Normal::Realtime::Realtime* realtime;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Realtime*) == 0x8);
    // public UnityEngine.XR.Interaction.Toolkit.SnapTurnProvider snapTurnProvider
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::XR::Interaction::Toolkit::SnapTurnProvider* snapTurnProvider;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::SnapTurnProvider*) == 0x8);
    // public SmoothTurn smoothTurn
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::SmoothTurn* smoothTurn;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SmoothTurn*) == 0x8);
    // public BrickPickerManager brickPickerManager
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::BrickPickerManager* brickPickerManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BrickPickerManager*) == 0x8);
    // public UnityEngine.AudioSource ambientMusic
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::AudioSource* ambientMusic;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private System.Single _ambientMusicMaxVolume
    // Size: 0x4
    // Offset: 0x58
    float ambientMusicMaxVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: ambientMusicMaxVolume and: joystickLocomotion
    char __padding8[0x4] = {};
    // public JoystickLocomotion joystickLocomotion
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::JoystickLocomotion* joystickLocomotion;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::JoystickLocomotion*) == 0x8);
    // public UnityEngine.Renderer loadingObjectRenderer
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Renderer* loadingObjectRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // public HandBrickSpawner leftHandBrickSpawner
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::HandBrickSpawner* leftHandBrickSpawner;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HandBrickSpawner*) == 0x8);
    // public HandBrickSpawner rightHandBrickSpawner
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::HandBrickSpawner* rightHandBrickSpawner;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HandBrickSpawner*) == 0x8);
    // public UnityEngine.GameObject menuLeftHand
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* menuLeftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject menuRightHand
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* menuRightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject teleporterLeftHand
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* teleporterLeftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject teleporterRightHand
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* teleporterRightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public ControllerButtonInput buttonInput
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::ControllerButtonInput* buttonInput;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ControllerButtonInput*) == 0x8);
    // public UnityEngine.AudioSource canvasAudioSource
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::AudioSource* canvasAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.XR.Interaction.Toolkit.XRRig xrRig
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::XR::Interaction::Toolkit::XRRig* xrRig;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRig*) == 0x8);
    // public PalletteBrickCollider palletteBrickCollider
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::PalletteBrickCollider* palletteBrickCollider;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PalletteBrickCollider*) == 0x8);
    // public UnityEngine.UI.Button roomMenuButton
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::UI::Button* roomMenuButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.GameObject firstBrick
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* firstBrick;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject secondBrick
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::GameObject* secondBrick;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [HeaderAttribute] Offset: 0x103480
    // public UnityEngine.GameObject tutorialSpawnPoint
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* tutorialSpawnPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject firstBrickSpawnPoint
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::GameObject* firstBrickSpawnPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject secondBrickSpawnPoint
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::GameObject* secondBrickSpawnPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [HeaderAttribute] Offset: 0x1034F0
    // public TMPro.TextMeshProUGUI firstTextBox
    // Size: 0x8
    // Offset: 0xF0
    ::TMPro::TextMeshProUGUI* firstTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI secondTextBox
    // Size: 0x8
    // Offset: 0xF8
    ::TMPro::TextMeshProUGUI* secondTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI thirdTextBox
    // Size: 0x8
    // Offset: 0x100
    ::TMPro::TextMeshProUGUI* thirdTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI fourthTextBox
    // Size: 0x8
    // Offset: 0x108
    ::TMPro::TextMeshProUGUI* fourthTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI fifthTextBox
    // Size: 0x8
    // Offset: 0x110
    ::TMPro::TextMeshProUGUI* fifthTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI sixthTextBox
    // Size: 0x8
    // Offset: 0x118
    ::TMPro::TextMeshProUGUI* sixthTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI seventhTextBox
    // Size: 0x8
    // Offset: 0x120
    ::TMPro::TextMeshProUGUI* seventhTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI seventhAndAHalfthTextBox
    // Size: 0x8
    // Offset: 0x128
    ::TMPro::TextMeshProUGUI* seventhAndAHalfthTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI eighthTextBox
    // Size: 0x8
    // Offset: 0x130
    ::TMPro::TextMeshProUGUI* eighthTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI ninthTextBox
    // Size: 0x8
    // Offset: 0x138
    ::TMPro::TextMeshProUGUI* ninthTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // public TMPro.TextMeshProUGUI lastTextBox
    // Size: 0x8
    // Offset: 0x140
    ::TMPro::TextMeshProUGUI* lastTextBox;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // private System.Boolean _startedTutorial
    // Size: 0x1
    // Offset: 0x148
    bool startedTutorial;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _advancing
    // Size: 0x1
    // Offset: 0x149
    bool advancing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _connectedToNormcore
    // Size: 0x1
    // Offset: 0x14A
    bool connectedToNormcore;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _didConnectToRoom
    // Size: 0x1
    // Offset: 0x14B
    bool didConnectToRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _didDisconnectFromRoom
    // Size: 0x1
    // Offset: 0x14C
    bool didDisconnectFromRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: didDisconnectFromRoom and: initialLateralMovementIndex
    char __padding42[0x3] = {};
    // private System.Int32 _initialLateralMovementIndex
    // Size: 0x4
    // Offset: 0x150
    int initialLateralMovementIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _initialVerticalMovementIndex
    // Size: 0x4
    // Offset: 0x154
    int initialVerticalMovementIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _initialSnapTurnIndex
    // Size: 0x4
    // Offset: 0x158
    int initialSnapTurnIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _initialBrickMenuIndex
    // Size: 0x4
    // Offset: 0x15C
    int initialBrickMenuIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _numberOfBricks
    // Size: 0x4
    // Offset: 0x160
    int numberOfBricks;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _initialHandBrickSpawnerIndex
    // Size: 0x4
    // Offset: 0x164
    int initialHandBrickSpawnerIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _initialPalletteBrickColliderIndex
    // Size: 0x4
    // Offset: 0x168
    int initialPalletteBrickColliderIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: initialPalletteBrickColliderIndex and: startTutorialCoroutine
    char __padding49[0x4] = {};
    // private UnityEngine.Coroutine _startTutorialCoroutine
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::Coroutine* startTutorialCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Action _updateAction
    // Size: 0x8
    // Offset: 0x178
    ::System::Action* updateAction;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public MovementVignette movementVignette
    // Size: 0x8
    // Offset: 0x180
    ::GlobalNamespace::MovementVignette* movementVignette;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MovementVignette*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private TutorialManager _instance
    static ::GlobalNamespace::TutorialManager* _get__instance();
    // Set static field: static private TutorialManager _instance
    static void _set__instance(::GlobalNamespace::TutorialManager* value);
    // Get instance field reference: public UnityEngine.GameObject playerControllers
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_playerControllers();
    // Get instance field reference: public UnityEngine.GameObject infoBoard
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_infoBoard();
