// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: UserSettings
  class UserSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::UserSettings);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::UserSettings*, "", "UserSettings");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: UserSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class UserSettings : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::UserSettings::SerializableBoolEvent
    class SerializableBoolEvent;
    // Nested type: ::GlobalNamespace::UserSettings::SerializableFloatEvent
    class SerializableFloatEvent;
    // Nested type: ::GlobalNamespace::UserSettings::SerializableStringEvent
    class SerializableStringEvent;
    // Nested type: ::GlobalNamespace::UserSettings::SerializableIntEvent
    class SerializableIntEvent;
    public:
    // public UserSettings/SerializableBoolEvent TeleportTriggerEnabledUpdated
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::UserSettings::SerializableBoolEvent* TeleportTriggerEnabledUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableBoolEvent*) == 0x8);
    // public UserSettings/SerializableBoolEvent MicrophoneEnabledUpdated
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::UserSettings::SerializableBoolEvent* MicrophoneEnabledUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableBoolEvent*) == 0x8);
    // public UserSettings/SerializableBoolEvent OtherPlayersMicrophonesEnabledUpdated
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::UserSettings::SerializableBoolEvent* OtherPlayersMicrophonesEnabledUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableBoolEvent*) == 0x8);
    // public UserSettings/SerializableBoolEvent PerformanceModeEnabledUpdated
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::UserSettings::SerializableBoolEvent* PerformanceModeEnabledUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableBoolEvent*) == 0x8);
    // public UserSettings/SerializableBoolEvent PlayMusicEnabledUpdated
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::UserSettings::SerializableBoolEvent* PlayMusicEnabledUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableBoolEvent*) == 0x8);
    // public UserSettings/SerializableBoolEvent SmoothRotationEnabledUpdated
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::UserSettings::SerializableBoolEvent* SmoothRotationEnabledUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableBoolEvent*) == 0x8);
    // public UserSettings/SerializableBoolEvent BrickClickSoundsEnabledUpdated
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::UserSettings::SerializableBoolEvent* BrickClickSoundsEnabledUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableBoolEvent*) == 0x8);
    // public UserSettings/SerializableBoolEvent PushToTalkEnabledUpdated
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::UserSettings::SerializableBoolEvent* PushToTalkEnabledUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableBoolEvent*) == 0x8);
    // public UserSettings/SerializableFloatEvent MusicVolumeUpdated
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::UserSettings::SerializableFloatEvent* MusicVolumeUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableFloatEvent*) == 0x8);
    // public UserSettings/SerializableFloatEvent MovementSpeedUpdated
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::UserSettings::SerializableFloatEvent* MovementSpeedUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableFloatEvent*) == 0x8);
    // public UserSettings/SerializableFloatEvent RotationSpeedUpdated
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::UserSettings::SerializableFloatEvent* RotationSpeedUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableFloatEvent*) == 0x8);
    // public UserSettings/SerializableFloatEvent VignetteStrengthUpdated
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::UserSettings::SerializableFloatEvent* VignetteStrengthUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableFloatEvent*) == 0x8);
    // public UserSettings/SerializableIntEvent RenderDistanceUpdated
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::UserSettings::SerializableIntEvent* RenderDistanceUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableIntEvent*) == 0x8);
    // public UserSettings/SerializableIntEvent PlayerScaleUpdated
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::UserSettings::SerializableIntEvent* PlayerScaleUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableIntEvent*) == 0x8);
    // public UserSettings/SerializableIntEvent PrimaryAvatarColorUpdated
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::UserSettings::SerializableIntEvent* PrimaryAvatarColorUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableIntEvent*) == 0x8);
    // public UserSettings/SerializableIntEvent SecondaryAvatarColorUpdated
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::UserSettings::SerializableIntEvent* SecondaryAvatarColorUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableIntEvent*) == 0x8);
    // public UserSettings/SerializableIntEvent AvatarMouthUpdated
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::UserSettings::SerializableIntEvent* AvatarMouthUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableIntEvent*) == 0x8);
    // public UserSettings/SerializableIntEvent AvatarEyesUpdated
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::UserSettings::SerializableIntEvent* AvatarEyesUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableIntEvent*) == 0x8);
    // public UserSettings/SerializableIntEvent BrickShininessUpdated
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::UserSettings::SerializableIntEvent* BrickShininessUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableIntEvent*) == 0x8);
    // public UserSettings/SerializableStringEvent NicknameUpdated
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::UserSettings::SerializableStringEvent* NicknameUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UserSettings::SerializableStringEvent*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private UserSettings _instance
    static ::GlobalNamespace::UserSettings* _get__instance();
    // Set static field: static private UserSettings _instance
    static void _set__instance(::GlobalNamespace::UserSettings* value);
    // static field const value: static private System.String TeleportTriggersKey
    static constexpr const char* TeleportTriggersKey = "teleport_triggers";
    // Get static field: static private System.String TeleportTriggersKey
    static ::StringW _get_TeleportTriggersKey();
    // Set static field: static private System.String TeleportTriggersKey
