// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRController
  class XRController;
  // Skipping declaration: XRBaseInteractable because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseControllerInteractor
  class XRBaseControllerInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor*, "UnityEngine.XR.Interaction.Toolkit", "XRBaseControllerInteractor");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0xF8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 7244F0
  class XRBaseControllerInteractor : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean m_ToggleSelect
    // Size: 0x1
    // Offset: 0x74
    bool m_ToggleSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HideControllerOnSelect
    // Size: 0x1
    // Offset: 0x75
    bool m_HideControllerOnSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_PlayAudioClipOnSelectEnter
    // Size: 0x1
    // Offset: 0x76
    bool m_PlayAudioClipOnSelectEnter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnSelectEnter and: m_AudioClipForOnSelectEnter
    char __padding2[0x1] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnSelectEnter
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::AudioClip* m_AudioClipForOnSelectEnter;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayAudioClipOnSelectExit
    // Size: 0x1
    // Offset: 0x80
    bool m_PlayAudioClipOnSelectExit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnSelectExit and: m_AudioClipForOnSelectExit
    char __padding4[0x7] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnSelectExit
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::AudioClip* m_AudioClipForOnSelectExit;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayAudioClipOnHoverEnter
    // Size: 0x1
    // Offset: 0x90
    bool m_PlayAudioClipOnHoverEnter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnHoverEnter and: m_AudioClipForOnHoverEnter
    char __padding6[0x7] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnHoverEnter
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::AudioClip* m_AudioClipForOnHoverEnter;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayAudioClipOnHoverExit
    // Size: 0x1
    // Offset: 0xA0
    bool m_PlayAudioClipOnHoverExit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnHoverExit and: m_AudioClipForOnHoverExit
    char __padding8[0x7] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnHoverExit
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::AudioClip* m_AudioClipForOnHoverExit;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayHapticsOnSelectEnter
    // Size: 0x1
    // Offset: 0xB0
    bool m_PlayHapticsOnSelectEnter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnSelectEnter and: m_HapticSelectEnterIntensity
    char __padding10[0x3] = {};
    // private System.Single m_HapticSelectEnterIntensity
    // Size: 0x4
    // Offset: 0xB4
    float m_HapticSelectEnterIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticSelectEnterDuration
    // Size: 0x4
    // Offset: 0xB8
    float m_HapticSelectEnterDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PlayHapticsOnSelectExit
    // Size: 0x1
    // Offset: 0xBC
    bool m_PlayHapticsOnSelectExit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnSelectExit and: m_HapticSelectExitIntensity
    char __padding13[0x3] = {};
    // private System.Single m_HapticSelectExitIntensity
    // Size: 0x4
    // Offset: 0xC0
    float m_HapticSelectExitIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticSelectExitDuration
    // Size: 0x4
    // Offset: 0xC4
    float m_HapticSelectExitDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PlayHapticsOnHoverEnter
    // Size: 0x1
    // Offset: 0xC8
    bool m_PlayHapticsOnHoverEnter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnHoverEnter and: m_HapticHoverEnterIntensity
    char __padding16[0x3] = {};
    // private System.Single m_HapticHoverEnterIntensity
    // Size: 0x4
    // Offset: 0xCC
    float m_HapticHoverEnterIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticHoverEnterDuration
    // Size: 0x4
    // Offset: 0xD0
    float m_HapticHoverEnterDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PlayHapticsOnHoverExit
    // Size: 0x1
    // Offset: 0xD4
    bool m_PlayHapticsOnHoverExit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnHoverExit and: m_HapticHoverExitIntensity
    char __padding19[0x3] = {};
    // private System.Single m_HapticHoverExitIntensity
    // Size: 0x4
    // Offset: 0xD8
    float m_HapticHoverExitIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticHoverExitDuration
    // Size: 0x4
    // Offset: 0xDC
    float m_HapticHoverExitDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ToggleSelectActive
    // Size: 0x1
    // Offset: 0xE0
    bool m_ToggleSelectActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ToggleSelectActive and: m_Controller
    char __padding22[0x7] = {};
    // private UnityEngine.XR.Interaction.Toolkit.XRController m_Controller
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::XR::Interaction::Toolkit::XRController* m_Controller;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRController*) == 0x8);
    // private UnityEngine.AudioSource m_EffectsAudioSource
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::AudioSource* m_EffectsAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    public:
    // Get instance field reference: private System.Boolean m_ToggleSelect
    bool& dyn_m_ToggleSelect();
    // Get instance field reference: private System.Boolean m_HideControllerOnSelect
    bool& dyn_m_HideControllerOnSelect();
    // Get instance field reference: private System.Boolean m_PlayAudioClipOnSelectEnter
    bool& dyn_m_PlayAudioClipOnSelectEnter();
    // Get instance field reference: private UnityEngine.AudioClip m_AudioClipForOnSelectEnter
    ::UnityEngine::AudioClip*& dyn_m_AudioClipForOnSelectEnter();
    // Get instance field reference: private System.Boolean m_PlayAudioClipOnSelectExit
    bool& dyn_m_PlayAudioClipOnSelectExit();
    // Get instance field reference: private UnityEngine.AudioClip m_AudioClipForOnSelectExit
    ::UnityEngine::AudioClip*& dyn_m_AudioClipForOnSelectExit();
