// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.XR.XRNode
#include "UnityEngine/XR/XRNode.hpp"
// Including type: UnityEngine.XR.InputDevice
#include "UnityEngine/XR/InputDevice.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Skipping declaration: UpdateType because it is already included!
  // Skipping declaration: InputAxes because it is already included!
  // Skipping declaration: InteractionState because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRController
  class XRController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRController*, "UnityEngine.XR.Interaction.Toolkit", "XRController");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x91
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRController
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: CB9C0
  class XRController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes
    struct InputAxes;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType
    struct UpdateType;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRController::InteractionState
    struct InteractionState;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRController::InteractionTypes
    struct InteractionTypes;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputAxes/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputAxes
      constexpr InputAxes(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Primary2DAxis
      static constexpr const int Primary2DAxis = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Primary2DAxis
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes _get_Primary2DAxis();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Primary2DAxis
      static void _set_Primary2DAxis(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes DPad
      static constexpr const int DPad = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes DPad
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes _get_DPad();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes DPad
      static void _set_DPad(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Trigger
      static constexpr const int Trigger = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Trigger
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes _get_Trigger();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Trigger
      static void _set_Trigger(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Grip
      static constexpr const int Grip = 3;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Grip
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes _get_Grip();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Grip
      static void _set_Grip(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes IndexTouch
      static constexpr const int IndexTouch = 4;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes IndexTouch
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes _get_IndexTouch();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes IndexTouch
      static void _set_IndexTouch(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes ThumbTouch
      static constexpr const int ThumbTouch = 5;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes ThumbTouch
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes _get_ThumbTouch();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes ThumbTouch
      static void _set_ThumbTouch(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Secondary2DAxis
      static constexpr const int Secondary2DAxis = 6;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Secondary2DAxis
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes _get_Secondary2DAxis();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes Secondary2DAxis
      static void _set_Secondary2DAxis(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes
    #pragma pack(pop)
    static check_size<sizeof(XRController::InputAxes), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRController_InputAxesSizeCheck;
    static_assert(sizeof(XRController::InputAxes) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateType
      constexpr UpdateType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType UpdateAndBeforeRender
      static constexpr const int UpdateAndBeforeRender = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType UpdateAndBeforeRender
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType _get_UpdateAndBeforeRender();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType UpdateAndBeforeRender
      static void _set_UpdateAndBeforeRender(::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType Update
      static constexpr const int Update = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType Update
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType _get_Update();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType Update
      static void _set_Update(::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType BeforeRender
      static constexpr const int BeforeRender = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType BeforeRender
      static ::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType _get_BeforeRender();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType BeforeRender
      static void _set_BeforeRender(::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType
    #pragma pack(pop)
    static check_size<sizeof(XRController::UpdateType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRController_UpdateTypeSizeCheck;
    static_assert(sizeof(XRController::UpdateType) == 0x4);
    // Size: 0x3
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InteractionState
    // [TokenAttribute] Offset: FFFFFFFF
    struct InteractionState/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean active
      // Size: 0x1
      // Offset: 0x0
      bool active;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean activatedThisFrame
      // Size: 0x1
      // Offset: 0x1
      bool activatedThisFrame;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean deActivatedThisFrame
      // Size: 0x1
      // Offset: 0x2
      bool deActivatedThisFrame;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: InteractionState
      constexpr InteractionState(bool active_ = {}, bool activatedThisFrame_ = {}, bool deActivatedThisFrame_ = {}) noexcept : active{active_}, activatedThisFrame{activatedThisFrame_}, deActivatedThisFrame{deActivatedThisFrame_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean active
      [[deprecated("Use field access instead!")]] bool& dyn_active();
      // Get instance field reference: public System.Boolean activatedThisFrame
      [[deprecated("Use field access instead!")]] bool& dyn_activatedThisFrame();
      // Get instance field reference: public System.Boolean deActivatedThisFrame
      [[deprecated("Use field access instead!")]] bool& dyn_deActivatedThisFrame();
    }; // UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InteractionState
    #pragma pack(pop)
    static check_size<sizeof(XRController::InteractionState), 2 + sizeof(bool)> __UnityEngine_XR_Interaction_Toolkit_XRController_InteractionStateSizeCheck;
    static_assert(sizeof(XRController::InteractionState) == 0x3);
    public:
    // [HeaderAttribute] Offset: 0xCBA80
    // [TooltipAttribute] Offset: 0xCBA80
    // private UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType m_UpdateTrackingType
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType m_UpdateTrackingType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType) == 0x4);
    // private System.Boolean m_EnableInputTracking
    // Size: 0x1
    // Offset: 0x1C
    bool m_EnableInputTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HeaderAttribute] Offset: 0xCBB90
    // [TooltipAttribute] Offset: 0xCBB90
    // private System.Boolean m_EnableInputActions
    // Size: 0x1
    // Offset: 0x1D
    bool m_EnableInputActions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_EnableInputActions and: m_ControllerNode
    char __padding2[0x2] = {};
    // [TooltipAttribute] Offset: 0xCBC30
    // private UnityEngine.XR.XRNode m_ControllerNode
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::XR::XRNode m_ControllerNode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::XRNode) == 0x4);
    // [TooltipAttribute] Offset: 0xCBCA0
    // private UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes m_SelectUsage
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes m_SelectUsage;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes) == 0x4);
    // [TooltipAttribute] Offset: 0xCBDA0
    // private UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes m_ActivateUsage
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes m_ActivateUsage;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes) == 0x4);
    // [TooltipAttribute] Offset: 0xCBEC0
    // private UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InputAxes m_UIPressUsage
    // Size: 0x4
    // Offset: 0x2C
    ::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes m_UIPressUsage;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRController::InputAxes) == 0x4);
    // [TooltipAttribute] Offset: 0xCBF80
    // private System.Single m_AxisToPressThreshold
    // Size: 0x4
    // Offset: 0x30
    float m_AxisToPressThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_AxisToPressThreshold and: m_ModelPrefab
    char __padding7[0x4] = {};
    // [HeaderAttribute] Offset: 0xCC090
    // [TooltipAttribute] Offset: 0xCC090
    // private UnityEngine.Transform m_ModelPrefab
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* m_ModelPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xCC2A0
    // private UnityEngine.Transform m_ModelTransform
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* m_ModelTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xCC370
    // private System.Boolean m_AnimateModel
    // Size: 0x1
    // Offset: 0x48
    bool m_AnimateModel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AnimateModel and: m_ModelSelectTransition
    char __padding10[0x7] = {};
    // [TooltipAttribute] Offset: 0xCC490
    // private System.String m_ModelSelectTransition
    // Size: 0x8
    // Offset: 0x50
    ::StringW m_ModelSelectTransition;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [TooltipAttribute] Offset: 0xCC540
    // private System.String m_ModelDeSelectTransition
    // Size: 0x8
    // Offset: 0x58
    ::StringW m_ModelDeSelectTransition;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InteractionState m_SelectInteractionState
    // Size: 0x3
    // Offset: 0x60
    ::UnityEngine::XR::Interaction::Toolkit::XRController::InteractionState m_SelectInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRController::InteractionState) == 0x3);
    // private UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InteractionState m_ActivateInteractionState
    // Size: 0x3
    // Offset: 0x63
    ::UnityEngine::XR::Interaction::Toolkit::XRController::InteractionState m_ActivateInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRController::InteractionState) == 0x3);
    // private UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.InteractionState m_UIPressInteractionState
    // Size: 0x3
    // Offset: 0x66
    ::UnityEngine::XR::Interaction::Toolkit::XRController::InteractionState m_UIPressInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRController::InteractionState) == 0x3);
    // Padding between fields: m_UIPressInteractionState and: m_InputDevice
    char __padding15[0x7] = {};
    // private UnityEngine.XR.InputDevice m_InputDevice
    // Size: 0x9
    // Offset: 0x70
    ::UnityEngine::XR::InputDevice m_InputDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    // Padding between fields: m_InputDevice and: m_PerformSetup
    char __padding16[0x7] = {};
    // private System.Boolean m_PerformSetup
    // Size: 0x1
    // Offset: 0x80
    bool m_PerformSetup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PerformSetup and: m_ModelGO
    char __padding17[0x7] = {};
    // private UnityEngine.GameObject m_ModelGO
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* m_ModelGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean m_HideControllerModel
    // Size: 0x1
    // Offset: 0x90
    bool m_HideControllerModel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private System.String[] s_InputAxisNames
    static ::ArrayW<::StringW> _get_s_InputAxisNames();
    // Set static field: static private System.String[] s_InputAxisNames
    static void _set_s_InputAxisNames(::ArrayW<::StringW> value);
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.XRController/UnityEngine.XR.Interaction.Toolkit.UpdateType m_UpdateTrackingType
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::XRController::UpdateType& dyn_m_UpdateTrackingType();
    // Get instance field reference: private System.Boolean m_EnableInputTracking
    [[deprecated("Use field access instead!")]] bool& dyn_m_EnableInputTracking();
