// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractable.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/UnityEngine.XR.Interaction.Toolkit.MovementType
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractable_MovementType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseInteractor
  class XRBaseInteractor;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRGrabInteractable
  class XRGrabInteractable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable*, "UnityEngine.XR.Interaction.Toolkit", "XRGrabInteractable");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x184
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable
  // [TokenAttribute] Offset: FFFFFFFF
  // [SelectionBaseAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [RequireComponent] Offset: 7242A8
  // [AddComponentMenu] Offset: 7242A8
  class XRGrabInteractable : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private UnityEngine.Transform m_AttachTransform
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Transform* m_AttachTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single m_AttachEaseInTime
    // Size: 0x4
    // Offset: 0xA0
    float m_AttachEaseInTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/UnityEngine.XR.Interaction.Toolkit.MovementType m_MovementType
    // Size: 0x4
    // Offset: 0xA4
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType m_MovementType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType) == 0x4);
    // private System.Boolean m_TrackPosition
    // Size: 0x1
    // Offset: 0xA8
    bool m_TrackPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SmoothPosition
    // Size: 0x1
    // Offset: 0xA9
    bool m_SmoothPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SmoothPosition and: m_SmoothPositionAmount
    char __padding4[0x2] = {};
    // [RangeAttribute] Offset: 0x725214
    // private System.Single m_SmoothPositionAmount
    // Size: 0x4
    // Offset: 0xAC
    float m_SmoothPositionAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x725254
    // private System.Single m_TightenPosition
    // Size: 0x4
    // Offset: 0xB0
    float m_TightenPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_TrackRotation
    // Size: 0x1
    // Offset: 0xB4
    bool m_TrackRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SmoothRotation
    // Size: 0x1
    // Offset: 0xB5
    bool m_SmoothRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SmoothRotation and: m_SmoothRotationAmount
    char __padding8[0x2] = {};
    // [RangeAttribute] Offset: 0x7252B4
    // private System.Single m_SmoothRotationAmount
    // Size: 0x4
    // Offset: 0xB8
    float m_SmoothRotationAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x7252F4
    // private System.Single m_TightenRotation
    // Size: 0x4
    // Offset: 0xBC
    float m_TightenRotation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ThrowOnDetach
    // Size: 0x1
    // Offset: 0xC0
    bool m_ThrowOnDetach;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ThrowOnDetach and: m_ThrowSmoothingDuration
    char __padding11[0x3] = {};
    // private System.Single m_ThrowSmoothingDuration
    // Size: 0x4
    // Offset: 0xC4
    float m_ThrowSmoothingDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x725354
    // private UnityEngine.AnimationCurve m_ThrowSmoothingCurve
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::AnimationCurve* m_ThrowSmoothingCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single m_ThrowVelocityScale
    // Size: 0x4
    // Offset: 0xD0
    float m_ThrowVelocityScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ThrowAngularVelocityScale
    // Size: 0x4
    // Offset: 0xD4
    float m_ThrowAngularVelocityScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_GravityOnDetach
    // Size: 0x1
    // Offset: 0xD8
    bool m_GravityOnDetach;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_WasKinematic
    // Size: 0x1
    // Offset: 0xD9
    bool m_WasKinematic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UsedGravity
    // Size: 0x1
    // Offset: 0xDA
    bool m_UsedGravity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UsedGravity and: m_SelectingInteractor
    char __padding18[0x5] = {};
    // public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor m_SelectingInteractor
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor* m_SelectingInteractor;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*) == 0x8);
    // private UnityEngine.Vector3 m_InteractorLocalPosition
    // Size: 0xC
    // Offset: 0xE8
    ::UnityEngine::Vector3 m_InteractorLocalPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_InteractorLocalRotation
    // Size: 0x10
    // Offset: 0xF4
    ::UnityEngine::Quaternion m_InteractorLocalRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 m_TargetWorldPosition
    // Size: 0xC
    // Offset: 0x104
    ::UnityEngine::Vector3 m_TargetWorldPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_TargetWorldRotation
    // Size: 0x10
    // Offset: 0x110
    ::UnityEngine::Quaternion m_TargetWorldRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single m_CurrentAttachEaseTime
    // Size: 0x4
    // Offset: 0x120
    float m_CurrentAttachEaseTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/UnityEngine.XR.Interaction.Toolkit.MovementType m_CurrentMovementType
    // Size: 0x4
    // Offset: 0x124
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType m_CurrentMovementType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType) == 0x4);
    // private System.Boolean m_DetachInLateUpdate
    // Size: 0x1
    // Offset: 0x128
    bool m_DetachInLateUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DetachInLateUpdate and: m_DetachVelocity
    char __padding26[0x3] = {};
    // private UnityEngine.Vector3 m_DetachVelocity
    // Size: 0xC
    // Offset: 0x12C
    ::UnityEngine::Vector3 m_DetachVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_DetachAngularVelocity
    // Size: 0xC
    // Offset: 0x138
    ::UnityEngine::Vector3 m_DetachAngularVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Int32 m_ThrowSmoothingCurrentFrame
    // Size: 0x4
    // Offset: 0x144
    int m_ThrowSmoothingCurrentFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single[] m_ThrowSmoothingFrameTimes
    // Size: 0x8
    // Offset: 0x148
    ::ArrayW<float> m_ThrowSmoothingFrameTimes;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private UnityEngine.Vector3[] m_ThrowSmoothingVelocityFrames
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::Vector3> m_ThrowSmoothingVelocityFrames;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3[] m_ThrowSmoothingAngularVelocityFrames
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<::UnityEngine::Vector3> m_ThrowSmoothingAngularVelocityFrames;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Rigidbody m_RigidBody
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::Rigidbody* m_RigidBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Vector3 m_LastPosition
    // Size: 0xC
    // Offset: 0x168
    ::UnityEngine::Vector3 m_LastPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_LastRotation
    // Size: 0x10
    // Offset: 0x174
    ::UnityEngine::Quaternion m_LastRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    public:
    // static field const value: static private System.Single k_DefaultTighteningAmount
    static constexpr const float k_DefaultTighteningAmount = 0.5;
    // Get static field: static private System.Single k_DefaultTighteningAmount
    static float _get_k_DefaultTighteningAmount();
    // Set static field: static private System.Single k_DefaultTighteningAmount
    static void _set_k_DefaultTighteningAmount(float value);
    // static field const value: static private System.Single k_DefaultSmoothingAmount
    static constexpr const float k_DefaultSmoothingAmount = 5;
    // Get static field: static private System.Single k_DefaultSmoothingAmount
    static float _get_k_DefaultSmoothingAmount();
    // Set static field: static private System.Single k_DefaultSmoothingAmount
