// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Skipping declaration: XRBaseInteractable because it is already included!
  // Forward declaring type: XRGrabInteractable
  class XRGrabInteractable;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Comparison`1<T>
  template<typename T>
  class Comparison_1;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRSocketInteractor
  class XRSocketInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRSocketInteractor);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRSocketInteractor*, "UnityEngine.XR.Interaction.Toolkit", "XRSocketInteractor");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRSocketInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: D4020
  class XRSocketInteractor : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor {
    public:
    // Writing base type padding for base size: 0x74 to desired offset: 0x78
    char ___base_padding[0x4] = {};
    public:
    // [HeaderAttribute] Offset: 0xD40D0
    // private System.Boolean m_ShowInteractableHoverMeshes
    // Size: 0x1
    // Offset: 0x78
    bool m_ShowInteractableHoverMeshes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ShowInteractableHoverMeshes and: m_InteractableHoverMeshMaterial
    char __padding0[0x7] = {};
    // private UnityEngine.Material m_InteractableHoverMeshMaterial
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Material* m_InteractableHoverMeshMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Boolean m_SocketActive
    // Size: 0x1
    // Offset: 0x88
    bool m_SocketActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SocketActive and: m_InteractableHoverScale
    char __padding2[0x3] = {};
    // private System.Single m_InteractableHoverScale
    // Size: 0x4
    // Offset: 0x8C
    float m_InteractableHoverScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_RecycleDelayTime
    // Size: 0x4
    // Offset: 0x90
    float m_RecycleDelayTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_LastRemoveTime
    // Size: 0x4
    // Offset: 0x94
    float m_LastRemoveTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable> m_ValidTargets
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*>* m_ValidTargets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable,System.Single> m_InteractableDistanceSqrMap
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*, float>* m_InteractableDistanceSqrMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*, float>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable,UnityEngine.MeshFilter[]> m_MeshFilterCache
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*, ::ArrayW<::UnityEngine::MeshFilter*>>* m_MeshFilterCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*, ::ArrayW<::UnityEngine::MeshFilter*>>*) == 0x8);
    // private System.Comparison`1<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable> m_InteractableSortComparison
    // Size: 0x8
    // Offset: 0xB0
    ::System::Comparison_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*>* m_InteractableSortComparison;
    // Field size check
    static_assert(sizeof(::System::Comparison_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*>*) == 0x8);
    public:
    // Get instance field reference: private System.Boolean m_ShowInteractableHoverMeshes
    [[deprecated]] bool& dyn_m_ShowInteractableHoverMeshes();
    // Get instance field reference: private UnityEngine.Material m_InteractableHoverMeshMaterial
    [[deprecated]] ::UnityEngine::Material*& dyn_m_InteractableHoverMeshMaterial();
    // Get instance field reference: private System.Boolean m_SocketActive
    [[deprecated]] bool& dyn_m_SocketActive();
    // Get instance field reference: private System.Single m_InteractableHoverScale
    [[deprecated]] float& dyn_m_InteractableHoverScale();
    // Get instance field reference: private System.Single m_RecycleDelayTime
