// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.Result
#include "Steamworks/Result.hpp"
// Including type: Steamworks.AppId
#include "Steamworks/AppId.hpp"
// Including type: Steamworks.DurationControlProgress
#include "Steamworks/DurationControlProgress.hpp"
// Including type: Steamworks.DurationControlNotification
#include "Steamworks/DurationControlNotification.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: DurationControl_t
  struct DurationControl_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::DurationControl_t, "Steamworks.Data", "DurationControl_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x20
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.DurationControl_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct DurationControl_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // Steamworks.Result Result
    // Size: 0x4
    // Offset: 0x0
    ::Steamworks::Result Result;
    // Field size check
    static_assert(sizeof(::Steamworks::Result) == 0x4);
    // Steamworks.AppId Appid
    // Size: 0x4
    // Offset: 0x4
    ::Steamworks::AppId Appid;
    // Field size check
    static_assert(sizeof(::Steamworks::AppId) == 0x4);
    // System.Boolean Applicable
    // Size: 0x1
    // Offset: 0x8
    bool Applicable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Applicable and: CsecsLast5h
    char __padding2[0x3] = {};
    // System.Int32 CsecsLast5h
    // Size: 0x4
    // Offset: 0xC
    int CsecsLast5h;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Steamworks.DurationControlProgress Progress
    // Size: 0x4
    // Offset: 0x10
    ::Steamworks::DurationControlProgress Progress;
    // Field size check
    static_assert(sizeof(::Steamworks::DurationControlProgress) == 0x4);
    // Steamworks.DurationControlNotification Otification
    // Size: 0x4
    // Offset: 0x14
    ::Steamworks::DurationControlNotification Otification;
    // Field size check
    static_assert(sizeof(::Steamworks::DurationControlNotification) == 0x4);
    // System.Int32 CsecsToday
    // Size: 0x4
    // Offset: 0x18
    int CsecsToday;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 CsecsRemaining
    // Size: 0x4
    // Offset: 0x1C
    int CsecsRemaining;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: DurationControl_t
    constexpr DurationControl_t(::Steamworks::Result Result_ = {}, ::Steamworks::AppId Appid_ = {}, bool Applicable_ = {}, int CsecsLast5h_ = {}, ::Steamworks::DurationControlProgress Progress_ = {}, ::Steamworks::DurationControlNotification Otification_ = {}, int CsecsToday_ = {}, int CsecsRemaining_ = {}) noexcept : Result{Result_}, Appid{Appid_}, Applicable{Applicable_}, CsecsLast5h{CsecsLast5h_}, Progress{Progress_}, Otification{Otification_}, CsecsToday{CsecsToday_}, CsecsRemaining{CsecsRemaining_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: Steamworks.Result Result
    ::Steamworks::Result& dyn_Result();
    // Get instance field reference: Steamworks.AppId Appid
    ::Steamworks::AppId& dyn_Appid();
    // Get instance field reference: System.Boolean Applicable
    bool& dyn_Applicable();
    // Get instance field reference: System.Int32 CsecsLast5h
    int& dyn_CsecsLast5h();
    // Get instance field reference: Steamworks.DurationControlProgress Progress
    ::Steamworks::DurationControlProgress& dyn_Progress();
    // Get instance field reference: Steamworks.DurationControlNotification Otification
    ::Steamworks::DurationControlNotification& dyn_Otification();
    // Get instance field reference: System.Int32 CsecsToday
    int& dyn_CsecsToday();
    // Get instance field reference: System.Int32 CsecsRemaining
    int& dyn_CsecsRemaining();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0xA51CA0
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0xA51CA8
    static void _cctor();
  }; // Steamworks.Data.DurationControl_t
  #pragma pack(pop)
  static check_size<sizeof(DurationControl_t), 28 + sizeof(int)> __Steamworks_Data_DurationControl_tSizeCheck;
  static_assert(sizeof(DurationControl_t) == 0x20);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::DurationControl_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::DurationControl_t::*)()>(&Steamworks::Data::DurationControl_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::DurationControl_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::DurationControl_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::DurationControl_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::DurationControl_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
