// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.Result
#include "Steamworks/Result.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: FriendsEnumerateFollowingList_t
  struct FriendsEnumerateFollowingList_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::FriendsEnumerateFollowingList_t, "Steamworks.Data", "FriendsEnumerateFollowingList_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x18
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.FriendsEnumerateFollowingList_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct FriendsEnumerateFollowingList_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // Steamworks.Result Result
    // Size: 0x4
    // Offset: 0x0
    ::Steamworks::Result Result;
    // Field size check
    static_assert(sizeof(::Steamworks::Result) == 0x4);
    // Padding between fields: Result and: GSteamID
    char __padding0[0x4] = {};
    // System.UInt64[] GSteamID
    // Size: 0x8
    // Offset: 0x8
    ::ArrayW<uint64_t> GSteamID;
    // Field size check
    static_assert(sizeof(::ArrayW<uint64_t>) == 0x8);
    // System.Int32 ResultsReturned
    // Size: 0x4
    // Offset: 0x10
    int ResultsReturned;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 TotalResultCount
    // Size: 0x4
    // Offset: 0x14
    int TotalResultCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: FriendsEnumerateFollowingList_t
    constexpr FriendsEnumerateFollowingList_t(::Steamworks::Result Result_ = {}, ::ArrayW<uint64_t> GSteamID_ = ::ArrayW<uint64_t>(static_cast<void*>(nullptr)), int ResultsReturned_ = {}, int TotalResultCount_ = {}) noexcept : Result{Result_}, GSteamID{GSteamID_}, ResultsReturned{ResultsReturned_}, TotalResultCount{TotalResultCount_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: Steamworks.Result Result
    [[deprecated("Use field access instead!")]] ::Steamworks::Result& dyn_Result();
    // Get instance field reference: System.UInt64[] GSteamID
    [[deprecated("Use field access instead!")]] ::ArrayW<uint64_t>& dyn_GSteamID();
    // Get instance field reference: System.Int32 ResultsReturned
    [[deprecated("Use field access instead!")]] int& dyn_ResultsReturned();
    // Get instance field reference: System.Int32 TotalResultCount
    [[deprecated("Use field access instead!")]] int& dyn_TotalResultCount();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x45F880
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x45F7E0
    static void _cctor();
  }; // Steamworks.Data.FriendsEnumerateFollowingList_t
  #pragma pack(pop)
  static check_size<sizeof(FriendsEnumerateFollowingList_t), 20 + sizeof(int)> __Steamworks_Data_FriendsEnumerateFollowingList_tSizeCheck;
  static_assert(sizeof(FriendsEnumerateFollowingList_t) == 0x18);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::FriendsEnumerateFollowingList_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::FriendsEnumerateFollowingList_t::*)()>(&Steamworks::Data::FriendsEnumerateFollowingList_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::FriendsEnumerateFollowingList_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::FriendsEnumerateFollowingList_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::FriendsEnumerateFollowingList_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::FriendsEnumerateFollowingList_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
