// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: GameConnectedChatLeave_t
  struct GameConnectedChatLeave_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::GameConnectedChatLeave_t, "Steamworks.Data", "GameConnectedChatLeave_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x12
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.GameConnectedChatLeave_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct GameConnectedChatLeave_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.UInt64 SteamIDClanChat
    // Size: 0x8
    // Offset: 0x0
    uint64_t SteamIDClanChat;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.UInt64 SteamIDUser
    // Size: 0x8
    // Offset: 0x8
    uint64_t SteamIDUser;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.Boolean Kicked
    // Size: 0x1
    // Offset: 0x10
    bool Kicked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean Dropped
    // Size: 0x1
    // Offset: 0x11
    bool Dropped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: GameConnectedChatLeave_t
    constexpr GameConnectedChatLeave_t(uint64_t SteamIDClanChat_ = {}, uint64_t SteamIDUser_ = {}, bool Kicked_ = {}, bool Dropped_ = {}) noexcept : SteamIDClanChat{SteamIDClanChat_}, SteamIDUser{SteamIDUser_}, Kicked{Kicked_}, Dropped{Dropped_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.UInt64 SteamIDClanChat
    uint64_t& dyn_SteamIDClanChat();
    // Get instance field reference: System.UInt64 SteamIDUser
    uint64_t& dyn_SteamIDUser();
    // Get instance field reference: System.Boolean Kicked
    bool& dyn_Kicked();
    // Get instance field reference: System.Boolean Dropped
    bool& dyn_Dropped();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0xA52CB4
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0xA52CBC
    static void _cctor();
  }; // Steamworks.Data.GameConnectedChatLeave_t
  #pragma pack(pop)
  static check_size<sizeof(GameConnectedChatLeave_t), 17 + sizeof(bool)> __Steamworks_Data_GameConnectedChatLeave_tSizeCheck;
  static_assert(sizeof(GameConnectedChatLeave_t) == 0x12);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::GameConnectedChatLeave_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::GameConnectedChatLeave_t::*)()>(&Steamworks::Data::GameConnectedChatLeave_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::GameConnectedChatLeave_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::GameConnectedChatLeave_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::GameConnectedChatLeave_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::GameConnectedChatLeave_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
