// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.Data.PublishedFileId
#include "Steamworks/Data/PublishedFileId.hpp"
// Including type: Steamworks.Result
#include "Steamworks/Result.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: GetUserItemVoteResult_t
  struct GetUserItemVoteResult_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::GetUserItemVoteResult_t, "Steamworks.Data", "GetUserItemVoteResult_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0xF
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.GetUserItemVoteResult_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct GetUserItemVoteResult_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // Steamworks.Data.PublishedFileId PublishedFileId
    // Size: 0x8
    // Offset: 0x0
    ::Steamworks::Data::PublishedFileId PublishedFileId;
    // Field size check
    static_assert(sizeof(::Steamworks::Data::PublishedFileId) == 0x8);
    // Steamworks.Result Result
    // Size: 0x4
    // Offset: 0x8
    ::Steamworks::Result Result;
    // Field size check
    static_assert(sizeof(::Steamworks::Result) == 0x4);
    // System.Boolean VotedUp
    // Size: 0x1
    // Offset: 0xC
    bool VotedUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean VotedDown
    // Size: 0x1
    // Offset: 0xD
    bool VotedDown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean VoteSkipped
    // Size: 0x1
    // Offset: 0xE
    bool VoteSkipped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: GetUserItemVoteResult_t
    constexpr GetUserItemVoteResult_t(::Steamworks::Data::PublishedFileId PublishedFileId_ = {}, ::Steamworks::Result Result_ = {}, bool VotedUp_ = {}, bool VotedDown_ = {}, bool VoteSkipped_ = {}) noexcept : PublishedFileId{PublishedFileId_}, Result{Result_}, VotedUp{VotedUp_}, VotedDown{VotedDown_}, VoteSkipped{VoteSkipped_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: Steamworks.Data.PublishedFileId PublishedFileId
    ::Steamworks::Data::PublishedFileId& dyn_PublishedFileId();
    // Get instance field reference: Steamworks.Result Result
    ::Steamworks::Result& dyn_Result();
    // Get instance field reference: System.Boolean VotedUp
    bool& dyn_VotedUp();
    // Get instance field reference: System.Boolean VotedDown
    bool& dyn_VotedDown();
    // Get instance field reference: System.Boolean VoteSkipped
    bool& dyn_VoteSkipped();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0xA53814
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0xA5381C
    static void _cctor();
  }; // Steamworks.Data.GetUserItemVoteResult_t
  #pragma pack(pop)
  static check_size<sizeof(GetUserItemVoteResult_t), 14 + sizeof(bool)> __Steamworks_Data_GetUserItemVoteResult_tSizeCheck;
  static_assert(sizeof(GetUserItemVoteResult_t) == 0xF);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::GetUserItemVoteResult_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::GetUserItemVoteResult_t::*)()>(&Steamworks::Data::GetUserItemVoteResult_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::GetUserItemVoteResult_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::GetUserItemVoteResult_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::GetUserItemVoteResult_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::GetUserItemVoteResult_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
