// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.Result
#include "Steamworks/Result.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: GSGameplayStats_t
  struct GSGameplayStats_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::GSGameplayStats_t, "Steamworks.Data", "GSGameplayStats_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x10
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.GSGameplayStats_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct GSGameplayStats_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // Steamworks.Result Result
    // Size: 0x4
    // Offset: 0x0
    ::Steamworks::Result Result;
    // Field size check
    static_assert(sizeof(::Steamworks::Result) == 0x4);
    // System.Int32 Rank
    // Size: 0x4
    // Offset: 0x4
    int Rank;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.UInt32 TotalConnects
    // Size: 0x4
    // Offset: 0x8
    uint TotalConnects;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // System.UInt32 TotalMinutesPlayed
    // Size: 0x4
    // Offset: 0xC
    uint TotalMinutesPlayed;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    public:
    // Creating value type constructor for type: GSGameplayStats_t
    constexpr GSGameplayStats_t(::Steamworks::Result Result_ = {}, int Rank_ = {}, uint TotalConnects_ = {}, uint TotalMinutesPlayed_ = {}) noexcept : Result{Result_}, Rank{Rank_}, TotalConnects{TotalConnects_}, TotalMinutesPlayed{TotalMinutesPlayed_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: Steamworks.Result Result
    ::Steamworks::Result& dyn_Result();
    // Get instance field reference: System.Int32 Rank
    int& dyn_Rank();
    // Get instance field reference: System.UInt32 TotalConnects
    uint& dyn_TotalConnects();
    // Get instance field reference: System.UInt32 TotalMinutesPlayed
    uint& dyn_TotalMinutesPlayed();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0xA5281C
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0xA52824
    static void _cctor();
  }; // Steamworks.Data.GSGameplayStats_t
  #pragma pack(pop)
  static check_size<sizeof(GSGameplayStats_t), 12 + sizeof(uint)> __Steamworks_Data_GSGameplayStats_tSizeCheck;
  static_assert(sizeof(GSGameplayStats_t) == 0x10);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::GSGameplayStats_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::GSGameplayStats_t::*)()>(&Steamworks::Data::GSGameplayStats_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::GSGameplayStats_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::GSGameplayStats_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::GSGameplayStats_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::GSGameplayStats_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
