// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: HTML_URLChanged_t
  struct HTML_URLChanged_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::HTML_URLChanged_t, "Steamworks.Data", "HTML_URLChanged_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x29
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.HTML_URLChanged_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct HTML_URLChanged_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.UInt32 UnBrowserHandle
    // Size: 0x4
    // Offset: 0x0
    uint UnBrowserHandle;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: UnBrowserHandle and: PchURL
    char __padding0[0x4] = {};
    // System.String PchURL
    // Size: 0x8
    // Offset: 0x8
    ::StringW PchURL;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String PchPostData
    // Size: 0x8
    // Offset: 0x10
    ::StringW PchPostData;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Boolean BIsRedirect
    // Size: 0x1
    // Offset: 0x18
    bool BIsRedirect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BIsRedirect and: PchPageTitle
    char __padding3[0x7] = {};
    // System.String PchPageTitle
    // Size: 0x8
    // Offset: 0x20
    ::StringW PchPageTitle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Boolean BNewNavigation
    // Size: 0x1
    // Offset: 0x28
    bool BNewNavigation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: HTML_URLChanged_t
    constexpr HTML_URLChanged_t(uint UnBrowserHandle_ = {}, ::StringW PchURL_ = {}, ::StringW PchPostData_ = {}, bool BIsRedirect_ = {}, ::StringW PchPageTitle_ = {}, bool BNewNavigation_ = {}) noexcept : UnBrowserHandle{UnBrowserHandle_}, PchURL{PchURL_}, PchPostData{PchPostData_}, BIsRedirect{BIsRedirect_}, PchPageTitle{PchPageTitle_}, BNewNavigation{BNewNavigation_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.UInt32 UnBrowserHandle
    [[deprecated]] uint& dyn_UnBrowserHandle();
    // Get instance field reference: System.String PchURL
    [[deprecated]] ::StringW& dyn_PchURL();
    // Get instance field reference: System.String PchPostData
    [[deprecated]] ::StringW& dyn_PchPostData();
    // Get instance field reference: System.Boolean BIsRedirect
    [[deprecated]] bool& dyn_BIsRedirect();
    // Get instance field reference: System.String PchPageTitle
    [[deprecated]] ::StringW& dyn_PchPageTitle();
    // Get instance field reference: System.Boolean BNewNavigation
    [[deprecated]] bool& dyn_BNewNavigation();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x461E90
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x461DF0
    static void _cctor();
  }; // Steamworks.Data.HTML_URLChanged_t
  #pragma pack(pop)
  static check_size<sizeof(HTML_URLChanged_t), 40 + sizeof(bool)> __Steamworks_Data_HTML_URLChanged_tSizeCheck;
  static_assert(sizeof(HTML_URLChanged_t) == 0x29);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::HTML_URLChanged_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::HTML_URLChanged_t::*)()>(&Steamworks::Data::HTML_URLChanged_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::HTML_URLChanged_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::HTML_URLChanged_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::HTML_URLChanged_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::HTML_URLChanged_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
