// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: HTTPRequestDataReceived_t
  struct HTTPRequestDataReceived_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::HTTPRequestDataReceived_t, "Steamworks.Data", "HTTPRequestDataReceived_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x18
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.HTTPRequestDataReceived_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct HTTPRequestDataReceived_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.UInt32 Request
    // Size: 0x4
    // Offset: 0x0
    uint Request;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: Request and: ContextValue
    char __padding0[0x4] = {};
    // System.UInt64 ContextValue
    // Size: 0x8
    // Offset: 0x8
    uint64_t ContextValue;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.UInt32 COffset
    // Size: 0x4
    // Offset: 0x10
    uint COffset;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // System.UInt32 CBytesReceived
    // Size: 0x4
    // Offset: 0x14
    uint CBytesReceived;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    public:
    // Creating value type constructor for type: HTTPRequestDataReceived_t
    constexpr HTTPRequestDataReceived_t(uint Request_ = {}, uint64_t ContextValue_ = {}, uint COffset_ = {}, uint CBytesReceived_ = {}) noexcept : Request{Request_}, ContextValue{ContextValue_}, COffset{COffset_}, CBytesReceived{CBytesReceived_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.UInt32 Request
    uint& dyn_Request();
    // Get instance field reference: System.UInt64 ContextValue
    uint64_t& dyn_ContextValue();
    // Get instance field reference: System.UInt32 COffset
    uint& dyn_COffset();
    // Get instance field reference: System.UInt32 CBytesReceived
    uint& dyn_CBytesReceived();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0xA54FD4
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0xA54FDC
    static void _cctor();
  }; // Steamworks.Data.HTTPRequestDataReceived_t
  #pragma pack(pop)
  static check_size<sizeof(HTTPRequestDataReceived_t), 20 + sizeof(uint)> __Steamworks_Data_HTTPRequestDataReceived_tSizeCheck;
  static_assert(sizeof(HTTPRequestDataReceived_t) == 0x18);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::HTTPRequestDataReceived_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::HTTPRequestDataReceived_t::*)()>(&Steamworks::Data::HTTPRequestDataReceived_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::HTTPRequestDataReceived_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::HTTPRequestDataReceived_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::HTTPRequestDataReceived_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::HTTPRequestDataReceived_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
