// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: LeaderboardScoreUploaded_t
  struct LeaderboardScoreUploaded_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::LeaderboardScoreUploaded_t, "Steamworks.Data", "LeaderboardScoreUploaded_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x20
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.LeaderboardScoreUploaded_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct LeaderboardScoreUploaded_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.Byte Success
    // Size: 0x1
    // Offset: 0x0
    uint8_t Success;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: Success and: SteamLeaderboard
    char __padding0[0x7] = {};
    // System.UInt64 SteamLeaderboard
    // Size: 0x8
    // Offset: 0x8
    uint64_t SteamLeaderboard;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.Int32 Score
    // Size: 0x4
    // Offset: 0x10
    int Score;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Byte ScoreChanged
    // Size: 0x1
    // Offset: 0x14
    uint8_t ScoreChanged;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: ScoreChanged and: GlobalRankNew
    char __padding3[0x3] = {};
    // System.Int32 GlobalRankNew
    // Size: 0x4
    // Offset: 0x18
    int GlobalRankNew;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 GlobalRankPrevious
    // Size: 0x4
    // Offset: 0x1C
    int GlobalRankPrevious;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: LeaderboardScoreUploaded_t
    constexpr LeaderboardScoreUploaded_t(uint8_t Success_ = {}, uint64_t SteamLeaderboard_ = {}, int Score_ = {}, uint8_t ScoreChanged_ = {}, int GlobalRankNew_ = {}, int GlobalRankPrevious_ = {}) noexcept : Success{Success_}, SteamLeaderboard{SteamLeaderboard_}, Score{Score_}, ScoreChanged{ScoreChanged_}, GlobalRankNew{GlobalRankNew_}, GlobalRankPrevious{GlobalRankPrevious_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.Byte Success
    [[deprecated]] uint8_t& dyn_Success();
    // Get instance field reference: System.UInt64 SteamLeaderboard
    [[deprecated]] uint64_t& dyn_SteamLeaderboard();
    // Get instance field reference: System.Int32 Score
    [[deprecated]] int& dyn_Score();
    // Get instance field reference: System.Byte ScoreChanged
    [[deprecated]] uint8_t& dyn_ScoreChanged();
    // Get instance field reference: System.Int32 GlobalRankNew
    [[deprecated]] int& dyn_GlobalRankNew();
    // Get instance field reference: System.Int32 GlobalRankPrevious
    [[deprecated]] int& dyn_GlobalRankPrevious();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x4629B0
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x462910
    static void _cctor();
  }; // Steamworks.Data.LeaderboardScoreUploaded_t
  #pragma pack(pop)
  static check_size<sizeof(LeaderboardScoreUploaded_t), 28 + sizeof(int)> __Steamworks_Data_LeaderboardScoreUploaded_tSizeCheck;
  static_assert(sizeof(LeaderboardScoreUploaded_t) == 0x20);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::LeaderboardScoreUploaded_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::LeaderboardScoreUploaded_t::*)()>(&Steamworks::Data::LeaderboardScoreUploaded_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::LeaderboardScoreUploaded_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::LeaderboardScoreUploaded_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::LeaderboardScoreUploaded_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::LeaderboardScoreUploaded_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
