// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: LobbyChatUpdate_t
  struct LobbyChatUpdate_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::LobbyChatUpdate_t, "Steamworks.Data", "LobbyChatUpdate_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x1C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.LobbyChatUpdate_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct LobbyChatUpdate_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.UInt64 SteamIDLobby
    // Size: 0x8
    // Offset: 0x0
    uint64_t SteamIDLobby;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.UInt64 SteamIDUserChanged
    // Size: 0x8
    // Offset: 0x8
    uint64_t SteamIDUserChanged;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.UInt64 SteamIDMakingChange
    // Size: 0x8
    // Offset: 0x10
    uint64_t SteamIDMakingChange;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.UInt32 GfChatMemberStateChange
    // Size: 0x4
    // Offset: 0x18
    uint GfChatMemberStateChange;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    public:
    // Creating value type constructor for type: LobbyChatUpdate_t
    constexpr LobbyChatUpdate_t(uint64_t SteamIDLobby_ = {}, uint64_t SteamIDUserChanged_ = {}, uint64_t SteamIDMakingChange_ = {}, uint GfChatMemberStateChange_ = {}) noexcept : SteamIDLobby{SteamIDLobby_}, SteamIDUserChanged{SteamIDUserChanged_}, SteamIDMakingChange{SteamIDMakingChange_}, GfChatMemberStateChange{GfChatMemberStateChange_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.UInt64 SteamIDLobby
    [[deprecated]] uint64_t& dyn_SteamIDLobby();
    // Get instance field reference: System.UInt64 SteamIDUserChanged
    [[deprecated]] uint64_t& dyn_SteamIDUserChanged();
    // Get instance field reference: System.UInt64 SteamIDMakingChange
    [[deprecated]] uint64_t& dyn_SteamIDMakingChange();
    // Get instance field reference: System.UInt32 GfChatMemberStateChange
    [[deprecated]] uint& dyn_GfChatMemberStateChange();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x462D20
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x462C80
    static void _cctor();
  }; // Steamworks.Data.LobbyChatUpdate_t
  #pragma pack(pop)
  static check_size<sizeof(LobbyChatUpdate_t), 24 + sizeof(uint)> __Steamworks_Data_LobbyChatUpdate_tSizeCheck;
  static_assert(sizeof(LobbyChatUpdate_t) == 0x1C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::LobbyChatUpdate_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::LobbyChatUpdate_t::*)()>(&Steamworks::Data::LobbyChatUpdate_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::LobbyChatUpdate_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::LobbyChatUpdate_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::LobbyChatUpdate_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::LobbyChatUpdate_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
