// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.MarketNotAllowedReasonFlags
#include "Steamworks/MarketNotAllowedReasonFlags.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: MarketEligibilityResponse_t
  struct MarketEligibilityResponse_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::MarketEligibilityResponse_t, "Steamworks.Data", "MarketEligibilityResponse_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x14
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.MarketEligibilityResponse_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct MarketEligibilityResponse_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.Boolean Allowed
    // Size: 0x1
    // Offset: 0x0
    bool Allowed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Allowed and: NotAllowedReason
    char __padding0[0x3] = {};
    // Steamworks.MarketNotAllowedReasonFlags NotAllowedReason
    // Size: 0x4
    // Offset: 0x4
    ::Steamworks::MarketNotAllowedReasonFlags NotAllowedReason;
    // Field size check
    static_assert(sizeof(::Steamworks::MarketNotAllowedReasonFlags) == 0x4);
    // System.UInt32 TAllowedAtTime
    // Size: 0x4
    // Offset: 0x8
    uint TAllowedAtTime;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // System.Int32 CdaySteamGuardRequiredDays
    // Size: 0x4
    // Offset: 0xC
    int CdaySteamGuardRequiredDays;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 CdayNewDeviceCooldown
    // Size: 0x4
    // Offset: 0x10
    int CdayNewDeviceCooldown;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: MarketEligibilityResponse_t
    constexpr MarketEligibilityResponse_t(bool Allowed_ = {}, ::Steamworks::MarketNotAllowedReasonFlags NotAllowedReason_ = {}, uint TAllowedAtTime_ = {}, int CdaySteamGuardRequiredDays_ = {}, int CdayNewDeviceCooldown_ = {}) noexcept : Allowed{Allowed_}, NotAllowedReason{NotAllowedReason_}, TAllowedAtTime{TAllowedAtTime_}, CdaySteamGuardRequiredDays{CdaySteamGuardRequiredDays_}, CdayNewDeviceCooldown{CdayNewDeviceCooldown_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.Boolean Allowed
    [[deprecated]] bool& dyn_Allowed();
    // Get instance field reference: Steamworks.MarketNotAllowedReasonFlags NotAllowedReason
    [[deprecated]] ::Steamworks::MarketNotAllowedReasonFlags& dyn_NotAllowedReason();
    // Get instance field reference: System.UInt32 TAllowedAtTime
    [[deprecated]] uint& dyn_TAllowedAtTime();
    // Get instance field reference: System.Int32 CdaySteamGuardRequiredDays
    [[deprecated]] int& dyn_CdaySteamGuardRequiredDays();
    // Get instance field reference: System.Int32 CdayNewDeviceCooldown
    [[deprecated]] int& dyn_CdayNewDeviceCooldown();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x463350
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x4632B0
    static void _cctor();
  }; // Steamworks.Data.MarketEligibilityResponse_t
  #pragma pack(pop)
  static check_size<sizeof(MarketEligibilityResponse_t), 16 + sizeof(int)> __Steamworks_Data_MarketEligibilityResponse_tSizeCheck;
  static_assert(sizeof(MarketEligibilityResponse_t) == 0x14);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::MarketEligibilityResponse_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::MarketEligibilityResponse_t::*)()>(&Steamworks::Data::MarketEligibilityResponse_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::MarketEligibilityResponse_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::MarketEligibilityResponse_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::MarketEligibilityResponse_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::MarketEligibilityResponse_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
