// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.Result
#include "Steamworks/Result.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: SearchForGameProgressCallback_t
  struct SearchForGameProgressCallback_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::SearchForGameProgressCallback_t, "Steamworks.Data", "SearchForGameProgressCallback_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x24
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.SearchForGameProgressCallback_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct SearchForGameProgressCallback_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.UInt64 LSearchID
    // Size: 0x8
    // Offset: 0x0
    uint64_t LSearchID;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // Steamworks.Result Result
    // Size: 0x4
    // Offset: 0x8
    ::Steamworks::Result Result;
    // Field size check
    static_assert(sizeof(::Steamworks::Result) == 0x4);
    // System.UInt64 LobbyID
    // Size: 0x8
    // Offset: 0xC
    uint64_t LobbyID;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.UInt64 SteamIDEndedSearch
    // Size: 0x8
    // Offset: 0x14
    uint64_t SteamIDEndedSearch;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.Int32 SecondsRemainingEstimate
    // Size: 0x4
    // Offset: 0x1C
    int SecondsRemainingEstimate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 CPlayersSearching
    // Size: 0x4
    // Offset: 0x20
    int CPlayersSearching;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: SearchForGameProgressCallback_t
    constexpr SearchForGameProgressCallback_t(uint64_t LSearchID_ = {}, ::Steamworks::Result Result_ = {}, uint64_t LobbyID_ = {}, uint64_t SteamIDEndedSearch_ = {}, int SecondsRemainingEstimate_ = {}, int CPlayersSearching_ = {}) noexcept : LSearchID{LSearchID_}, Result{Result_}, LobbyID{LobbyID_}, SteamIDEndedSearch{SteamIDEndedSearch_}, SecondsRemainingEstimate{SecondsRemainingEstimate_}, CPlayersSearching{CPlayersSearching_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.UInt64 LSearchID
    [[deprecated("Use field access instead!")]] uint64_t& dyn_LSearchID();
    // Get instance field reference: Steamworks.Result Result
    [[deprecated("Use field access instead!")]] ::Steamworks::Result& dyn_Result();
    // Get instance field reference: System.UInt64 LobbyID
    [[deprecated("Use field access instead!")]] uint64_t& dyn_LobbyID();
    // Get instance field reference: System.UInt64 SteamIDEndedSearch
    [[deprecated("Use field access instead!")]] uint64_t& dyn_SteamIDEndedSearch();
    // Get instance field reference: System.Int32 SecondsRemainingEstimate
    [[deprecated("Use field access instead!")]] int& dyn_SecondsRemainingEstimate();
    // Get instance field reference: System.Int32 CPlayersSearching
    [[deprecated("Use field access instead!")]] int& dyn_CPlayersSearching();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x465FD0
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x465F30
    static void _cctor();
  }; // Steamworks.Data.SearchForGameProgressCallback_t
  #pragma pack(pop)
  static check_size<sizeof(SearchForGameProgressCallback_t), 32 + sizeof(int)> __Steamworks_Data_SearchForGameProgressCallback_tSizeCheck;
  static_assert(sizeof(SearchForGameProgressCallback_t) == 0x24);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::SearchForGameProgressCallback_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::SearchForGameProgressCallback_t::*)()>(&Steamworks::Data::SearchForGameProgressCallback_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SearchForGameProgressCallback_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::SearchForGameProgressCallback_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::SearchForGameProgressCallback_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SearchForGameProgressCallback_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
