// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.Result
#include "Steamworks/Result.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: SearchForGameResultCallback_t
  struct SearchForGameResultCallback_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::SearchForGameResultCallback_t, "Steamworks.Data", "SearchForGameResultCallback_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x1D
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.SearchForGameResultCallback_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct SearchForGameResultCallback_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.UInt64 LSearchID
    // Size: 0x8
    // Offset: 0x0
    uint64_t LSearchID;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // Steamworks.Result Result
    // Size: 0x4
    // Offset: 0x8
    ::Steamworks::Result Result;
    // Field size check
    static_assert(sizeof(::Steamworks::Result) == 0x4);
    // System.Int32 CountPlayersInGame
    // Size: 0x4
    // Offset: 0xC
    int CountPlayersInGame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 CountAcceptedGame
    // Size: 0x4
    // Offset: 0x10
    int CountAcceptedGame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.UInt64 SteamIDHost
    // Size: 0x8
    // Offset: 0x14
    uint64_t SteamIDHost;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.Boolean FinalCallback
    // Size: 0x1
    // Offset: 0x1C
    bool FinalCallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: SearchForGameResultCallback_t
    constexpr SearchForGameResultCallback_t(uint64_t LSearchID_ = {}, ::Steamworks::Result Result_ = {}, int CountPlayersInGame_ = {}, int CountAcceptedGame_ = {}, uint64_t SteamIDHost_ = {}, bool FinalCallback_ = {}) noexcept : LSearchID{LSearchID_}, Result{Result_}, CountPlayersInGame{CountPlayersInGame_}, CountAcceptedGame{CountAcceptedGame_}, SteamIDHost{SteamIDHost_}, FinalCallback{FinalCallback_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.UInt64 LSearchID
    [[deprecated("Use field access instead!")]] uint64_t& dyn_LSearchID();
    // Get instance field reference: Steamworks.Result Result
    [[deprecated("Use field access instead!")]] ::Steamworks::Result& dyn_Result();
    // Get instance field reference: System.Int32 CountPlayersInGame
    [[deprecated("Use field access instead!")]] int& dyn_CountPlayersInGame();
    // Get instance field reference: System.Int32 CountAcceptedGame
    [[deprecated("Use field access instead!")]] int& dyn_CountAcceptedGame();
    // Get instance field reference: System.UInt64 SteamIDHost
    [[deprecated("Use field access instead!")]] uint64_t& dyn_SteamIDHost();
    // Get instance field reference: System.Boolean FinalCallback
    [[deprecated("Use field access instead!")]] bool& dyn_FinalCallback();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x466080
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x465FE0
    static void _cctor();
  }; // Steamworks.Data.SearchForGameResultCallback_t
  #pragma pack(pop)
  static check_size<sizeof(SearchForGameResultCallback_t), 28 + sizeof(bool)> __Steamworks_Data_SearchForGameResultCallback_tSizeCheck;
  static_assert(sizeof(SearchForGameResultCallback_t) == 0x1D);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::SearchForGameResultCallback_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::SearchForGameResultCallback_t::*)()>(&Steamworks::Data::SearchForGameResultCallback_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SearchForGameResultCallback_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::SearchForGameResultCallback_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::SearchForGameResultCallback_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SearchForGameResultCallback_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
