// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.SteamNetworkingAvailability
#include "Steamworks/SteamNetworkingAvailability.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: SteamRelayNetworkStatus_t
  struct SteamRelayNetworkStatus_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::SteamRelayNetworkStatus_t, "Steamworks.Data", "SteamRelayNetworkStatus_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x18
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.SteamRelayNetworkStatus_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct SteamRelayNetworkStatus_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // Steamworks.SteamNetworkingAvailability Avail
    // Size: 0x4
    // Offset: 0x0
    ::Steamworks::SteamNetworkingAvailability Avail;
    // Field size check
    static_assert(sizeof(::Steamworks::SteamNetworkingAvailability) == 0x4);
    // System.Int32 PingMeasurementInProgress
    // Size: 0x4
    // Offset: 0x4
    int PingMeasurementInProgress;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Steamworks.SteamNetworkingAvailability AvailNetworkConfig
    // Size: 0x4
    // Offset: 0x8
    ::Steamworks::SteamNetworkingAvailability AvailNetworkConfig;
    // Field size check
    static_assert(sizeof(::Steamworks::SteamNetworkingAvailability) == 0x4);
    // Steamworks.SteamNetworkingAvailability AvailAnyRelay
    // Size: 0x4
    // Offset: 0xC
    ::Steamworks::SteamNetworkingAvailability AvailAnyRelay;
    // Field size check
    static_assert(sizeof(::Steamworks::SteamNetworkingAvailability) == 0x4);
    // System.Byte[] DebugMsg
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<uint8_t> DebugMsg;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    public:
    // Creating value type constructor for type: SteamRelayNetworkStatus_t
    constexpr SteamRelayNetworkStatus_t(::Steamworks::SteamNetworkingAvailability Avail_ = {}, int PingMeasurementInProgress_ = {}, ::Steamworks::SteamNetworkingAvailability AvailNetworkConfig_ = {}, ::Steamworks::SteamNetworkingAvailability AvailAnyRelay_ = {}, ::ArrayW<uint8_t> DebugMsg_ = ::ArrayW<uint8_t>(static_cast<void*>(nullptr))) noexcept : Avail{Avail_}, PingMeasurementInProgress{PingMeasurementInProgress_}, AvailNetworkConfig{AvailNetworkConfig_}, AvailAnyRelay{AvailAnyRelay_}, DebugMsg{DebugMsg_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: Steamworks.SteamNetworkingAvailability Avail
    ::Steamworks::SteamNetworkingAvailability& dyn_Avail();
    // Get instance field reference: System.Int32 PingMeasurementInProgress
    int& dyn_PingMeasurementInProgress();
    // Get instance field reference: Steamworks.SteamNetworkingAvailability AvailNetworkConfig
    ::Steamworks::SteamNetworkingAvailability& dyn_AvailNetworkConfig();
    // Get instance field reference: Steamworks.SteamNetworkingAvailability AvailAnyRelay
    ::Steamworks::SteamNetworkingAvailability& dyn_AvailAnyRelay();
    // Get instance field reference: System.Byte[] DebugMsg
    ::ArrayW<uint8_t>& dyn_DebugMsg();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0xA5A4F8
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0xA5A500
    static void _cctor();
  }; // Steamworks.Data.SteamRelayNetworkStatus_t
  #pragma pack(pop)
  static check_size<sizeof(SteamRelayNetworkStatus_t), 16 + sizeof(::ArrayW<uint8_t>)> __Steamworks_Data_SteamRelayNetworkStatus_tSizeCheck;
  static_assert(sizeof(SteamRelayNetworkStatus_t) == 0x18);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::SteamRelayNetworkStatus_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::SteamRelayNetworkStatus_t::*)()>(&Steamworks::Data::SteamRelayNetworkStatus_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SteamRelayNetworkStatus_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::SteamRelayNetworkStatus_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::SteamRelayNetworkStatus_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SteamRelayNetworkStatus_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
