// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.Result
#include "Steamworks/Result.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: SteamUGCQueryCompleted_t
  struct SteamUGCQueryCompleted_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::SteamUGCQueryCompleted_t, "Steamworks.Data", "SteamUGCQueryCompleted_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x20
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.SteamUGCQueryCompleted_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct SteamUGCQueryCompleted_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // System.UInt64 Handle
    // Size: 0x8
    // Offset: 0x0
    uint64_t Handle;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // Steamworks.Result Result
    // Size: 0x4
    // Offset: 0x8
    ::Steamworks::Result Result;
    // Field size check
    static_assert(sizeof(::Steamworks::Result) == 0x4);
    // System.UInt32 NumResultsReturned
    // Size: 0x4
    // Offset: 0xC
    uint NumResultsReturned;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // System.UInt32 TotalMatchingResults
    // Size: 0x4
    // Offset: 0x10
    uint TotalMatchingResults;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // System.Boolean CachedData
    // Size: 0x1
    // Offset: 0x14
    bool CachedData;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CachedData and: NextCursor
    char __padding4[0x3] = {};
    // System.Byte[] NextCursor
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<uint8_t> NextCursor;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    public:
    // Creating value type constructor for type: SteamUGCQueryCompleted_t
    constexpr SteamUGCQueryCompleted_t(uint64_t Handle_ = {}, ::Steamworks::Result Result_ = {}, uint NumResultsReturned_ = {}, uint TotalMatchingResults_ = {}, bool CachedData_ = {}, ::ArrayW<uint8_t> NextCursor_ = ::ArrayW<uint8_t>(static_cast<void*>(nullptr))) noexcept : Handle{Handle_}, Result{Result_}, NumResultsReturned{NumResultsReturned_}, TotalMatchingResults{TotalMatchingResults_}, CachedData{CachedData_}, NextCursor{NextCursor_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: System.UInt64 Handle
    [[deprecated]] uint64_t& dyn_Handle();
    // Get instance field reference: Steamworks.Result Result
    [[deprecated]] ::Steamworks::Result& dyn_Result();
    // Get instance field reference: System.UInt32 NumResultsReturned
    [[deprecated]] uint& dyn_NumResultsReturned();
    // Get instance field reference: System.UInt32 TotalMatchingResults
    [[deprecated]] uint& dyn_TotalMatchingResults();
    // Get instance field reference: System.Boolean CachedData
    [[deprecated]] bool& dyn_CachedData();
    // Get instance field reference: System.Byte[] NextCursor
    [[deprecated]] ::ArrayW<uint8_t>& dyn_NextCursor();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x467130
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x467090
    static void _cctor();
  }; // Steamworks.Data.SteamUGCQueryCompleted_t
  #pragma pack(pop)
  static check_size<sizeof(SteamUGCQueryCompleted_t), 24 + sizeof(::ArrayW<uint8_t>)> __Steamworks_Data_SteamUGCQueryCompleted_tSizeCheck;
  static_assert(sizeof(SteamUGCQueryCompleted_t) == 0x20);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::SteamUGCQueryCompleted_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::SteamUGCQueryCompleted_t::*)()>(&Steamworks::Data::SteamUGCQueryCompleted_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SteamUGCQueryCompleted_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::SteamUGCQueryCompleted_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::SteamUGCQueryCompleted_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SteamUGCQueryCompleted_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
