// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Steamworks.ICallbackData
#include "Steamworks/ICallbackData.hpp"
// Including type: Steamworks.Result
#include "Steamworks/Result.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Steamworks
namespace Steamworks {
  // Forward declaring type: CallbackType
  struct CallbackType;
}
// Completed forward declares
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Forward declaring type: SteamInventoryEligiblePromoItemDefIDs_t
  struct SteamInventoryEligiblePromoItemDefIDs_t;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Steamworks::Data::SteamInventoryEligiblePromoItemDefIDs_t, "Steamworks.Data", "SteamInventoryEligiblePromoItemDefIDs_t");
// Type namespace: Steamworks.Data
namespace Steamworks::Data {
  // Size: 0x11
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Steamworks.Data.SteamInventoryEligiblePromoItemDefIDs_t
  // [TokenAttribute] Offset: FFFFFFFF
  struct SteamInventoryEligiblePromoItemDefIDs_t/*, public ::System::ValueType, public ::Steamworks::ICallbackData*/ {
    public:
    public:
    // Steamworks.Result Result
    // Size: 0x4
    // Offset: 0x0
    ::Steamworks::Result Result;
    // Field size check
    static_assert(sizeof(::Steamworks::Result) == 0x4);
    // System.UInt64 SteamID
    // Size: 0x8
    // Offset: 0x4
    uint64_t SteamID;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.Int32 UmEligiblePromoItemDefs
    // Size: 0x4
    // Offset: 0xC
    int UmEligiblePromoItemDefs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean CachedData
    // Size: 0x1
    // Offset: 0x10
    bool CachedData;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: SteamInventoryEligiblePromoItemDefIDs_t
    constexpr SteamInventoryEligiblePromoItemDefIDs_t(::Steamworks::Result Result_ = {}, uint64_t SteamID_ = {}, int UmEligiblePromoItemDefs_ = {}, bool CachedData_ = {}) noexcept : Result{Result_}, SteamID{SteamID_}, UmEligiblePromoItemDefs{UmEligiblePromoItemDefs_}, CachedData{CachedData_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::Steamworks::ICallbackData
    operator ::Steamworks::ICallbackData() noexcept {
      return *reinterpret_cast<::Steamworks::ICallbackData*>(this);
    }
    // Get static field: static public System.Int32 _datasize
    static int _get__datasize();
    // Set static field: static public System.Int32 _datasize
    static void _set__datasize(int value);
    // Get instance field reference: Steamworks.Result Result
    [[deprecated]] ::Steamworks::Result& dyn_Result();
    // Get instance field reference: System.UInt64 SteamID
    [[deprecated]] uint64_t& dyn_SteamID();
    // Get instance field reference: System.Int32 UmEligiblePromoItemDefs
    [[deprecated]] int& dyn_UmEligiblePromoItemDefs();
    // Get instance field reference: System.Boolean CachedData
    [[deprecated]] bool& dyn_CachedData();
    // public Steamworks.CallbackType get_CallbackType()
    // Offset: 0x466600
    ::Steamworks::CallbackType get_CallbackType();
    // static private System.Void .cctor()
    // Offset: 0x466560
    static void _cctor();
  }; // Steamworks.Data.SteamInventoryEligiblePromoItemDefIDs_t
  #pragma pack(pop)
  static check_size<sizeof(SteamInventoryEligiblePromoItemDefIDs_t), 16 + sizeof(bool)> __Steamworks_Data_SteamInventoryEligiblePromoItemDefIDs_tSizeCheck;
  static_assert(sizeof(SteamInventoryEligiblePromoItemDefIDs_t) == 0x11);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Steamworks::Data::SteamInventoryEligiblePromoItemDefIDs_t::get_CallbackType
// Il2CppName: get_CallbackType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Steamworks::CallbackType (Steamworks::Data::SteamInventoryEligiblePromoItemDefIDs_t::*)()>(&Steamworks::Data::SteamInventoryEligiblePromoItemDefIDs_t::get_CallbackType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SteamInventoryEligiblePromoItemDefIDs_t), "get_CallbackType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Steamworks::Data::SteamInventoryEligiblePromoItemDefIDs_t::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Steamworks::Data::SteamInventoryEligiblePromoItemDefIDs_t::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Steamworks::Data::SteamInventoryEligiblePromoItemDefIDs_t), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
