// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode
#include "Sigtrap/VrTunnellingPro/TunnellingBase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Sigtrap::VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Cubemap
  class Cubemap;
}
// Completed forward declares
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Forward declaring type: TunnellingPresetBase
  class TunnellingPresetBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Sigtrap::VrTunnellingPro::TunnellingPresetBase);
DEFINE_IL2CPP_ARG_TYPE(::Sigtrap::VrTunnellingPro::TunnellingPresetBase*, "Sigtrap.VrTunnellingPro", "TunnellingPresetBase");
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Size: 0xAD
  #pragma pack(push, 1)
  // Autogenerated type: Sigtrap.VrTunnellingPro.TunnellingPresetBase
  // [TokenAttribute] Offset: FFFFFFFF
  class TunnellingPresetBase : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::Sigtrap::VrTunnellingPro::TunnellingPresetBase::MotionSettings
    class MotionSettings;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean _overrideAll
    // Size: 0x1
    // Offset: 0x18
    bool overrideAll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideAll and: effectCoverage
    char __padding0[0x3] = {};
    // [RangeAttribute] Offset: 0x72B780
    // private System.Single _effectCoverage
    // Size: 0x4
    // Offset: 0x1C
    float effectCoverage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideEffectCoverage
    // Size: 0x1
    // Offset: 0x20
    bool overrideEffectCoverage;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideEffectCoverage and: effectColor
    char __padding2[0x3] = {};
    // private UnityEngine.Color _effectColor
    // Size: 0x10
    // Offset: 0x24
    ::UnityEngine::Color effectColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean _overrideEffectColor
    // Size: 0x1
    // Offset: 0x34
    bool overrideEffectColor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideEffectColor and: effectFeather
    char __padding4[0x3] = {};
    // [RangeAttribute] Offset: 0x72B7F0
    // private System.Single _effectFeather
    // Size: 0x4
    // Offset: 0x38
    float effectFeather;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideEffectFeather
    // Size: 0x1
    // Offset: 0x3C
    bool overrideEffectFeather;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _applyColorToBackground
    // Size: 0x1
    // Offset: 0x3D
    bool applyColorToBackground;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideApplyColorToBackground
    // Size: 0x1
    // Offset: 0x3E
    bool overrideApplyColorToBackground;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideApplyColorToBackground and: skybox
    char __padding8[0x1] = {};
    // private UnityEngine.Cubemap _skybox
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Cubemap* skybox;
    // Field size check
    static_assert(sizeof(::UnityEngine::Cubemap*) == 0x8);
    // private System.Boolean _overrideSkybox
    // Size: 0x1
    // Offset: 0x48
    bool overrideSkybox;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideSkybox and: angularVelocity
    char __padding10[0x7] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingPresetBase/Sigtrap.VrTunnellingPro.MotionSettings _angularVelocity
    // Size: 0x8
    // Offset: 0x50
    ::Sigtrap::VrTunnellingPro::TunnellingPresetBase::MotionSettings* angularVelocity;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingPresetBase::MotionSettings*) == 0x8);
    // private System.Boolean _overrideAngularVelocity
    // Size: 0x1
    // Offset: 0x58
    bool overrideAngularVelocity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideAngularVelocity and: acceleration
    char __padding12[0x7] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingPresetBase/Sigtrap.VrTunnellingPro.MotionSettings _acceleration
    // Size: 0x8
    // Offset: 0x60
    ::Sigtrap::VrTunnellingPro::TunnellingPresetBase::MotionSettings* acceleration;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingPresetBase::MotionSettings*) == 0x8);
    // private System.Boolean _overrideAcceleration
    // Size: 0x1
    // Offset: 0x68
    bool overrideAcceleration;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideAcceleration and: velocity
    char __padding14[0x7] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingPresetBase/Sigtrap.VrTunnellingPro.MotionSettings _velocity
    // Size: 0x8
    // Offset: 0x70
    ::Sigtrap::VrTunnellingPro::TunnellingPresetBase::MotionSettings* velocity;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingPresetBase::MotionSettings*) == 0x8);
    // private System.Boolean _overrideVelocity
    // Size: 0x1
    // Offset: 0x78
    bool overrideVelocity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _useCounterMotion
    // Size: 0x1
    // Offset: 0x79
    bool useCounterMotion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideUseCounterMotion
    // Size: 0x1
    // Offset: 0x7A
    bool overrideUseCounterMotion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideUseCounterMotion and: counterRotationStrength
    char __padding18[0x1] = {};
    // [RangeAttribute] Offset: 0x72B900
    // private System.Single _counterRotationStrength
    // Size: 0x4
    // Offset: 0x7C
    float counterRotationStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideCounterRotationStrength
    // Size: 0x1
    // Offset: 0x80
    bool overrideCounterRotationStrength;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCounterRotationStrength and: counterRotationPerAxis
    char __padding20[0x3] = {};
    // private UnityEngine.Vector3 _counterRotationPerAxis
    // Size: 0xC
    // Offset: 0x84
    ::UnityEngine::Vector3 counterRotationPerAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean _overrideCounterRotationPerAxis
    // Size: 0x1
    // Offset: 0x90
    bool overrideCounterRotationPerAxis;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _useArtificialTilt
    // Size: 0x1
    // Offset: 0x91
    bool useArtificialTilt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideUseArtificialTilt
    // Size: 0x1
    // Offset: 0x92
    bool overrideUseArtificialTilt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideUseArtificialTilt and: framerateDivision
    char __padding24[0x1] = {};
    // [RangeAttribute] Offset: 0x72B990
    // private System.Int32 _framerateDivision
    // Size: 0x4
    // Offset: 0x94
    int framerateDivision;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _overrideFramerateDivision
    // Size: 0x1
    // Offset: 0x98
    bool overrideFramerateDivision;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _divideTranslation
    // Size: 0x1
    // Offset: 0x99
    bool divideTranslation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideDivideTranslation
    // Size: 0x1
    // Offset: 0x9A
    bool overrideDivideTranslation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _divideRotation
    // Size: 0x1
    // Offset: 0x9B
    bool divideRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideDivideRotation
    // Size: 0x1
    // Offset: 0x9C
    bool overrideDivideRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideDivideRotation and: forceVignetteMode
    char __padding30[0x3] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode _forceVignetteMode
    // Size: 0x4
    // Offset: 0xA0
    ::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode forceVignetteMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode) == 0x4);
    // private System.Boolean _overrideForceVignetteMode
    // Size: 0x1
    // Offset: 0xA4
    bool overrideForceVignetteMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideForceVignetteMode and: forceVignetteValue
    char __padding32[0x3] = {};
    // [RangeAttribute] Offset: 0x72BA44
    // private System.Single _forceVignetteValue
    // Size: 0x4
    // Offset: 0xA8
    float forceVignetteValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideForceVignetteValue
    // Size: 0x1
    // Offset: 0xAC
    bool overrideForceVignetteValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Boolean _overrideAll
    bool& dyn__overrideAll();
    // Get instance field reference: private System.Single _effectCoverage
    float& dyn__effectCoverage();
    // Get instance field reference: private System.Boolean _overrideEffectCoverage
    bool& dyn__overrideEffectCoverage();
    // Get instance field reference: private UnityEngine.Color _effectColor
    ::UnityEngine::Color& dyn__effectColor();
    // Get instance field reference: private System.Boolean _overrideEffectColor
    bool& dyn__overrideEffectColor();
    // Get instance field reference: private System.Single _effectFeather
    float& dyn__effectFeather();
