// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingBase
#include "Sigtrap/VrTunnellingPro/TunnellingBase.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.BackgroundMode
#include "Sigtrap/VrTunnellingPro/TunnellingBase_BackgroundMode.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MSAA
#include "Sigtrap/VrTunnellingPro/TunnellingBase_MSAA.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MaskMode
#include "Sigtrap/VrTunnellingPro/TunnellingBase_MaskMode.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: CameraEvent
  struct CameraEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: Sigtrap::VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Forward declaring type: TunnellingPreset
  class TunnellingPreset;
}
// Completed forward declares
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Forward declaring type: TunnellingImageBase
  class TunnellingImageBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Sigtrap::VrTunnellingPro::TunnellingImageBase);
DEFINE_IL2CPP_ARG_TYPE(::Sigtrap::VrTunnellingPro::TunnellingImageBase*, "Sigtrap.VrTunnellingPro", "TunnellingImageBase");
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Size: 0x338
  #pragma pack(push, 1)
  // Autogenerated type: Sigtrap.VrTunnellingPro.TunnellingImageBase
  // [TokenAttribute] Offset: FFFFFFFF
  class TunnellingImageBase : public ::Sigtrap::VrTunnellingPro::TunnellingBase {
    public:
    // Nested type: ::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel
    struct BlurKernel;
    // Nested type: ::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode
    struct CounterVelocityMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel
    // [TokenAttribute] Offset: FFFFFFFF
    struct BlurKernel/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BlurKernel
      constexpr BlurKernel(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel FIVE
      static constexpr const int FIVE = 0;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel FIVE
      static ::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel _get_FIVE();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel FIVE
      static void _set_FIVE(::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel value);
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel NINE
      static constexpr const int NINE = 1;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel NINE
      static ::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel _get_NINE();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel NINE
      static void _set_NINE(::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel value);
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel THIRTEEN
      static constexpr const int THIRTEEN = 2;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel THIRTEEN
      static ::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel _get_THIRTEEN();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel THIRTEEN
      static void _set_THIRTEEN(::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel
    #pragma pack(pop)
    static check_size<sizeof(TunnellingImageBase::BlurKernel), 0 + sizeof(int)> __Sigtrap_VrTunnellingPro_TunnellingImageBase_BlurKernelSizeCheck;
    static_assert(sizeof(TunnellingImageBase::BlurKernel) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct CounterVelocityMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CounterVelocityMode
      constexpr CounterVelocityMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode OFF
      static constexpr const int OFF = 0;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode OFF
      static ::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode _get_OFF();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode OFF
      static void _set_OFF(::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode value);
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode SHADER
      static constexpr const int SHADER = 1;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode SHADER
      static ::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode _get_SHADER();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode SHADER
      static void _set_SHADER(::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode value);
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode REAL
      static constexpr const int REAL = 2;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode REAL
      static ::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode _get_REAL();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode REAL
      static void _set_REAL(::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode
    #pragma pack(pop)
    static check_size<sizeof(TunnellingImageBase::CounterVelocityMode), 0 + sizeof(int)> __Sigtrap_VrTunnellingPro_TunnellingImageBase_CounterVelocityModeSizeCheck;
    static_assert(sizeof(TunnellingImageBase::CounterVelocityMode) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [TooltipAttribute] Offset: 0x72AEE0
    // public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.BackgroundMode backgroundMode
    // Size: 0x4
    // Offset: 0x1C8
    ::Sigtrap::VrTunnellingPro::TunnellingBase::BackgroundMode backgroundMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::BackgroundMode) == 0x4);
    // [RangeAttribute] Offset: 0x72AF18
    // [TooltipAttribute] Offset: 0x72AF18
    // public System.Single effectOverlay
    // Size: 0x4
    // Offset: 0x1CC
    float effectOverlay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x72AF6C
    // private UnityEngine.GameObject _cageParent
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::GameObject* cageParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [RangeAttribute] Offset: 0x72AFB8
    // public System.Int32 cageDownsample
    // Size: 0x4
    // Offset: 0x1D8
    int cageDownsample;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MSAA cageAntiAliasing
    // Size: 0x4
    // Offset: 0x1DC
    ::Sigtrap::VrTunnellingPro::TunnellingBase::MSAA cageAntiAliasing;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::MSAA) == 0x4);
    // public System.Boolean cageUpdateEveryFrame
    // Size: 0x1
    // Offset: 0x1E0
    bool cageUpdateEveryFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cageUpdateEveryFrame and: cageFogDensity
    char __padding5[0x3] = {};
    // [RangeAttribute] Offset: 0x72AFD0
    // public System.Single cageFogDensity
    // Size: 0x4
    // Offset: 0x1E4
    float cageFogDensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x72AFF0
    // public System.Single cageFogPower
    // Size: 0x4
    // Offset: 0x1E8
    float cageFogPower;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x72B008
    // public System.Single cageFogBlend
    // Size: 0x4
    // Offset: 0x1EC
    float cageFogBlend;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MaskMode maskMode
    // Size: 0x4
    // Offset: 0x1F0
    ::Sigtrap::VrTunnellingPro::TunnellingBase::MaskMode maskMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::MaskMode) == 0x4);
    // [RangeAttribute] Offset: 0x72B020
    // public System.Int32 blurDownsample
    // Size: 0x4
    // Offset: 0x1F4
    int blurDownsample;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x72B038
    // public System.Single blurDistance
    // Size: 0x4
    // Offset: 0x1F8
    float blurDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x72B050
    // public System.Int32 blurPasses
    // Size: 0x4
    // Offset: 0x1FC
    int blurPasses;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel blurSamples
    // Size: 0x4
    // Offset: 0x200
    ::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel blurSamples;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel) == 0x4);
    // [TooltipAttribute] Offset: 0x72B068
    // public System.Boolean irisZRejection
    // Size: 0x1
    // Offset: 0x204
    bool irisZRejection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: irisZRejection and: counterVelocityMode
    char __padding14[0x3] = {};
    // public Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode counterVelocityMode
    // Size: 0x4
    // Offset: 0x208
    ::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode counterVelocityMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode) == 0x4);
    // [TooltipAttribute] Offset: 0x72B0A0
    // public System.Single counterVelocityResetDistance
    // Size: 0x4
    // Offset: 0x20C
    float counterVelocityResetDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x72B0D8
    // public System.Single counterVelocityResetTime
    // Size: 0x4
    // Offset: 0x210
    float counterVelocityResetTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x72B110
    // [TooltipAttribute] Offset: 0x72B110
    // public System.Single counterVelocityStrength
    // Size: 0x4
    // Offset: 0x214
    float counterVelocityStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x72B164
    // public UnityEngine.Vector3 counterVelocityPerAxis
    // Size: 0xC
    // Offset: 0x218
    ::UnityEngine::Vector3 counterVelocityPerAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: counterVelocityPerAxis and: maskCmd
    char __padding19[0x4] = {};
    // private UnityEngine.Rendering.CommandBuffer _maskCmd
    // Size: 0x8
    // Offset: 0x228
    ::UnityEngine::Rendering::CommandBuffer* maskCmd;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // private UnityEngine.Material _matTunnel
    // Size: 0x8
    // Offset: 0x230
    ::UnityEngine::Material* matTunnel;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _matMask
    // Size: 0x8
    // Offset: 0x238
    ::UnityEngine::Material* matMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _matWindow
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::Material* matWindow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _matCopyAlpha
    // Size: 0x8
    // Offset: 0x248
    ::UnityEngine::Material* matCopyAlpha;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _matBlur
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::Material* matBlur;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material _matSkysphere
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::Material* matSkysphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Mesh _meshSkysphere
    // Size: 0x8
    // Offset: 0x260
    ::UnityEngine::Mesh* meshSkysphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.MeshRenderer[] _cageMrs
    // Size: 0x8
    // Offset: 0x268
    ::ArrayW<::UnityEngine::MeshRenderer*> cageMrs;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::MeshRenderer*>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.MeshFilter> _cageMfs
    // Size: 0x8
    // Offset: 0x270
    ::System::Collections::Generic::List_1<::UnityEngine::MeshFilter*>* cageMfs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::MeshFilter*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Renderer> _maskObjects
    // Size: 0x8
    // Offset: 0x278
    ::System::Collections::Generic::List_1<::UnityEngine::Renderer*>* maskObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Renderer*>*) == 0x8);
    // private UnityEngine.RenderTexture _cageRt
    // Size: 0x8
    // Offset: 0x280
    ::UnityEngine::RenderTexture* cageRt;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture _maskRt
    // Size: 0x8
    // Offset: 0x288
    ::UnityEngine::RenderTexture* maskRt;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture _blurRt0
    // Size: 0x8
    // Offset: 0x290
    ::UnityEngine::RenderTexture* blurRt0;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture _blurRt1
    // Size: 0x8
    // Offset: 0x298
    ::UnityEngine::RenderTexture* blurRt1;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private System.Int32 _rtX
    // Size: 0x4
    // Offset: 0x2A0
    int rtX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _rtY
    // Size: 0x4
    // Offset: 0x2A4
    int rtY;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _rtA
    // Size: 0x4
    // Offset: 0x2A8
    int rtA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: rtA and: irisCmd
    char __padding37[0x4] = {};
    // private UnityEngine.Rendering.CommandBuffer _irisCmd
    // Size: 0x8
    // Offset: 0x2B0
    ::UnityEngine::Rendering::CommandBuffer* irisCmd;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // private UnityEngine.Material _matIris
    // Size: 0x8
    // Offset: 0x2B8
    ::UnityEngine::Material* matIris;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Mesh _meshIris
    // Size: 0x8
    // Offset: 0x2C0
    ::UnityEngine::Mesh* meshIris;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Vector4[] _blurOffsets
    // Size: 0x8
    // Offset: 0x2C8
    ::ArrayW<::UnityEngine::Vector4> blurOffsets;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MaskMode _lastMaskMode
    // Size: 0x4
    // Offset: 0x2D0
    ::Sigtrap::VrTunnellingPro::TunnellingBase::MaskMode lastMaskMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::MaskMode) == 0x4);
    // private Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MSAA _lastCageMsaa
    // Size: 0x4
    // Offset: 0x2D4
    ::Sigtrap::VrTunnellingPro::TunnellingBase::MSAA lastCageMsaa;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::MSAA) == 0x4);
    // private System.Boolean _camHasMaskBuffer
    // Size: 0x1
    // Offset: 0x2D8
    bool camHasMaskBuffer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: camHasMaskBuffer and: lastCageDownsample
    char __padding44[0x3] = {};
    // private System.Int32 _lastCageDownsample
    // Size: 0x4
    // Offset: 0x2DC
    int lastCageDownsample;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lastBlurDownsample
    // Size: 0x4
    // Offset: 0x2E0
    int lastBlurDownsample;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _lastBlurRadius
    // Size: 0x4
    // Offset: 0x2E4
    float lastBlurRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel _lastBlurKernel
    // Size: 0x4
    // Offset: 0x2E8
    ::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel lastBlurKernel;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel) == 0x4);
    // private System.Boolean _wasDrawingIrisEarly
    // Size: 0x1
    // Offset: 0x2EC
    bool wasDrawingIrisEarly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _camHasIrisBuffer
    // Size: 0x1
    // Offset: 0x2ED
    bool camHasIrisBuffer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: camHasIrisBuffer and: lastCvMode
    char __padding50[0x2] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode _lastCvMode
    // Size: 0x4
    // Offset: 0x2F0
    ::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode lastCvMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode) == 0x4);
    // private UnityEngine.Vector3 _cmPos
    // Size: 0xC
    // Offset: 0x2F4
    ::UnityEngine::Vector3 cmPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _cageInitialPosLocal
    // Size: 0xC
    // Offset: 0x300
    ::UnityEngine::Vector3 cageInitialPosLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single _timeToResetCounterVelocity
    // Size: 0x4
    // Offset: 0x30C
    float timeToResetCounterVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 _propColor
    // Size: 0x4
    // Offset: 0x310
    int propColor;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _propBkgRt
    // Size: 0x4
    // Offset: 0x314
    int propBkgRt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _propMaskRt
    // Size: 0x4
    // Offset: 0x318
    int propMaskRt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _propSkybox
    // Size: 0x4
    // Offset: 0x31C
    int propSkybox;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _propOverlay
    // Size: 0x4
    // Offset: 0x320
    int propOverlay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _propBlur
    // Size: 0x4
    // Offset: 0x324
    int propBlur;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _propBlurOffsets
    // Size: 0x4
    // Offset: 0x328
    int propBlurOffsets;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _globPropWorld2Cage
    // Size: 0x4
    // Offset: 0x32C
    int globPropWorld2Cage;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _globPropWorld2CageNormal
    // Size: 0x4
    // Offset: 0x330
    int globPropWorld2CageNormal;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _globPropCagePos
    // Size: 0x4
    // Offset: 0x334
    int globPropCagePos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // static field const value: static private System.String KEYWORD_MASK
    static constexpr const char* KEYWORD_MASK = "TUNNEL_MASK";
    // Get static field: static private System.String KEYWORD_MASK
    static ::StringW _get_KEYWORD_MASK();
    // Set static field: static private System.String KEYWORD_MASK
    static void _set_KEYWORD_MASK(::StringW value);
    // static field const value: static private System.String KEYWORD_CONSTANT
    static constexpr const char* KEYWORD_CONSTANT = "TUNNEL_CONSTANT";
    // Get static field: static private System.String KEYWORD_CONSTANT
    static ::StringW _get_KEYWORD_CONSTANT();
    // Set static field: static private System.String KEYWORD_CONSTANT
    static void _set_KEYWORD_CONSTANT(::StringW value);
    // static field const value: static private System.String KEYWORD_INVERT
