// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingPresetBase
#include "Sigtrap/VrTunnellingPro/TunnellingPresetBase.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.BackgroundMode
#include "Sigtrap/VrTunnellingPro/TunnellingBase_BackgroundMode.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MSAA
#include "Sigtrap/VrTunnellingPro/TunnellingBase_MSAA.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MaskMode
#include "Sigtrap/VrTunnellingPro/TunnellingBase_MaskMode.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel
#include "Sigtrap/VrTunnellingPro/TunnellingImageBase.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode
// Already included the same include: Sigtrap/VrTunnellingPro/TunnellingImageBase.hpp
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Forward declaring type: TunnellingPreset
  class TunnellingPreset;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Sigtrap::VrTunnellingPro::TunnellingPreset);
DEFINE_IL2CPP_ARG_TYPE(::Sigtrap::VrTunnellingPro::TunnellingPreset*, "Sigtrap.VrTunnellingPro", "TunnellingPreset");
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Size: 0x13F
  #pragma pack(push, 1)
  // Autogenerated type: Sigtrap.VrTunnellingPro.TunnellingPreset
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: BDD60
  class TunnellingPreset : public ::Sigtrap::VrTunnellingPro::TunnellingPresetBase {
    public:
    // Writing base type padding for base size: 0xAD to desired offset: 0xB0
    char ___base_padding[0x3] = {};
    public:
    // [RangeAttribute] Offset: 0xBDE10
    // private System.Single _effectOverlay
    // Size: 0x4
    // Offset: 0xB0
    float effectOverlay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideEffectOverlay
    // Size: 0x1
    // Offset: 0xB4
    bool overrideEffectOverlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideEffectOverlay and: backgroundMode
    char __padding1[0x3] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.BackgroundMode _backgroundMode
    // Size: 0x4
    // Offset: 0xB8
    ::Sigtrap::VrTunnellingPro::TunnellingBase::BackgroundMode backgroundMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::BackgroundMode) == 0x4);
    // private System.Boolean _overrideBackgroundMode
    // Size: 0x1
    // Offset: 0xBC
    bool overrideBackgroundMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideBackgroundMode and: cageDownsample
    char __padding3[0x3] = {};
    // [RangeAttribute] Offset: 0xBDF90
    // private System.Int32 _cageDownsample
    // Size: 0x4
    // Offset: 0xC0
    int cageDownsample;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _overrideCageDownsample
    // Size: 0x1
    // Offset: 0xC4
    bool overrideCageDownsample;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCageDownsample and: cageAntiAliasing
    char __padding5[0x3] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MSAA _cageAntiAliasing
    // Size: 0x4
    // Offset: 0xC8
    ::Sigtrap::VrTunnellingPro::TunnellingBase::MSAA cageAntiAliasing;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::MSAA) == 0x4);
    // private System.Boolean _overrideCageAntiAliasing
    // Size: 0x1
    // Offset: 0xCC
    bool overrideCageAntiAliasing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _cageUpdateEveryFrame
    // Size: 0x1
    // Offset: 0xCD
    bool cageUpdateEveryFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideCageUpdateEveryFrame
    // Size: 0x1
    // Offset: 0xCE
    bool overrideCageUpdateEveryFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCageUpdateEveryFrame and: cageFogDensity
    char __padding9[0x1] = {};
    // [RangeAttribute] Offset: 0xBE180
    // private System.Single _cageFogDensity
    // Size: 0x4
    // Offset: 0xD0
    float cageFogDensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideCageFogDensity
    // Size: 0x1
    // Offset: 0xD4
    bool overrideCageFogDensity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCageFogDensity and: cageFogPower
    char __padding11[0x3] = {};
    // [RangeAttribute] Offset: 0xBE2C0
    // private System.Single _cageFogPower
    // Size: 0x4
    // Offset: 0xD8
    float cageFogPower;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideCageFogPower
    // Size: 0x1
    // Offset: 0xDC
    bool overrideCageFogPower;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCageFogPower and: cageFogBlend
    char __padding13[0x3] = {};
    // [RangeAttribute] Offset: 0xBDE10
    // private System.Single _cageFogBlend
    // Size: 0x4
    // Offset: 0xE0
    float cageFogBlend;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideCageFogBlend
    // Size: 0x1
    // Offset: 0xE4
    bool overrideCageFogBlend;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCageFogBlend and: maskMode
    char __padding15[0x3] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.MaskMode _maskMode
    // Size: 0x4
    // Offset: 0xE8
    ::Sigtrap::VrTunnellingPro::TunnellingBase::MaskMode maskMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::MaskMode) == 0x4);
    // private System.Boolean _overrideMaskMode
    // Size: 0x1
    // Offset: 0xEC
    bool overrideMaskMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideMaskMode and: blurDownsample
    char __padding17[0x3] = {};
    // [RangeAttribute] Offset: 0xBE4A0
    // private System.Int32 _blurDownsample
    // Size: 0x4
    // Offset: 0xF0
    int blurDownsample;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _overrideBlurDownsample
    // Size: 0x1
    // Offset: 0xF4
    bool overrideBlurDownsample;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideBlurDownsample and: blurDistance
    char __padding19[0x3] = {};
    // [RangeAttribute] Offset: 0xBE2C0
    // private System.Single _blurDistance
    // Size: 0x4
    // Offset: 0xF8
    float blurDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideBlurDistance
    // Size: 0x1
    // Offset: 0xFC
    bool overrideBlurDistance;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideBlurDistance and: blurPasses
    char __padding21[0x3] = {};
    // [RangeAttribute] Offset: 0xBE2C0
    // private System.Int32 _blurPasses
    // Size: 0x4
    // Offset: 0x100
    int blurPasses;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _overrideBlurPasses
    // Size: 0x1
    // Offset: 0x104
    bool overrideBlurPasses;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideBlurPasses and: blurSamples
    char __padding23[0x3] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.BlurKernel _blurSamples
    // Size: 0x4
    // Offset: 0x108
    ::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel blurSamples;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingImageBase::BlurKernel) == 0x4);
    // private System.Boolean _overrideBlurSamples
    // Size: 0x1
    // Offset: 0x10C
    bool overrideBlurSamples;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideBlurSamples and: counterVelocityMode
    char __padding25[0x3] = {};
    // private Sigtrap.VrTunnellingPro.TunnellingImageBase/Sigtrap.VrTunnellingPro.CounterVelocityMode _counterVelocityMode
    // Size: 0x4
    // Offset: 0x110
    ::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode counterVelocityMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingImageBase::CounterVelocityMode) == 0x4);
    // private System.Boolean _overrideCounterVelocityMode
    // Size: 0x1
    // Offset: 0x114
    bool overrideCounterVelocityMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCounterVelocityMode and: counterVelocityResetDistance
    char __padding27[0x3] = {};
    // private System.Single _counterVelocityResetDistance
    // Size: 0x4
    // Offset: 0x118
    float counterVelocityResetDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideCounterVelocityResetDistance
    // Size: 0x1
    // Offset: 0x11C
    bool overrideCounterVelocityResetDistance;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCounterVelocityResetDistance and: counterVelocityResetTime
    char __padding29[0x3] = {};
    // private System.Single _counterVelocityResetTime
    // Size: 0x4
    // Offset: 0x120
    float counterVelocityResetTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideCounterVelocityResetTime
    // Size: 0x1
    // Offset: 0x124
    bool overrideCounterVelocityResetTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCounterVelocityResetTime and: counterVelocityStrength
    char __padding31[0x3] = {};
    // [RangeAttribute] Offset: 0xBDF90
    // private System.Single _counterVelocityStrength
    // Size: 0x4
    // Offset: 0x128
    float counterVelocityStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _overrideCounterVelocityStrength
    // Size: 0x1
    // Offset: 0x12C
    bool overrideCounterVelocityStrength;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideCounterVelocityStrength and: counterVelocityPerAxis
    char __padding33[0x3] = {};
    // private UnityEngine.Vector3 _counterVelocityPerAxis
    // Size: 0xC
    // Offset: 0x130
    ::UnityEngine::Vector3 counterVelocityPerAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean _overrideCounterVelocityPerAxis
    // Size: 0x1
    // Offset: 0x13C
    bool overrideCounterVelocityPerAxis;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _irisZRejection
    // Size: 0x1
    // Offset: 0x13D
    bool irisZRejection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideIrisZRejection
    // Size: 0x1
    // Offset: 0x13E
    bool overrideIrisZRejection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Single _effectOverlay
    [[deprecated("Use field access instead!")]] float& dyn__effectOverlay();
    // Get instance field reference: private System.Boolean _overrideEffectOverlay
    [[deprecated("Use field access instead!")]] bool& dyn__overrideEffectOverlay();
    // Get instance field reference: private Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.BackgroundMode _backgroundMode
    [[deprecated("Use field access instead!")]] ::Sigtrap::VrTunnellingPro::TunnellingBase::BackgroundMode& dyn__backgroundMode();
    // Get instance field reference: private System.Boolean _overrideBackgroundMode
    [[deprecated("Use field access instead!")]] bool& dyn__overrideBackgroundMode();
    // Get instance field reference: private System.Int32 _cageDownsample
