// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Sigtrap.VrTunnellingPro.TunnellingPresetBase
#include "Sigtrap/VrTunnellingPro/TunnellingPresetBase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Forward declaring type: TunnellingPresetMobile
  class TunnellingPresetMobile;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Sigtrap::VrTunnellingPro::TunnellingPresetMobile);
DEFINE_IL2CPP_ARG_TYPE(::Sigtrap::VrTunnellingPro::TunnellingPresetMobile*, "Sigtrap.VrTunnellingPro", "TunnellingPresetMobile");
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Size: 0xC9
  #pragma pack(push, 1)
  // Autogenerated type: Sigtrap.VrTunnellingPro.TunnellingPresetMobile
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: 728820
  class TunnellingPresetMobile : public ::Sigtrap::VrTunnellingPro::TunnellingPresetBase {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean _drawSkybox
    // Size: 0x1
    // Offset: 0xAD
    bool drawSkybox;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideDrawSkybox
    // Size: 0x1
    // Offset: 0xAE
    bool overrideDrawSkybox;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _drawBeforeTransparent
    // Size: 0x1
    // Offset: 0xAF
    bool drawBeforeTransparent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideDrawBeforeTransparent
    // Size: 0x1
    // Offset: 0xB0
    bool overrideDrawBeforeTransparent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _useMask
    // Size: 0x1
    // Offset: 0xB1
    bool useMask;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _overrideUseMask
    // Size: 0x1
    // Offset: 0xB2
    bool overrideUseMask;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideUseMask and: stencilReference
    char __padding5[0x1] = {};
    // [RangeAttribute] Offset: 0x72BAF4
    // private System.Int32 _stencilReference
    // Size: 0x4
    // Offset: 0xB4
    int stencilReference;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _overrideStencilReference
    // Size: 0x1
    // Offset: 0xB8
    bool overrideStencilReference;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideStencilReference and: stencilMask
    char __padding7[0x3] = {};
    // [RangeAttribute] Offset: 0x72BB48
    // private System.Int32 _stencilMask
    // Size: 0x4
    // Offset: 0xBC
    int stencilMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _overrideStencilMask
    // Size: 0x1
    // Offset: 0xC0
    bool overrideStencilMask;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overrideStencilMask and: stencilBias
    char __padding9[0x3] = {};
    // [RangeAttribute] Offset: 0x72BB9C
    // private System.Int32 _stencilBias
    // Size: 0x4
    // Offset: 0xC4
    int stencilBias;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _overrideStencilBias
    // Size: 0x1
    // Offset: 0xC8
    bool overrideStencilBias;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Boolean _drawSkybox
    bool& dyn__drawSkybox();
    // Get instance field reference: private System.Boolean _overrideDrawSkybox
    bool& dyn__overrideDrawSkybox();
    // Get instance field reference: private System.Boolean _drawBeforeTransparent
    bool& dyn__drawBeforeTransparent();
    // Get instance field reference: private System.Boolean _overrideDrawBeforeTransparent
    bool& dyn__overrideDrawBeforeTransparent();
    // Get instance field reference: private System.Boolean _useMask
    bool& dyn__useMask();
    // Get instance field reference: private System.Boolean _overrideUseMask
    bool& dyn__overrideUseMask();
    // Get instance field reference: private System.Int32 _stencilReference
    int& dyn__stencilReference();
    // Get instance field reference: private System.Boolean _overrideStencilReference
    bool& dyn__overrideStencilReference();
    // Get instance field reference: private System.Int32 _stencilMask
    int& dyn__stencilMask();
    // Get instance field reference: private System.Boolean _overrideStencilMask
    bool& dyn__overrideStencilMask();
    // Get instance field reference: private System.Int32 _stencilBias
    int& dyn__stencilBias();
    // Get instance field reference: private System.Boolean _overrideStencilBias
    bool& dyn__overrideStencilBias();
    // public System.Boolean get_drawSkybox()
    // Offset: 0x10C2074
    bool get_drawSkybox();
    // public System.Boolean get_overrideDrawSkybox()
    // Offset: 0x10C0AE4
    bool get_overrideDrawSkybox();
    // public System.Boolean get_drawBeforeTransparent()
    // Offset: 0x10C207C
    bool get_drawBeforeTransparent();
    // public System.Boolean get_overrideDrawBeforeTransparent()
    // Offset: 0x10C2084
    bool get_overrideDrawBeforeTransparent();
    // public System.Boolean get_useMask()
    // Offset: 0x10C208C
    bool get_useMask();
    // public System.Boolean get_overrideUseMask()
    // Offset: 0x10C2094
    bool get_overrideUseMask();
    // public System.Int32 get_stencilReference()
    // Offset: 0x10C209C
    int get_stencilReference();
    // public System.Boolean get_overrideStencilReference()
    // Offset: 0x10C20A4
    bool get_overrideStencilReference();
    // public System.Int32 get_stencilMask()
    // Offset: 0x10C20AC
    int get_stencilMask();
    // public System.Boolean get_overrideStencilMask()
    // Offset: 0x10C20B4
    bool get_overrideStencilMask();
    // public System.Int32 get_stencilBias()
    // Offset: 0x10C20BC
    int get_stencilBias();
    // public System.Boolean get_overrideStencilBias()
    // Offset: 0x10C20C4
    bool get_overrideStencilBias();
    // public System.Void .ctor()
    // Offset: 0x10C20CC
    // Implemented from: Sigtrap.VrTunnellingPro.TunnellingPresetBase
    // Base method: System.Void TunnellingPresetBase::.ctor()
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TunnellingPresetMobile* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Sigtrap::VrTunnellingPro::TunnellingPresetMobile::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TunnellingPresetMobile*, creationType>()));
    }
  }; // Sigtrap.VrTunnellingPro.TunnellingPresetMobile
  #pragma pack(pop)
  static check_size<sizeof(TunnellingPresetMobile), 200 + sizeof(bool)> __Sigtrap_VrTunnellingPro_TunnellingPresetMobileSizeCheck;
  static_assert(sizeof(TunnellingPresetMobile) == 0xC9);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_drawSkybox
// Il2CppName: get_drawSkybox
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_drawSkybox)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_drawSkybox", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideDrawSkybox
// Il2CppName: get_overrideDrawSkybox
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideDrawSkybox)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_overrideDrawSkybox", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_drawBeforeTransparent
// Il2CppName: get_drawBeforeTransparent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_drawBeforeTransparent)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_drawBeforeTransparent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideDrawBeforeTransparent
// Il2CppName: get_overrideDrawBeforeTransparent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideDrawBeforeTransparent)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_overrideDrawBeforeTransparent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_useMask
// Il2CppName: get_useMask
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_useMask)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_useMask", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideUseMask
// Il2CppName: get_overrideUseMask
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideUseMask)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_overrideUseMask", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_stencilReference
// Il2CppName: get_stencilReference
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_stencilReference)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_stencilReference", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideStencilReference
// Il2CppName: get_overrideStencilReference
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideStencilReference)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_overrideStencilReference", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_stencilMask
// Il2CppName: get_stencilMask
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_stencilMask)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_stencilMask", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideStencilMask
// Il2CppName: get_overrideStencilMask
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideStencilMask)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_overrideStencilMask", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_stencilBias
// Il2CppName: get_stencilBias
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_stencilBias)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_stencilBias", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideStencilBias
// Il2CppName: get_overrideStencilBias
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Sigtrap::VrTunnellingPro::TunnellingPresetMobile::*)()>(&Sigtrap::VrTunnellingPro::TunnellingPresetMobile::get_overrideStencilBias)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Sigtrap::VrTunnellingPro::TunnellingPresetMobile*), "get_overrideStencilBias", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Sigtrap::VrTunnellingPro::TunnellingPresetMobile::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
