// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: Sigtrap.VrTunnellingPro.Angle3
#include "Sigtrap/VrTunnellingPro/Angle3.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Sigtrap::VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Forward declaring type: TunnellingPresetBase
  class TunnellingPresetBase;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Cubemap
  class Cubemap;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Forward declaring type: TunnellingBase
  class TunnellingBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Sigtrap::VrTunnellingPro::TunnellingBase);
DEFINE_IL2CPP_ARG_TYPE(::Sigtrap::VrTunnellingPro::TunnellingBase*, "Sigtrap.VrTunnellingPro", "TunnellingBase");
// Type namespace: Sigtrap.VrTunnellingPro
namespace Sigtrap::VrTunnellingPro {
  // Size: 0x1C8
  #pragma pack(push, 1)
  // Autogenerated type: Sigtrap.VrTunnellingPro.TunnellingBase
  // [TokenAttribute] Offset: FFFFFFFF
  class TunnellingBase : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Sigtrap::VrTunnellingPro::TunnellingBase::BackgroundMode
    struct BackgroundMode;
    // Nested type: ::Sigtrap::VrTunnellingPro::TunnellingBase::MaskMode
    struct MaskMode;
    // Nested type: ::Sigtrap::VrTunnellingPro::TunnellingBase::MSAA
    struct MSAA;
    // Nested type: ::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode
    struct ForceVignetteMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct ForceVignetteMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ForceVignetteMode
      constexpr ForceVignetteMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode NONE
      static constexpr const int NONE = 0;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode NONE
      static ::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode _get_NONE();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode NONE
      static void _set_NONE(::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode value);
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode CONSTANT
      static constexpr const int CONSTANT = 10;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode CONSTANT
      static ::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode _get_CONSTANT();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode CONSTANT
      static void _set_CONSTANT(::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode value);
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode MAX
      static constexpr const int MAX = 20;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode MAX
      static ::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode _get_MAX();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode MAX
      static void _set_MAX(::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode value);
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode MIN
      static constexpr const int MIN = 30;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode MIN
      static ::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode _get_MIN();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode MIN
      static void _set_MIN(::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode value);
      // static field const value: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode ADD
      static constexpr const int ADD = 40;
      // Get static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode ADD
      static ::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode _get_ADD();
      // Set static field: static public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode ADD
      static void _set_ADD(::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode
    #pragma pack(pop)
    static check_size<sizeof(TunnellingBase::ForceVignetteMode), 0 + sizeof(int)> __Sigtrap_VrTunnellingPro_TunnellingBase_ForceVignetteModeSizeCheck;
    static_assert(sizeof(TunnellingBase::ForceVignetteMode) == 0x4);
    public:
    // protected System.Int32 _propFxInner
    // Size: 0x4
    // Offset: 0x18
    int propFxInner;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _propFxOuter
    // Size: 0x4
    // Offset: 0x1C
    int propFxOuter;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _propEyeProjection
    // Size: 0x4
    // Offset: 0x20
    int propEyeProjection;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _propEyeToWorld
    // Size: 0x4
    // Offset: 0x24
    int propEyeToWorld;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _globPropFogColor
    // Size: 0x4
    // Offset: 0x28
    int globPropFogColor;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _globPropFogDensity
    // Size: 0x4
    // Offset: 0x2C
    int globPropFogDensity;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _globPropFogPower
    // Size: 0x4
    // Offset: 0x30
    int globPropFogPower;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _globPropFogBlend
    // Size: 0x4
    // Offset: 0x34
    int globPropFogBlend;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Matrix4x4[] _eyeToWorld
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Matrix4x4> eyeToWorld;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Matrix4x4>) == 0x8);
    // private UnityEngine.Matrix4x4[] _eyeProjection
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Matrix4x4> eyeProjection;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Matrix4x4>) == 0x8);
    // [TooltipAttribute] Offset: 0x10A290
    // public UnityEngine.Transform motionTarget
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* motionTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x10A2F0
    // public UnityEngine.Color effectColor
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Color effectColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0x10A320
    // [TooltipAttribute] Offset: 0x10A320
    // public System.Single effectCoverage
    // Size: 0x4
    // Offset: 0x60
    float effectCoverage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x10A370
    // [TooltipAttribute] Offset: 0x10A370
    // public System.Single effectFeather
    // Size: 0x4
    // Offset: 0x64
    float effectFeather;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Cubemap effectSkybox
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Cubemap* effectSkybox;
    // Field size check
    static_assert(sizeof(::UnityEngine::Cubemap*) == 0x8);
    // public System.Boolean applyColorToBackground
    // Size: 0x1
    // Offset: 0x70
    bool applyColorToBackground;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x10A3C0
    // public System.Boolean useAngularVelocity
    // Size: 0x1
    // Offset: 0x71
    bool useAngularVelocity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useAngularVelocity and: angularVelocityStrength
    char __padding16[0x2] = {};
    // [RangeAttribute] Offset: 0xBB8C0
    // public System.Single angularVelocityStrength
    // Size: 0x4
    // Offset: 0x74
    float angularVelocityStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single angularVelocityMin
    // Size: 0x4
    // Offset: 0x78
    float angularVelocityMin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single angularVelocityMax
    // Size: 0x4
    // Offset: 0x7C
    float angularVelocityMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single angularVelocitySmoothing
    // Size: 0x4
    // Offset: 0x80
    float angularVelocitySmoothing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x10A470
    // public System.Boolean useAcceleration
    // Size: 0x1
    // Offset: 0x84
    bool useAcceleration;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useAcceleration and: accelerationStrength
    char __padding21[0x3] = {};
    // [RangeAttribute] Offset: 0xBB8C0
    // public System.Single accelerationStrength
    // Size: 0x4
    // Offset: 0x88
    float accelerationStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single accelerationMin
    // Size: 0x4
    // Offset: 0x8C
    float accelerationMin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single accelerationMax
    // Size: 0x4
    // Offset: 0x90
    float accelerationMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single accelerationSmoothing
    // Size: 0x4
    // Offset: 0x94
    float accelerationSmoothing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x10A4A0
    // public System.Boolean useVelocity
    // Size: 0x1
    // Offset: 0x98
    bool useVelocity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useVelocity and: velocityStrength
    char __padding26[0x3] = {};
    // [RangeAttribute] Offset: 0xBB8C0
    // public System.Single velocityStrength
    // Size: 0x4
    // Offset: 0x9C
    float velocityStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single velocityMin
    // Size: 0x4
    // Offset: 0xA0
    float velocityMin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single velocityMax
    // Size: 0x4
    // Offset: 0xA4
    float velocityMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single velocitySmoothing
    // Size: 0x4
    // Offset: 0xA8
    float velocitySmoothing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0x10A520
    // public Sigtrap.VrTunnellingPro.TunnellingBase/Sigtrap.VrTunnellingPro.ForceVignetteMode forceVignetteMode
    // Size: 0x4
    // Offset: 0xAC
    ::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode forceVignetteMode;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::TunnellingBase::ForceVignetteMode) == 0x4);
    // [RangeAttribute] Offset: 0x10A5A0
    // [TooltipAttribute] Offset: 0x10A5A0
    // public System.Single forceVignetteValue
    // Size: 0x4
    // Offset: 0xB0
    float forceVignetteValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: forceVignetteValue and: motionEffectTarget
    char __padding32[0x4] = {};
    // [TooltipAttribute] Offset: 0x10A630
    // public UnityEngine.Transform motionEffectTarget
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Transform* motionEffectTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0x10A660
    // public System.Boolean useCounterMotion
    // Size: 0x1
    // Offset: 0xC0
    bool useCounterMotion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useCounterMotion and: counterRotationStrength
    char __padding34[0x3] = {};
    // [RangeAttribute] Offset: 0xBB220
    // [TooltipAttribute] Offset: 0xBB220
    // public System.Single counterRotationStrength
    // Size: 0x4
    // Offset: 0xC4
    float counterRotationStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xBB2C0
    // public UnityEngine.Vector3 counterRotationPerAxis
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::Vector3 counterRotationPerAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xBB350
    // public System.Boolean useArtificialTilt
    // Size: 0x1
    // Offset: 0xD4
    bool useArtificialTilt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useArtificialTilt and: tiltStrength
    char __padding37[0x3] = {};
    // [TooltipAttribute] Offset: 0xBB3E0
    // public System.Single tiltStrength
    // Size: 0x4
    // Offset: 0xD8
    float tiltStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xBB410
    // public UnityEngine.Vector2 tiltMaxAngles
    // Size: 0x8
    // Offset: 0xDC
    ::UnityEngine::Vector2 tiltMaxAngles;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // [RangeAttribute] Offset: 0xBB4A0
    // [TooltipAttribute] Offset: 0xBB4A0
    // public System.Single tiltSmoothTime
    // Size: 0x4
    // Offset: 0xE4
    float tiltSmoothTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xBB520
    // [TooltipAttribute] Offset: 0xBB520
    // public System.Int32 framerateDivision
    // Size: 0x4
    // Offset: 0xE8
    int framerateDivision;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean divideTranslation
    // Size: 0x1
    // Offset: 0xEC
    bool divideTranslation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean divideRotation
    // Size: 0x1
    // Offset: 0xED
    bool divideRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: divideRotation and: lastRot
    char __padding43[0x2] = {};
    // private UnityEngine.Quaternion _lastRot
    // Size: 0x10
    // Offset: 0xF0
    ::UnityEngine::Quaternion lastRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 _lastFwd
    // Size: 0xC
    // Offset: 0x100
    ::UnityEngine::Vector3 lastFwd;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _lastPos
    // Size: 0xC
    // Offset: 0x10C
    ::UnityEngine::Vector3 lastPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single _lastSpeed
    // Size: 0x4
    // Offset: 0x118
    float lastSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _lastVel
    // Size: 0xC
    // Offset: 0x11C
    ::UnityEngine::Vector3 lastVel;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Quaternion _cmRot
    // Size: 0x10
    // Offset: 0x128
    ::UnityEngine::Quaternion cmRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single _avSmoothed
    // Size: 0x4
    // Offset: 0x138
    float avSmoothed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _avSlew
    // Size: 0x4
    // Offset: 0x13C
    float avSlew;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _speedSmoothed
    // Size: 0x4
    // Offset: 0x140
    float speedSmoothed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _speedSlew
    // Size: 0x4
    // Offset: 0x144
    float speedSlew;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _accelSmoothed
    // Size: 0x4
    // Offset: 0x148
    float accelSmoothed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _accelSlew
    // Size: 0x4
    // Offset: 0x14C
    float accelSlew;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform _prevMotionEffectTarget
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::Transform* prevMotionEffectTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Boolean _prevUseTilt
    // Size: 0x1
    // Offset: 0x158
    bool prevUseTilt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: prevUseTilt and: tiltAccelSmoothed
    char __padding57[0x3] = {};
    // private UnityEngine.Vector3 _tiltAccelSmoothed
    // Size: 0xC
    // Offset: 0x15C
    ::UnityEngine::Vector3 tiltAccelSmoothed;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _tiltAccelSlew
    // Size: 0xC
    // Offset: 0x168
    ::UnityEngine::Vector3 tiltAccelSlew;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private Sigtrap.VrTunnellingPro.Angle3 _tiltInit
    // Size: 0xC
    // Offset: 0x174
    ::Sigtrap::VrTunnellingPro::Angle3 tiltInit;
    // Field size check
    static_assert(sizeof(::Sigtrap::VrTunnellingPro::Angle3) == 0xC);
    // private System.Int32 _lastFpsDivision
    // Size: 0x4
    // Offset: 0x180
    int lastFpsDivision;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 _mfxTgtLocalPosInit
    // Size: 0xC
    // Offset: 0x184
    ::UnityEngine::Vector3 mfxTgtLocalPosInit;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion _mfxTgtLocalRotInit
    // Size: 0x10
    // Offset: 0x190
    ::UnityEngine::Quaternion mfxTgtLocalRotInit;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // protected UnityEngine.Camera _cam
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::Camera* cam;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // protected System.Boolean _hasDrawnThisFrame
    // Size: 0x1
    // Offset: 0x1A8
    bool hasDrawnThisFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasDrawnThisFrame and: fpsPosition
    char __padding65[0x3] = {};
    // private UnityEngine.Vector3 _fpsPosition
    // Size: 0xC
    // Offset: 0x1AC
    ::UnityEngine::Vector3 fpsPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion _fpsRotation
    // Size: 0x10
    // Offset: 0x1B8
    ::UnityEngine::Quaternion fpsRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.String VRTP_VERSION
    static constexpr const char* VRTP_VERSION = "1.4.0";
    // Get static field: static public System.String VRTP_VERSION
    static ::StringW _get_VRTP_VERSION();
    // Set static field: static public System.String VRTP_VERSION
    static void _set_VRTP_VERSION(::StringW value);
    // static field const value: static public System.Int32 VRTP_VERSION_MAJOR
    static constexpr const int VRTP_VERSION_MAJOR = 1;
    // Get static field: static public System.Int32 VRTP_VERSION_MAJOR
    static int _get_VRTP_VERSION_MAJOR();
    // Set static field: static public System.Int32 VRTP_VERSION_MAJOR
