// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Normal.Realtime.Room
#include "Normal/Realtime/Room.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeModel
  class RealtimeModel;
  // Forward declaring type: RealtimeView
  class RealtimeView;
  // Forward declaring type: Datastore
  class Datastore;
  // Forward declaring type: RealtimeViewModel
  class RealtimeViewModel;
}
// Forward declaring namespace: Normal
namespace Normal {
  // Forward declaring type: NormcoreAppSettings
  class NormcoreAppSettings;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IReadOnlyCollection`1<T>
  template<typename T>
  class IReadOnlyCollection_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Normal::Realtime::Serialization
namespace Normal::Realtime::Serialization {
  // Forward declaring type: IModel
  class IModel;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Forward declaring type: Realtime
  class Realtime;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Normal::Realtime::Realtime);
DEFINE_IL2CPP_ARG_TYPE(::Normal::Realtime::Realtime*, "Normal.Realtime", "Realtime");
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: Normal.Realtime.Realtime
  // [TokenAttribute] Offset: FFFFFFFF
  class Realtime : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Normal::Realtime::Realtime::InstantiateOptions
    struct InstantiateOptions;
    // Nested type: ::Normal::Realtime::Realtime::RealtimeEvent
    class RealtimeEvent;
    // Nested type: ::Normal::Realtime::Realtime::$$c__DisplayClass81_0
    class $$c__DisplayClass81_0;
    // Nested type: ::Normal::Realtime::Realtime::$$c__DisplayClass81_1
    class $$c__DisplayClass81_1;
    // Nested type: ::Normal::Realtime::Realtime::$ConnectSceneViewsToDatastoreTimeout$d__84
    class $ConnectSceneViewsToDatastoreTimeout$d__84;
    // Nested type: ::Normal::Realtime::Realtime::$$c__DisplayClass85_0
    class $$c__DisplayClass85_0;
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Normal.Realtime.Realtime/Normal.Realtime.InstantiateOptions
    // [TokenAttribute] Offset: FFFFFFFF
    struct InstantiateOptions/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Nullable`1<System.Boolean> ownedByClient
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      ::System::Nullable_1<bool> ownedByClient;
      // public System.Nullable`1<System.Boolean> preventOwnershipTakeover
      // Size: 0xFFFFFFFF
      // Offset: 0x2
      ::System::Nullable_1<bool> preventOwnershipTakeover;
      // public System.Nullable`1<System.Boolean> destroyWhenOwnerLeaves
      // Size: 0xFFFFFFFF
      // Offset: 0x4
      ::System::Nullable_1<bool> destroyWhenOwnerLeaves;
      // public System.Nullable`1<System.Boolean> destroyWhenLastClientLeaves
      // Size: 0xFFFFFFFF
      // Offset: 0x6
      ::System::Nullable_1<bool> destroyWhenLastClientLeaves;
      // public Normal.Realtime.Realtime useInstance
      // Size: 0x8
      // Offset: 0x8
      ::Normal::Realtime::Realtime* useInstance;
      // Field size check
      static_assert(sizeof(::Normal::Realtime::Realtime*) == 0x8);
      public:
      // Creating value type constructor for type: InstantiateOptions
      constexpr InstantiateOptions(::System::Nullable_1<bool> ownedByClient_ = {}, ::System::Nullable_1<bool> preventOwnershipTakeover_ = {}, ::System::Nullable_1<bool> destroyWhenOwnerLeaves_ = {}, ::System::Nullable_1<bool> destroyWhenLastClientLeaves_ = {}, ::Normal::Realtime::Realtime* useInstance_ = {}) noexcept : ownedByClient{ownedByClient_}, preventOwnershipTakeover{preventOwnershipTakeover_}, destroyWhenOwnerLeaves{destroyWhenOwnerLeaves_}, destroyWhenLastClientLeaves{destroyWhenLastClientLeaves_}, useInstance{useInstance_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get static field: static public readonly Normal.Realtime.Realtime/Normal.Realtime.InstantiateOptions defaults
      static ::Normal::Realtime::Realtime::InstantiateOptions _get_defaults();
      // Set static field: static public readonly Normal.Realtime.Realtime/Normal.Realtime.InstantiateOptions defaults
      static void _set_defaults(::Normal::Realtime::Realtime::InstantiateOptions value);
      // Get instance field reference: public System.Nullable`1<System.Boolean> ownedByClient
      [[deprecated]] ::System::Nullable_1<bool>& dyn_ownedByClient();
      // Get instance field reference: public System.Nullable`1<System.Boolean> preventOwnershipTakeover
      [[deprecated]] ::System::Nullable_1<bool>& dyn_preventOwnershipTakeover();
      // Get instance field reference: public System.Nullable`1<System.Boolean> destroyWhenOwnerLeaves
      [[deprecated]] ::System::Nullable_1<bool>& dyn_destroyWhenOwnerLeaves();
      // Get instance field reference: public System.Nullable`1<System.Boolean> destroyWhenLastClientLeaves
      [[deprecated]] ::System::Nullable_1<bool>& dyn_destroyWhenLastClientLeaves();
      // Get instance field reference: public Normal.Realtime.Realtime useInstance
      [[deprecated]] ::Normal::Realtime::Realtime*& dyn_useInstance();
      // static private System.Void .cctor()
      // Offset: 0x8B9210
      static void _cctor();
    }; // Normal.Realtime.Realtime/Normal.Realtime.InstantiateOptions
    // WARNING Not writing size check since size may be invalid!
    public:
    // private Normal.Realtime.Realtime/Normal.Realtime.RealtimeEvent didConnectToRoom
    // Size: 0x8
    // Offset: 0x18
    ::Normal::Realtime::Realtime::RealtimeEvent* didConnectToRoom;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Realtime::RealtimeEvent*) == 0x8);
    // private Normal.Realtime.Realtime/Normal.Realtime.RealtimeEvent didDisconnectFromRoom
    // Size: 0x8
    // Offset: 0x20
    ::Normal::Realtime::Realtime::RealtimeEvent* didDisconnectFromRoom;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Realtime::RealtimeEvent*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xFF950
    // private System.String _obsoleteAppKey
    // Size: 0x8
    // Offset: 0x28
    ::StringW obsoleteAppKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Normal.NormcoreAppSettings _normcoreAppSettings
    // Size: 0x8
    // Offset: 0x30
    ::Normal::NormcoreAppSettings* normcoreAppSettings;
    // Field size check
    static_assert(sizeof(::Normal::NormcoreAppSettings*) == 0x8);
    // private System.String _roomToJoinOnStart
    // Size: 0x8
    // Offset: 0x38
    ::StringW roomToJoinOnStart;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _joinRoomOnStart
    // Size: 0x1
    // Offset: 0x40
    bool joinRoomOnStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: joinRoomOnStart and: room
    char __padding5[0x7] = {};
    // private Normal.Realtime.Room _room
    // Size: 0x8
    // Offset: 0x48
    ::Normal::Realtime::Room* room;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room*) == 0x8);
    // private System.Collections.Generic.HashSet`1<Normal.Realtime.RealtimeView> _sceneViews
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::HashSet_1<::Normal::Realtime::RealtimeView*>* sceneViews;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::Normal::Realtime::RealtimeView*>*) == 0x8);
    // private System.Boolean _sceneViewsConnected
    // Size: 0x1
    // Offset: 0x58
    bool sceneViewsConnected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sceneViewsConnected and: prefabViews
    char __padding8[0x7] = {};
    // private System.Collections.Generic.HashSet`1<Normal.Realtime.RealtimeView> _prefabViews
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::HashSet_1<::Normal::Realtime::RealtimeView*>* prefabViews;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::Normal::Realtime::RealtimeView*>*) == 0x8);
    // private UnityEngine.GameObject _lastPrefabInstantiated
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* lastPrefabInstantiated;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Coroutine _connectSceneViewsTimeoutRoutine
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Coroutine* connectSceneViewsTimeoutRoutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private readonly System.Collections.Generic.HashSet`1<Normal.Realtime.Realtime> __instances
    static ::System::Collections::Generic::HashSet_1<::Normal::Realtime::Realtime*>* _get___instances();
    // Set static field: static private readonly System.Collections.Generic.HashSet`1<Normal.Realtime.Realtime> __instances
    static void _set___instances(::System::Collections::Generic::HashSet_1<::Normal::Realtime::Realtime*>* value);
    // static field const value: static private System.String UNSUPPORTED_INSTANTIATE_MESSAGE
