// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Normal.Realtime.IRealtimeTransformStrategy
#include "Normal/Realtime/IRealtimeTransformStrategy.hpp"
// Including type: Normal.Realtime.RigidbodyPhysicsBodyFrame
#include "Normal/Realtime/RigidbodyPhysicsBodyFrame.hpp"
// Including type: Normal.Realtime.RigidbodyPhysicsStateFrame
#include "Normal/Realtime/RigidbodyPhysicsStateFrame.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeTransform
  class RealtimeTransform;
  // Forward declaring type: Timeline`1<T>
  template<typename T>
  class Timeline_1;
  // Forward declaring type: InterpolationDelay
  class InterpolationDelay;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Skipping declaration: Quaternion because it is already included!
  // Forward declaring type: Collision
  class Collision;
}
// Completed forward declares
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeTransformRigidbody
  class RealtimeTransformRigidbody;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Normal::Realtime::RealtimeTransformRigidbody);
DEFINE_IL2CPP_ARG_TYPE(::Normal::Realtime::RealtimeTransformRigidbody*, "Normal.Realtime", "RealtimeTransformRigidbody");
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Size: 0x5C
  #pragma pack(push, 1)
  // Autogenerated type: Normal.Realtime.RealtimeTransformRigidbody
  // [TokenAttribute] Offset: FFFFFFFF
  class RealtimeTransformRigidbody : public ::Il2CppObject/*, public ::Normal::Realtime::IRealtimeTransformStrategy*/ {
    public:
    public:
    // private readonly Normal.Realtime.RealtimeTransform _component
    // Size: 0x8
    // Offset: 0x10
    ::Normal::Realtime::RealtimeTransform* component;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeTransform*) == 0x8);
    // private readonly UnityEngine.Rigidbody _rigidbody
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rigidbody* rigidbody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private readonly Normal.Realtime.Timeline`1<Normal.Realtime.RigidbodyPhysicsBodyFrame> _physicsBodyTimeline
    // Size: 0x8
    // Offset: 0x20
    ::Normal::Realtime::Timeline_1<::Normal::Realtime::RigidbodyPhysicsBodyFrame>* physicsBodyTimeline;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Timeline_1<::Normal::Realtime::RigidbodyPhysicsBodyFrame>*) == 0x8);
    // private readonly Normal.Realtime.Timeline`1<Normal.Realtime.RigidbodyPhysicsStateFrame> _physicsStateTimeline
    // Size: 0x8
    // Offset: 0x28
    ::Normal::Realtime::Timeline_1<::Normal::Realtime::RigidbodyPhysicsStateFrame>* physicsStateTimeline;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Timeline_1<::Normal::Realtime::RigidbodyPhysicsStateFrame>*) == 0x8);
    // private readonly Normal.Realtime.InterpolationDelay _delay
    // Size: 0x8
    // Offset: 0x30
    ::Normal::Realtime::InterpolationDelay* delay;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::InterpolationDelay*) == 0x8);
    // private System.Double _fixedRoomTime
    // Size: 0x8
    // Offset: 0x38
    double fixedRoomTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Boolean _fixedRoomTimeInitialized
    // Size: 0x1
    // Offset: 0x40
    bool fixedRoomTimeInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fixedRoomTimeInitialized and: velocityPrevWrite
    char __padding6[0x3] = {};
    // private UnityEngine.Vector3 _velocityPrevWrite
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 velocityPrevWrite;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _angularVelocityPrevWrite
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 angularVelocityPrevWrite;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Creating interface conversion operator: operator ::Normal::Realtime::IRealtimeTransformStrategy
    operator ::Normal::Realtime::IRealtimeTransformStrategy() noexcept {
      return *reinterpret_cast<::Normal::Realtime::IRealtimeTransformStrategy*>(this);
    }
    // Get instance field reference: private readonly Normal.Realtime.RealtimeTransform _component
    [[deprecated]] ::Normal::Realtime::RealtimeTransform*& dyn__component();
    // Get instance field reference: private readonly UnityEngine.Rigidbody _rigidbody
    [[deprecated]] ::UnityEngine::Rigidbody*& dyn__rigidbody();
    // Get instance field reference: private readonly Normal.Realtime.Timeline`1<Normal.Realtime.RigidbodyPhysicsBodyFrame> _physicsBodyTimeline
