// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Normal.Realtime.RealtimeModel
#include "Normal/Realtime/RealtimeModel.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: UnreliableProperty`1<T>
  template<typename T>
  class UnreliableProperty_1;
  // Forward declaring type: ReliableProperty`1<T>
  template<typename T>
  class ReliableProperty_1;
  // Skipping declaration: PhysicsState because it is already included!
}
// Forward declaring namespace: Normal::Realtime::Serialization
namespace Normal::Realtime::Serialization {
  // Skipping declaration: StreamContext because it is already included!
  // Forward declaring type: WriteStream
  class WriteStream;
  // Forward declaring type: ReadStream
  class ReadStream;
}
// Completed forward declares
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeTransformModel
  class RealtimeTransformModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Normal::Realtime::RealtimeTransformModel);
DEFINE_IL2CPP_ARG_TYPE(::Normal::Realtime::RealtimeTransformModel*, "Normal.Realtime", "RealtimeTransformModel");
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Size: 0x138
  #pragma pack(push, 1)
  // Autogenerated type: Normal.Realtime.RealtimeTransformModel
  // [TokenAttribute] Offset: FFFFFFFF
  // [RealtimeModelAttribute] Offset: 715B9C
  class RealtimeTransformModel : public ::Normal::Realtime::RealtimeModel {
    public:
    // Nested type: ::Normal::Realtime::RealtimeTransformModel::PhysicsState
    struct PhysicsState;
    // Nested type: ::Normal::Realtime::RealtimeTransformModel::TransformWriteHandler
    class TransformWriteHandler;
    // Nested type: ::Normal::Realtime::RealtimeTransformModel::TransformReadHandler
    class TransformReadHandler;
    // Nested type: ::Normal::Realtime::RealtimeTransformModel::PropertyID
    struct PropertyID;
    // Nested type: ::Normal::Realtime::RealtimeTransformModel::PropertyChangeSet
    class PropertyChangeSet;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct PhysicsState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: PhysicsState
      constexpr PhysicsState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState Default
      static constexpr const int Default = 0;
      // Get static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState Default
      static ::Normal::Realtime::RealtimeTransformModel::PhysicsState _get_Default();
      // Set static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState Default
      static void _set_Default(::Normal::Realtime::RealtimeTransformModel::PhysicsState value);
      // static field const value: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState ShouldExtrapolate
      static constexpr const int ShouldExtrapolate = 1;
      // Get static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState ShouldExtrapolate
      static ::Normal::Realtime::RealtimeTransformModel::PhysicsState _get_ShouldExtrapolate();
      // Set static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState ShouldExtrapolate
      static void _set_ShouldExtrapolate(::Normal::Realtime::RealtimeTransformModel::PhysicsState value);
      // static field const value: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState UseGravity
      static constexpr const int UseGravity = 2;
      // Get static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState UseGravity
      static ::Normal::Realtime::RealtimeTransformModel::PhysicsState _get_UseGravity();
      // Set static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState UseGravity
      static void _set_UseGravity(::Normal::Realtime::RealtimeTransformModel::PhysicsState value);
      // static field const value: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState IsKinematic
      static constexpr const int IsKinematic = 4;
      // Get static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState IsKinematic
      static ::Normal::Realtime::RealtimeTransformModel::PhysicsState _get_IsKinematic();
      // Set static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState IsKinematic
      static void _set_IsKinematic(::Normal::Realtime::RealtimeTransformModel::PhysicsState value);
      // static field const value: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState IsSleeping
      static constexpr const int IsSleeping = 8;
      // Get static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState IsSleeping
      static ::Normal::Realtime::RealtimeTransformModel::PhysicsState _get_IsSleeping();
      // Set static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState IsSleeping
      static void _set_IsSleeping(::Normal::Realtime::RealtimeTransformModel::PhysicsState value);
      // static field const value: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState MaintainOwnershipWhileSleeping
      static constexpr const int MaintainOwnershipWhileSleeping = 16;
      // Get static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState MaintainOwnershipWhileSleeping
      static ::Normal::Realtime::RealtimeTransformModel::PhysicsState _get_MaintainOwnershipWhileSleeping();
      // Set static field: static public Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState MaintainOwnershipWhileSleeping
      static void _set_MaintainOwnershipWhileSleeping(::Normal::Realtime::RealtimeTransformModel::PhysicsState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState
    #pragma pack(pop)
    static check_size<sizeof(RealtimeTransformModel::PhysicsState), 0 + sizeof(int)> __Normal_Realtime_RealtimeTransformModel_PhysicsStateSizeCheck;
    static_assert(sizeof(RealtimeTransformModel::PhysicsState) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [RealtimePropertyAttribute] Offset: 0x716228
    // private UnityEngine.Vector3 _position
    // Size: 0xC
    // Offset: 0x8C
    ::UnityEngine::Vector3 position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [RealtimePropertyAttribute] Offset: 0x716244
    // private UnityEngine.Quaternion _rotation
    // Size: 0x10
    // Offset: 0x98
    ::UnityEngine::Quaternion rotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // [RealtimePropertyAttribute] Offset: 0x716260
    // private UnityEngine.Vector3 _scale
    // Size: 0xC
    // Offset: 0xA8
    ::UnityEngine::Vector3 scale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [RealtimePropertyAttribute] Offset: 0x71627C
    // private UnityEngine.Vector3 _velocity
    // Size: 0xC
    // Offset: 0xB4
    ::UnityEngine::Vector3 velocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [RealtimePropertyAttribute] Offset: 0x716298
    // private UnityEngine.Vector3 _angularVelocity
    // Size: 0xC
    // Offset: 0xC0
    ::UnityEngine::Vector3 angularVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [RealtimePropertyAttribute] Offset: 0x7162B4
    // private Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PhysicsState _physicsState
    // Size: 0x4
    // Offset: 0xCC
    ::Normal::Realtime::RealtimeTransformModel::PhysicsState physicsState;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeTransformModel::PhysicsState) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0x7162D0
    // private System.Single _physicsBodyTimeOffset
    // Size: 0x4
    // Offset: 0xD0
    float physicsBodyTimeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RealtimePropertyAttribute] Offset: 0x7162EC
    // private System.Single _physicsStateTimeOffset
    // Size: 0x4
    // Offset: 0xD4
    float physicsStateTimeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Normal.Realtime.RealtimeTransformModel/Normal.Realtime.TransformWriteHandler onWillWrite
    // Size: 0x8
    // Offset: 0xD8
    ::Normal::Realtime::RealtimeTransformModel::TransformWriteHandler* onWillWrite;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeTransformModel::TransformWriteHandler*) == 0x8);
    // private Normal.Realtime.RealtimeTransformModel/Normal.Realtime.TransformReadHandler onDidRead
    // Size: 0x8
    // Offset: 0xE0
    ::Normal::Realtime::RealtimeTransformModel::TransformReadHandler* onDidRead;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeTransformModel::TransformReadHandler*) == 0x8);
    // private System.Double <timestamp>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    double timestamp;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<UnityEngine.Vector3> _positionProperty
    // Size: 0x8
    // Offset: 0xF0
    ::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Vector3>* positionProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Vector3>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<UnityEngine.Quaternion> _rotationProperty
    // Size: 0x8
    // Offset: 0xF8
    ::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Quaternion>* rotationProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Quaternion>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<UnityEngine.Vector3> _scaleProperty
    // Size: 0x8
    // Offset: 0x100
    ::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Vector3>* scaleProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Vector3>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<UnityEngine.Vector3> _velocityProperty
    // Size: 0x8
    // Offset: 0x108
    ::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Vector3>* velocityProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Vector3>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<UnityEngine.Vector3> _angularVelocityProperty
    // Size: 0x8
    // Offset: 0x110
    ::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Vector3>* angularVelocityProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<::UnityEngine::Vector3>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.UInt32> _physicsStateProperty
    // Size: 0x8
    // Offset: 0x118
    ::Normal::Realtime::ReliableProperty_1<uint>* physicsStateProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<uint>*) == 0x8);
    // private Normal.Realtime.UnreliableProperty`1<System.Single> _physicsBodyTimeOffsetProperty
    // Size: 0x8
    // Offset: 0x120
    ::Normal::Realtime::UnreliableProperty_1<float>* physicsBodyTimeOffsetProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::UnreliableProperty_1<float>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Single> _physicsStateTimeOffsetProperty
    // Size: 0x8
    // Offset: 0x128
    ::Normal::Realtime::ReliableProperty_1<float>* physicsStateTimeOffsetProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<float>*) == 0x8);
    // private readonly Normal.Realtime.RealtimeTransformModel/Normal.Realtime.PropertyChangeSet _propertyChangeSet
    // Size: 0x8
    // Offset: 0x130
    ::Normal::Realtime::RealtimeTransformModel::PropertyChangeSet* propertyChangeSet;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeTransformModel::PropertyChangeSet*) == 0x8);
    public:
    // static field const value: static private System.Single EPSILON_POSITION
    static constexpr const float EPSILON_POSITION = 1e-10;
    // Get static field: static private System.Single EPSILON_POSITION
    static float _get_EPSILON_POSITION();
    // Set static field: static private System.Single EPSILON_POSITION
    static void _set_EPSILON_POSITION(float value);
    // static field const value: static private System.Single EPSILON_ROTATION
    static constexpr const float EPSILON_ROTATION = 1e-06;
    // Get static field: static private System.Single EPSILON_ROTATION
    static float _get_EPSILON_ROTATION();
    // Set static field: static private System.Single EPSILON_ROTATION
    static void _set_EPSILON_ROTATION(float value);
