// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Normal.Realtime.RealtimeModel
#include "Normal/Realtime/RealtimeModel.hpp"
// Including type: Normal.Realtime.RealtimeAvatar/Normal.Realtime.DeviceType
#include "Normal/Realtime/RealtimeAvatar_DeviceType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: ReliableProperty`1<T>
  template<typename T>
  class ReliableProperty_1;
}
// Forward declaring namespace: Normal::Realtime::Serialization
namespace Normal::Realtime::Serialization {
  // Skipping declaration: StreamContext because it is already included!
  // Forward declaring type: WriteStream
  class WriteStream;
  // Forward declaring type: ReadStream
  class ReadStream;
}
// Completed forward declares
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeAvatarModel
  class RealtimeAvatarModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Normal::Realtime::RealtimeAvatarModel);
DEFINE_IL2CPP_ARG_TYPE(::Normal::Realtime::RealtimeAvatarModel*, "Normal.Realtime", "RealtimeAvatarModel");
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: Normal.Realtime.RealtimeAvatarModel
  // [TokenAttribute] Offset: FFFFFFFF
  // [RealtimeModelAttribute] Offset: D4660
  class RealtimeAvatarModel : public ::Normal::Realtime::RealtimeModel {
    public:
    // Writing base type padding for base size: 0x8C to desired offset: 0x90
    char ___base_padding[0x4] = {};
    // Nested type: ::Normal::Realtime::RealtimeAvatarModel::PropertyChangedHandler_1<T>
    template<typename T>
    class PropertyChangedHandler_1;
    // Nested type: ::Normal::Realtime::RealtimeAvatarModel::PropertyID
    struct PropertyID;
    public:
    // [RealtimePropertyAttribute] Offset: 0xF66B0
    // private Normal.Realtime.RealtimeAvatar/Normal.Realtime.DeviceType _deviceType
    // Size: 0x4
    // Offset: 0x90
    ::Normal::Realtime::RealtimeAvatar::DeviceType deviceType;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeAvatar::DeviceType) == 0x4);
    // Padding between fields: deviceType and: deviceModel
    char __padding0[0x4] = {};
    // [RealtimePropertyAttribute] Offset: 0xF66E0
    // private System.String _deviceModel
    // Size: 0x8
    // Offset: 0x98
    ::StringW deviceModel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [RealtimePropertyAttribute] Offset: 0xF04B0
    // private System.Boolean _headActive
    // Size: 0x1
    // Offset: 0xA0
    bool headActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [RealtimePropertyAttribute] Offset: 0xF04E0
    // private System.Boolean _leftHandActive
    // Size: 0x1
    // Offset: 0xA1
    bool leftHandActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [RealtimePropertyAttribute] Offset: 0xF0510
    // private System.Boolean _rightHandActive
    // Size: 0x1
    // Offset: 0xA2
    bool rightHandActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: rightHandActive and: headActiveDidChange
    char __padding4[0x5] = {};
    // private Normal.Realtime.RealtimeAvatarModel/Normal.Realtime.PropertyChangedHandler`1<System.Boolean> headActiveDidChange
    // Size: 0x8
    // Offset: 0xA8
    ::Normal::Realtime::RealtimeAvatarModel::PropertyChangedHandler_1<bool>* headActiveDidChange;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeAvatarModel::PropertyChangedHandler_1<bool>*) == 0x8);
    // private Normal.Realtime.RealtimeAvatarModel/Normal.Realtime.PropertyChangedHandler`1<System.Boolean> leftHandActiveDidChange
    // Size: 0x8
    // Offset: 0xB0
    ::Normal::Realtime::RealtimeAvatarModel::PropertyChangedHandler_1<bool>* leftHandActiveDidChange;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeAvatarModel::PropertyChangedHandler_1<bool>*) == 0x8);
    // private Normal.Realtime.RealtimeAvatarModel/Normal.Realtime.PropertyChangedHandler`1<System.Boolean> rightHandActiveDidChange
    // Size: 0x8
    // Offset: 0xB8
    ::Normal::Realtime::RealtimeAvatarModel::PropertyChangedHandler_1<bool>* rightHandActiveDidChange;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeAvatarModel::PropertyChangedHandler_1<bool>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.UInt32> _deviceTypeProperty
    // Size: 0x8
    // Offset: 0xC0
    ::Normal::Realtime::ReliableProperty_1<uint>* deviceTypeProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<uint>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.String> _deviceModelProperty
    // Size: 0x8
    // Offset: 0xC8
    ::Normal::Realtime::ReliableProperty_1<::StringW>* deviceModelProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<::StringW>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Boolean> _headActiveProperty
    // Size: 0x8
    // Offset: 0xD0
    ::Normal::Realtime::ReliableProperty_1<bool>* headActiveProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<bool>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Boolean> _leftHandActiveProperty
    // Size: 0x8
    // Offset: 0xD8
    ::Normal::Realtime::ReliableProperty_1<bool>* leftHandActiveProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<bool>*) == 0x8);
    // private Normal.Realtime.ReliableProperty`1<System.Boolean> _rightHandActiveProperty
    // Size: 0x8
    // Offset: 0xE0
    ::Normal::Realtime::ReliableProperty_1<bool>* rightHandActiveProperty;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::ReliableProperty_1<bool>*) == 0x8);
    public:
    // Get instance field reference: private Normal.Realtime.RealtimeAvatar/Normal.Realtime.DeviceType _deviceType
    [[deprecated]] ::Normal::Realtime::RealtimeAvatar::DeviceType& dyn__deviceType();
    // Get instance field reference: private System.String _deviceModel
    [[deprecated]] ::StringW& dyn__deviceModel();
    // Get instance field reference: private System.Boolean _headActive
    [[deprecated]] bool& dyn__headActive();
    // Get instance field reference: private System.Boolean _leftHandActive
    [[deprecated]] bool& dyn__leftHandActive();
    // Get instance field reference: private System.Boolean _rightHandActive
    [[deprecated]] bool& dyn__rightHandActive();
