// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Normal.Realtime.Serialization.IModel
#include "Normal/Realtime/Serialization/IModel.hpp"
// Including type: Normal.Realtime.RealtimeModelEvent
#include "Normal/Realtime/RealtimeModelEvent.hpp"
// Including type: Normal.Realtime.Serialization.StreamContext
#include "Normal/Realtime/Serialization/StreamContext.hpp"
// Including type: Normal.Realtime.Serialization.MetaModel
#include "Normal/Realtime/Serialization/MetaModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Normal::Realtime::Serialization
namespace Normal::Realtime::Serialization {
  // Forward declaring type: WriteStream
  class WriteStream;
  // Forward declaring type: ReadStream
  class ReadStream;
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: Room
  class Room;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Forward declaring type: RealtimeModel
  class RealtimeModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Normal::Realtime::RealtimeModel);
DEFINE_IL2CPP_ARG_TYPE(::Normal::Realtime::RealtimeModel*, "Normal.Realtime", "RealtimeModel");
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Size: 0x8C
  #pragma pack(push, 1)
  // Autogenerated type: Normal.Realtime.RealtimeModel
  // [TokenAttribute] Offset: FFFFFFFF
  class RealtimeModel : public ::Il2CppObject/*, public ::Normal::Realtime::Serialization::IModel*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean <isFreshModel>k__BackingField
    // Size: 0x1
    // Offset: 0x10
    bool isFreshModel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isFreshModel and: metaModel
    char __padding0[0x7] = {};
    // private Normal.Realtime.Serialization.MetaModel _metaModel
    // Size: 0x8
    // Offset: 0x18
    ::Normal::Realtime::Serialization::MetaModel* metaModel;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Serialization::MetaModel*) == 0x8);
    // private Normal.Realtime.RealtimeModel _parent
    // Size: 0x8
    // Offset: 0x20
    ::Normal::Realtime::RealtimeModel* parent;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeModel*) == 0x8);
    // private Normal.Realtime.RealtimeModel[] _children
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::Normal::Realtime::RealtimeModel*> children;
    // Field size check
    static_assert(sizeof(::ArrayW<::Normal::Realtime::RealtimeModel*>) == 0x8);
    // private Normal.Realtime.Room _room
    // Size: 0x8
    // Offset: 0x30
    ::Normal::Realtime::Room* room;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<Normal.Realtime.RealtimeModelEvent,System.Action> _callbacks
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<::Normal::Realtime::RealtimeModelEvent, ::System::Action*>* callbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Normal::Realtime::RealtimeModelEvent, ::System::Action*>*) == 0x8);
    // private Normal.Realtime.Serialization.StreamContext _cachedReliableContext
    // Size: 0x20
    // Offset: 0x40
    ::Normal::Realtime::Serialization::StreamContext cachedReliableContext;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Serialization::StreamContext) == 0x20);
    // private System.Int32 _cachedReliableLength
    // Size: 0x4
    // Offset: 0x60
    int cachedReliableLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: cachedReliableLength and: cachedUnreliableContext
    char __padding7[0x4] = {};
    // private Normal.Realtime.Serialization.StreamContext _cachedUnreliableContext
    // Size: 0x20
    // Offset: 0x68
    ::Normal::Realtime::Serialization::StreamContext cachedUnreliableContext;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Serialization::StreamContext) == 0x20);
    // private System.Int32 _cachedUnreliableLength
    // Size: 0x4
    // Offset: 0x88
    int cachedUnreliableLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Normal::Realtime::Serialization::IModel
    operator ::Normal::Realtime::Serialization::IModel() noexcept {
      return *reinterpret_cast<::Normal::Realtime::Serialization::IModel*>(this);
    }
    // Get instance field reference: private System.Boolean <isFreshModel>k__BackingField
    bool& dyn_$isFreshModel$k__BackingField();
    // Get instance field reference: private Normal.Realtime.Serialization.MetaModel _metaModel
    ::Normal::Realtime::Serialization::MetaModel*& dyn__metaModel();
    // Get instance field reference: private Normal.Realtime.RealtimeModel _parent
    ::Normal::Realtime::RealtimeModel*& dyn__parent();
    // Get instance field reference: private Normal.Realtime.RealtimeModel[] _children
    ::ArrayW<::Normal::Realtime::RealtimeModel*>& dyn__children();
