// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: Normal.Realtime.CoroutineRunner
#include "Normal/Realtime/CoroutineRunner.hpp"
// Including type: Normal.Realtime.Native.Region
#include "Normal/Realtime/Native/Region.hpp"
// Including type: Normal.Realtime.Native.Cluster
#include "Normal/Realtime/Native/Cluster.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Forward declaring type: Datastore
  class Datastore;
  // Forward declaring type: RealtimeModel
  class RealtimeModel;
  // Forward declaring type: SessionCapture
  class SessionCapture;
  // Forward declaring type: IRealtimePrefabLoadDelegate
  class IRealtimePrefabLoadDelegate;
  // Forward declaring type: IRealtimePrefabInstantiateDelegate
  class IRealtimePrefabInstantiateDelegate;
  // Skipping declaration: ConnectionState because it is already included!
}
// Forward declaring namespace: Normal::Realtime::Native
namespace Normal::Realtime::Native {
  // Forward declaring type: Client
  class Client;
  // Forward declaring type: Matcher
  class Matcher;
  // Forward declaring type: AudioInputStream
  class AudioInputStream;
  // Forward declaring type: AudioOutputStream
  class AudioOutputStream;
  // Forward declaring type: NetworkInfo
  struct NetworkInfo;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Component because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Forward declaring type: Room
  class Room;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Normal::Realtime::Room);
DEFINE_IL2CPP_ARG_TYPE(::Normal::Realtime::Room*, "Normal.Realtime", "Room");
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: Normal.Realtime.Room
  // [TokenAttribute] Offset: FFFFFFFF
  class Room : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::Normal::Realtime::Room::ConnectionStateChanged
    class ConnectionStateChanged;
    // Nested type: ::Normal::Realtime::Room::RPCMessageReceived
    class RPCMessageReceived;
    // Nested type: ::Normal::Realtime::Room::ConnectionState
    struct ConnectionState;
    // Nested type: ::Normal::Realtime::Room::RoomEventHandler
    class RoomEventHandler;
    // Nested type: ::Normal::Realtime::Room::$$c__DisplayClass87_0
    class $$c__DisplayClass87_0;
    // Nested type: ::Normal::Realtime::Room::$ConnectToServer_Coroutine$d__87
    class $ConnectToServer_Coroutine$d__87;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Normal.Realtime.Room/Normal.Realtime.ConnectionState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ConnectionState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ConnectionState
      constexpr ConnectionState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Error
      static constexpr const int Error = -1;
      // Get static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Error
      static ::Normal::Realtime::Room::ConnectionState _get_Error();
      // Set static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Error
      static void _set_Error(::Normal::Realtime::Room::ConnectionState value);
      // static field const value: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Disconnected
      static constexpr const int Disconnected = 0;
      // Get static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Disconnected
      static ::Normal::Realtime::Room::ConnectionState _get_Disconnected();
      // Set static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Disconnected
      static void _set_Disconnected(::Normal::Realtime::Room::ConnectionState value);
      // static field const value: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState RequestingRoom
      static constexpr const int RequestingRoom = 1;
      // Get static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState RequestingRoom
      static ::Normal::Realtime::Room::ConnectionState _get_RequestingRoom();
      // Set static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState RequestingRoom
      static void _set_RequestingRoom(::Normal::Realtime::Room::ConnectionState value);
      // static field const value: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState PingingClusters
      static constexpr const int PingingClusters = 2;
      // Get static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState PingingClusters
      static ::Normal::Realtime::Room::ConnectionState _get_PingingClusters();
      // Set static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState PingingClusters
      static void _set_PingingClusters(::Normal::Realtime::Room::ConnectionState value);
      // static field const value: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState ConnectingToRoom
      static constexpr const int ConnectingToRoom = 3;
      // Get static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState ConnectingToRoom
      static ::Normal::Realtime::Room::ConnectionState _get_ConnectingToRoom();
      // Set static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState ConnectingToRoom
      static void _set_ConnectingToRoom(::Normal::Realtime::Room::ConnectionState value);
      // static field const value: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState ConnectedToRoom
      static constexpr const int ConnectedToRoom = 4;
      // Get static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState ConnectedToRoom
      static ::Normal::Realtime::Room::ConnectionState _get_ConnectedToRoom();
      // Set static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState ConnectedToRoom
      static void _set_ConnectedToRoom(::Normal::Realtime::Room::ConnectionState value);
      // static field const value: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Ready
      static constexpr const int Ready = 5;
      // Get static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Ready
      static ::Normal::Realtime::Room::ConnectionState _get_Ready();
      // Set static field: static public Normal.Realtime.Room/Normal.Realtime.ConnectionState Ready
      static void _set_Ready(::Normal::Realtime::Room::ConnectionState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated]] int& dyn_value__();
    }; // Normal.Realtime.Room/Normal.Realtime.ConnectionState
    #pragma pack(pop)
    static check_size<sizeof(Room::ConnectionState), 0 + sizeof(int)> __Normal_Realtime_Room_ConnectionStateSizeCheck;
    static_assert(sizeof(Room::ConnectionState) == 0x4);
    public:
    // private Normal.Realtime.Room/Normal.Realtime.ConnectionStateChanged connectionStateChanged
    // Size: 0x8
    // Offset: 0x10
    ::Normal::Realtime::Room::ConnectionStateChanged* connectionStateChanged;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room::ConnectionStateChanged*) == 0x8);
    // private Normal.Realtime.Room/Normal.Realtime.RPCMessageReceived rpcMessageReceived
    // Size: 0x8
    // Offset: 0x18
    ::Normal::Realtime::Room::RPCMessageReceived* rpcMessageReceived;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room::RPCMessageReceived*) == 0x8);
    // private System.String _name
    // Size: 0x8
    // Offset: 0x20
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Double _time
    // Size: 0x8
    // Offset: 0x28
    double time;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private Normal.Realtime.Room/Normal.Realtime.ConnectionState _connectionState
    // Size: 0x4
    // Offset: 0x30
    ::Normal::Realtime::Room::ConnectionState connectionState;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room::ConnectionState) == 0x4);
    // Padding between fields: connectionState and: datastoreFrameDuration
    char __padding4[0x4] = {};
    // private System.Double <datastoreFrameDuration>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    double datastoreFrameDuration;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Boolean _debugLogging
    // Size: 0x1
    // Offset: 0x40
    bool debugLogging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugLogging and: client
    char __padding6[0x7] = {};
    // private Normal.Realtime.Native.Client _client
    // Size: 0x8
    // Offset: 0x48
    ::Normal::Realtime::Native::Client* client;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Native::Client*) == 0x8);
    // private Normal.Realtime.CoroutineRunner _coroutineRunner
    // Size: 0x8
    // Offset: 0x50
    ::Normal::Realtime::CoroutineRunner* coroutineRunner;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::CoroutineRunner*) == 0x8);
    // private Normal.Realtime.CoroutineRunner/Normal.Realtime.CoroutineContext _activeConnectToServerCoroutine
    // Size: 0x8
    // Offset: 0x58
    ::Normal::Realtime::CoroutineRunner::CoroutineContext* activeConnectToServerCoroutine;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::CoroutineRunner::CoroutineContext*) == 0x8);
    // private UnityEngine.Component <realtime>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Component* realtime;
    // Field size check
    static_assert(sizeof(::UnityEngine::Component*) == 0x8);
    // private Normal.Realtime.Datastore _datastore
    // Size: 0x8
    // Offset: 0x68
    ::Normal::Realtime::Datastore* datastore;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Datastore*) == 0x8);
    // private System.Double _deltaTime
    // Size: 0x8
    // Offset: 0x70
    double deltaTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.UInt32 _nextUpdateID
    // Size: 0x4
    // Offset: 0x78
    uint nextUpdateID;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: nextUpdateID and: roomModel
    char __padding13[0x4] = {};
    // private Normal.Realtime.RealtimeModel _roomModel
    // Size: 0x8
    // Offset: 0x80
    ::Normal::Realtime::RealtimeModel* roomModel;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::RealtimeModel*) == 0x8);
    // private Normal.Realtime.SessionCapture _sessionCapture
    // Size: 0x8
    // Offset: 0x88
    ::Normal::Realtime::SessionCapture* sessionCapture;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::SessionCapture*) == 0x8);
    // private Normal.Realtime.Room/Normal.Realtime.RoomEventHandler onWillWrite
    // Size: 0x8
    // Offset: 0x90
    ::Normal::Realtime::Room::RoomEventHandler* onWillWrite;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room::RoomEventHandler*) == 0x8);
    // private Normal.Realtime.Room/Normal.Realtime.RoomEventHandler onWillRead
    // Size: 0x8
    // Offset: 0x98
    ::Normal::Realtime::Room::RoomEventHandler* onWillRead;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room::RoomEventHandler*) == 0x8);
    // private Normal.Realtime.Room/Normal.Realtime.RoomEventHandler onDidWrite
    // Size: 0x8
    // Offset: 0xA0
    ::Normal::Realtime::Room::RoomEventHandler* onDidWrite;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room::RoomEventHandler*) == 0x8);
    // private Normal.Realtime.Room/Normal.Realtime.RoomEventHandler onDidRead
    // Size: 0x8
    // Offset: 0xA8
    ::Normal::Realtime::Room::RoomEventHandler* onDidRead;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::Room::RoomEventHandler*) == 0x8);
    // private Normal.Realtime.IRealtimePrefabLoadDelegate <prefabLoadDelegate>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::Normal::Realtime::IRealtimePrefabLoadDelegate* prefabLoadDelegate;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::IRealtimePrefabLoadDelegate*) == 0x8);
    // private Normal.Realtime.IRealtimePrefabInstantiateDelegate <prefabInstantiateDelegate>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::Normal::Realtime::IRealtimePrefabInstantiateDelegate* prefabInstantiateDelegate;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::IRealtimePrefabInstantiateDelegate*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: private Normal.Realtime.Room/Normal.Realtime.ConnectionStateChanged connectionStateChanged
    [[deprecated]] ::Normal::Realtime::Room::ConnectionStateChanged*& dyn_connectionStateChanged();
    // Get instance field reference: private Normal.Realtime.Room/Normal.Realtime.RPCMessageReceived rpcMessageReceived
    [[deprecated]] ::Normal::Realtime::Room::RPCMessageReceived*& dyn_rpcMessageReceived();
    // Get instance field reference: private System.String _name
    [[deprecated]] ::StringW& dyn__name();
