// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: FileStream
  class FileStream;
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::IO::Compression
namespace System::IO::Compression {
  // Forward declaring type: GZipStream
  class GZipStream;
}
// Forward declaring namespace: Normal::Realtime
namespace Normal::Realtime {
  // Skipping declaration: Mode because it is already included!
}
// Completed forward declares
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Forward declaring type: SessionCaptureFileStream
  class SessionCaptureFileStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Normal::Realtime::SessionCaptureFileStream);
DEFINE_IL2CPP_ARG_TYPE(::Normal::Realtime::SessionCaptureFileStream*, "Normal.Realtime", "SessionCaptureFileStream");
// Type namespace: Normal.Realtime
namespace Normal::Realtime {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: Normal.Realtime.SessionCaptureFileStream
  // [TokenAttribute] Offset: FFFFFFFF
  class SessionCaptureFileStream : public ::Il2CppObject {
    public:
    // Nested type: ::Normal::Realtime::SessionCaptureFileStream::Mode
    struct Mode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode
    // [TokenAttribute] Offset: FFFFFFFF
    struct Mode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Mode
      constexpr Mode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode Write
      static constexpr const int Write = 0;
      // Get static field: static public Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode Write
      static ::Normal::Realtime::SessionCaptureFileStream::Mode _get_Write();
      // Set static field: static public Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode Write
      static void _set_Write(::Normal::Realtime::SessionCaptureFileStream::Mode value);
      // static field const value: static public Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode Read
      static constexpr const int Read = 1;
      // Get static field: static public Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode Read
      static ::Normal::Realtime::SessionCaptureFileStream::Mode _get_Read();
      // Set static field: static public Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode Read
      static void _set_Read(::Normal::Realtime::SessionCaptureFileStream::Mode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated]] int& dyn_value__();
    }; // Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode
    #pragma pack(pop)
    static check_size<sizeof(SessionCaptureFileStream::Mode), 0 + sizeof(int)> __Normal_Realtime_SessionCaptureFileStream_ModeSizeCheck;
    static_assert(sizeof(SessionCaptureFileStream::Mode) == 0x4);
    public:
    // private System.String _filePath
    // Size: 0x8
    // Offset: 0x10
    ::StringW filePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode _mode
    // Size: 0x4
    // Offset: 0x18
    ::Normal::Realtime::SessionCaptureFileStream::Mode mode;
    // Field size check
    static_assert(sizeof(::Normal::Realtime::SessionCaptureFileStream::Mode) == 0x4);
    // Padding between fields: mode and: fileStream
    char __padding1[0x4] = {};
    // private System.IO.FileStream _fileStream
    // Size: 0x8
    // Offset: 0x20
    ::System::IO::FileStream* fileStream;
    // Field size check
    static_assert(sizeof(::System::IO::FileStream*) == 0x8);
    // private System.IO.Compression.GZipStream _gzipStream
    // Size: 0x8
    // Offset: 0x28
    ::System::IO::Compression::GZipStream* gzipStream;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::GZipStream*) == 0x8);
    // private System.Boolean _writing
    // Size: 0x1
    // Offset: 0x30
    bool writing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _reading
    // Size: 0x1
    // Offset: 0x31
    bool reading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: reading and: startTimestamp
    char __padding5[0x6] = {};
    // private System.Double _startTimestamp
    // Size: 0x8
    // Offset: 0x38
    double startTimestamp;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Int32 _clientID
    // Size: 0x4
    // Offset: 0x40
    int clientID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.UInt32 _nextUpdateDeltaTimestamp
    // Size: 0x4
    // Offset: 0x44
    uint nextUpdateDeltaTimestamp;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    public:
    // Get instance field reference: private System.String _filePath
    [[deprecated]] ::StringW& dyn__filePath();
    // Get instance field reference: private Normal.Realtime.SessionCaptureFileStream/Normal.Realtime.Mode _mode
    [[deprecated]] ::Normal::Realtime::SessionCaptureFileStream::Mode& dyn__mode();
    // Get instance field reference: private System.IO.FileStream _fileStream
    [[deprecated]] ::System::IO::FileStream*& dyn__fileStream();
    // Get instance field reference: private System.IO.Compression.GZipStream _gzipStream
    [[deprecated]] ::System::IO::Compression::GZipStream*& dyn__gzipStream();
    // Get instance field reference: private System.Boolean _writing
    [[deprecated]] bool& dyn__writing();
    // Get instance field reference: private System.Boolean _reading
    [[deprecated]] bool& dyn__reading();
